[{
    "id":1,
    "title":"Second Chance",
    "html":"<p class=\"c1\"><em>“Let justice be done, though the Heavens Fall.”</em></p><p class=\"c1\"><span class=\"c0\">Every day feels like a replay of the past, starting from the moment I open my eyes until I close them for a night’s rest. Even when I’m only in my early youth, that spark of ambition is nowhere to be found— almost as if it never existed in the first place.</span></p><p class=\"c1\"><span class=\"c0\">My days go by without any standout moments. No achievements. No mistakes either. Just a quiet simple life. I might as well have been invisible, and nobody would have known that I was no longer there.</span></p><p class=\"c1\"><span class=\"c0\">The mystery surrounding my parentage adds to the loneliness. The people who are currently living with me— my supposed family, hardly pay me any attention. In return, I don’t pry into their lives either. It’s a strange kind of existence, like being a ghost in my own home.</span></p><p class=\"c1\"><span class=\"c0\">The same questions echo in my mind over and over again. Why am I here? What’s my purpose in this world? But no matter how much I think about it, the answers are never there to be found.</span></p><p class=\"c1\"><span class=\"c0\">Looking at others and their big dreams, it makes me feel lost. I can see that some people want honour and fame, while some people only want money, and a few others who just want a simple and happy life. When it comes to me though, I am not sure.</span></p><p class=\"c1\"><span class=\"c0\">What is it that I truly desire?</span></p><p class=\"c1\"><span class=\"c0\">Money might seem tempting, but the stress of handling it and the never-ending responsibilities scare me. And fame? The idea of always being in the spotlight, dealing with envy, is enough to make me shudder.</span></p><p class=\"c1\"><span class=\"c0\">An ordinary life, on the other hand, seems to be my lot, though it is a far cry from a happy one. And so, I continue to ponder, sinking deeper into the warm embrace of my blankets, struggling to discern my truest heart’s desire.</span></p><p class=\"c1\"><span class=\"c0\">-</span></p><p class=\"c1\"><span class=\"c0\">“Vincas… Wake up…”</span></p><p class=\"c1\"><span class=\"c0\">A gentle, feminine voice rouses me from my slumber, its soft tones coaxing me awake. </span></p><p class=\"c1\"><span class=\"c0\">Why do I need someone to tell me to wake up?</span></p><p class=\"c1\"><span class=\"c0\">I wonder groggily, my mind foggy from a deep sleep. As I slowly attempt to move my limbs, I find myself struggling against a strange resistance. Gradually, the sensation returns to me, starting with my arm, then my fingers, and finally my legs.</span></p><p class=\"c1\"><span class=\"c0\">I take a look at my surroundings, and it dawns on me that I am in a pitch-black space. The rough surface beneath me yields no clues as to my whereabouts other than the fact that I am definitely not at home.</span></p><p class=\"c1\"><span class=\"c0\">A glimmer of light in the distance draws me forward, and I make my way toward it, crawling through the dark. Eventually, I reach a small pond, the surface of which radiates a faint luminosity. The water is crystal clear, and I dip my hands into it, splashing it onto my face to clear the cobwebs from my mind. </span></p><p class=\"c1\"><span class=\"c0\">As I gaze into the reflection, I see the same short black hair and clear brown eyes that have always been mine. Despite the surreal circumstances of my awakening, I am still the same person.</span></p><p class=\"c1\"><span class=\"c0\">I take a deep breath, trying to calm myself down. The air here is fresh, but it's different from what I'm used to. It feels like a mix of pine and damp earth.</span></p><p class=\"c1\"><span class=\"c0\">Slowly and steady, I manage to walk myself out of what seems to be a cave. I then turn my attention to the beautiful long running blue sky and…</span></p><p class=\"c1\"><span class=\"c0\">Is that a…</span></p><p class=\"c1\"><span class=\"c0\">To my surprise, amidst the vast sky lies a giant crack as if it was splitting the sky in half. I can't help but wonder what caused it. Magic? God?</span></p><p class=\"c1\"><span class=\"c0\">I shake my head, trying to dispel the thoughts. I need to focus on the present. </span></p><p class=\"c1\"><span class=\"c0\">I look around again and notice that the cave has changed. The path that led me here is now blocked by a pile of rocks, and the wall seems to be carved with intricate symbols and patterns.</span></p><p class=\"c1\"><span class=\"c0\">I reach out to touch the wall, and it feels cold and smooth under my fingertips. As I take a step forward, a strange sensation washes over me. It feels like a clouded wave of memories is trying to course through my brain. I can feel my muscles tensing, and my heart rate quickening. I take a few steps back, and the feeling fades away, along with the mysterious letters on the wall.</span></p><p class=\"c1\"><span class=\"c0\">Strange things keep happening one after another but I believe that standing here will never be able to solve the mystery. I turn around, take a deep breath and take my first step into this new world.</span></p><p class=\"c1\"><span class=\"c0\">A jolt of panic shoots through me as the thought suddenly strikes. Am I naked?</span></p><p class=\"c1\"><span class=\"c0\">This unsettling scenario seems to happen all too often. But relief floods over me as I glance down and realise that, at least for now, I’m covered by a pair of old, ragged pants— not much, but enough to cover my vital spot. At the same time, it becomes clear that my clothes didn’t carry over with me.</span></p><p class=\"c1\"><span class=\"c0\">Undaunted, I start walking down any road I can find while my mind continues racing with thoughts. Perhaps, in answer to my prayer for a more exciting life, God has gifted me with this strange new world, with all the unimagined dangers and wonder.</span></p><p class=\"c1\"><span class=\"c0\">“[][][][]!!”</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, a child’s panicked cry pierces through my thoughts, and I instinctively rush towards the sound. As I draw closer, I see a young boy shielding a little girl from a small creature unlike anything I’ve ever seen before.</span></p><p class=\"c1\"><span class=\"c0\">The creature’s skin is a deep, unsettling black, and its tiny humanoid form stands on all fours. Its eyes are large and white with tiny black pupils, and its body is covered in a menacing array of sharp, spiky horns that run from its forehead down to its lower back. Its fingers and toes are tipped with razor-sharp claws, just as deadly as its horns. Its gaping maw is filled with sharp teeth, the same deep black as the rest of its body.</span></p><p class=\"c1\"><span class=\"c0\">In a simpler term, this creature is terrifying, but even as fear grips me, I know I have to act fast if I want to save these children.</span></p><p class=\"c1\"><span class=\"c0\">I search frantically for something, anything, to defend myself with. My hand alights on a small pebble, and I hurl it with all my might at the monstrous creature.</span></p><p class=\"c1\"><span class=\"c0\">I successfully manage to grab its attention but as it turns to face me, shivers of fear race down my spine. However, the sight of the little girl, nestled in the safety of her brother’s arms and gazing up at me with pleading eyes, gives me the strength to face this monster.</span></p><p class=\"c1\"><span class=\"c0\">Without a second thought, I charge forward, throwing myself between the creature and its intended prey. It recoils at my sudden attack, but quickly regains its footing and leaps back into the fray.</span></p><p class=\"c1\"><span class=\"c0\">“[][][][][] [][][]!”</span></p><p class=\"c1\"><span class=\"c0\">A warning shout from the boy behind me snaps me back to reality just in time to dodge its deadly jaws.</span></p><p class=\"c1\"><span class=\"c0\">The creature seems to have marked me as its prey and then attacks me in ferocity. But to my own surprise, my body responds with lightning-fast reflexes which allow me to avoid its deadly strikes time and time again. </span></p><p class=\"c1\"><span class=\"c0\">It’s true what they say about human strength: it’s only when we’re pushed to the brink that we can truly unleash our full potential. </span></p><p class=\"c1\"><span class=\"c0\">Even though this monster is no bigger than a child, I can’t afford to let my guard down for a moment. Every instinct in my body is screaming at me to stay alert and focused.</span></p><p class=\"c1\"><span class=\"c0\">Just imagine: it’s like facing a snarling wild dog on a deserted street— no matter how much you try to convince yourself that you’re not afraid, there’s always that nagging voice in the back of your mind telling you to run— to get away while you still can. But in that moment, all you can do is stand your ground and hope that you have what it takes to survive.</span></p><p class=\"c1\"><span class=\"c0\">Facing off against this otherworldly creature, I can feel my heart pounding in my chest and my breath coming in short, ragged gasps. But at the same time, there’s a fierce determination burning within me, a refusal to let this monster defeat me. For better or worse, I am all in and there’s no going back now.</span></p><p class=\"c1\"><span class=\"c0\">One step at a time, I slowly lure the creature away from the kids. The main goal here is to ensure their safety, so taking the fight somewhere far away is the best bet here. When I feel that there’s enough distance between us, I yell out to the kids.</span></p><p class=\"c1\"><span class=\"c0\">“Run!”</span></p><p class=\"c1\"><span class=\"c0\">Fortunately, the kids are bright enough to understand immediately that they need to get up and run as fast as they can away from here. Though, I cannot believe that I would ever put someone else’s life over my own.</span></p><p class=\"c1\"><span class=\"c0\">As the fight rages on, I feel a sense of exhilaration building within me. For the first time in my life, I am truly alive, and every fibre of my being is focused on this moment.</span></p><p class=\"c1\"><span class=\"c0\">I stare down the monster with newfound courage, my heart pounding in my chest as I try to keep my fear at bay. After the kids flee to safety, I brace myself for what’s to come.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Despite my best efforts, the creature manages to land a blow on my hip, leaving a trail of blood in its wake. I grit my teeth, trying to ignore the pain as I continue to fight on.</span></p><p class=\"c1\"><span class=\"c0\">It’s a long struggle. I don’t know when was the last time that I had to be this focused. The entire time, this monster has just been trying to kill me while I’m doing my best to avoid its deadly attacks.</span></p><p class=\"c1\"><span class=\"c0\">It is not only me who has noticed that my body is growing weaker and weaker with each passing moment, the monster does too. Suddenly, it lunges forward, and even with all my might to push it back, I still stumble and fall.</span></p><p class=\"c1\"><span class=\"c0\">\"Get off, you stupid f…\" I yelled helplessly.</span></p><p class=\"c1\"><span class=\"c0\">The menacing monster relentlessly tries to tear my head off at every opportunity. Its razor-sharp teeth are only inches away from my neck, and I can feel the heat of its breath on my face. I know that if I don’t do something fast, I’ll be nothing but dead meat. Summoning every ounce of strength in my body, I unleash a forceful kick with both legs, hoping to knock the creature off me.</span></p><p class=\"c1\"><span class=\"c0\">Unfortunately, my kick is not strong enough to dislodge the monster, and I realise with a sinking feeling that I may not survive this encounter. It's only been a short time but it looks like I'm going to be sent back to my world.</span></p><p class=\"c1\"><span class=\"c0\">The monster tries to tear off my face, but I manage to twist my head just in time. However, its fangs sink into my left shoulder instead. A sharp cry escapes my lips as pain shoots through me. With only a bit of strength left on my right arm, I swing it repeatedly at its head, but the creature refuses to release its grip.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">What is this? I’m still alive.</span></p><p class=\"c1\"><span class=\"c0\">I look up and see my right hand holding on a black dagger that has stabbed right on the creature’s neck. At the same time, a black circular mark appears on the back of that hand.</span></p><p class=\"c1\"><span class=\"c0\">What is this dagger? Did I just summon it?</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, it leaps at me again with the last resort of ripping me apart. I swing my dagger one more time and pierce through its head, causing it to draw its last breath and collapse to the side.</span></p><p class=\"c1\"><span class=\"c0\">Believing that it finally dies, I let out a huge sigh of relief and lay down flat.</span></p><p class=\"c1\"><span class=\"c0\">\"[][][] [][][] [][]?\"</span></p><p class=\"c1\"><span class=\"c0\">\"[][][] [][][] [][][][][]?\"</span></p><p class=\"c1\"><span class=\"c0\">As I look on in astonishment, I’m surrounded by a group of spearmen who speak a language I don’t understand. They seem taken aback by my presence, and I can see the confusion and disbelief etched on their faces.</span></p><p class=\"c1\"><span class=\"c0\">\"[][][][] [][] [][][][][][][][][][]?\"</span></p><p class=\"c1\"><span class=\"c0\">\"What are you saying? I don't understand.\"</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, the monster next to me begins to transform into a cloud of dark matter, which inexplicably begins to— get absorbed into my body? What?</span></p><p class=\"c1\"><span class=\"c0\">\"[][] [][] [] [][][][][][][]!\"</span></p><p class=\"c1\"><span class=\"c0\">Those people immediately raise their spears, and I can tell from the looks on their faces that they think I’m a monster too.</span></p><p class=\"c1\"><span class=\"c0\">\"[][][][]! [][] [][][][][] [][].\"</span></p><p class=\"c1\"><span class=\"c0\">Just as I think my fate is sealed, the same little boy steps forward to stand between me and the hostile crowd.</span></p><p class=\"c1\"><span class=\"c0\">\"[][][][] [][][][] [][][][] [][][]. [][] [][] [] [][][][][][][].\"</span></p><p class=\"c1\"><span class=\"c0\">They argue heatedly amongst themselves, but I can sense that the boy is trying to save me. Although before that… I’m starting to feel really dizzy. Ah.. it’s the blood loss… </span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next morning]</span></p><p class=\"c1\"><span class=\"c0\">\"Where am I?\"</span></p><p class=\"c1\"><span class=\"c0\">I wake up, finding myself locked in a cramped room, guarded by two burly men who eye me with suspicion and mistrust.</span></p><p class=\"c1\"><span class=\"c0\">A sense of hopelessness dreads over me as I realise the gravity of my situation. I try to imagine what these people must be thinking, as they witness the monstrous creature seeping into my body. Then, given the fact that I am a stranger in this foreign land and am unable to communicate with the locals, I feel utterly helpless if it comes to prove my innocence.</span></p><p class=\"c1\"><span class=\"c0\">Ah— here they come. A group of stern-looking men arrive to take me away while I steel myself for what I suspect will be a swift trial or execution. They lead me to a room with water flowing from a pipe in the ceiling— a design in which I assume to be a bathroom. They leave a few items of clothing on my arms before walking away, and I am left with a foreboding sense of dread.</span></p><p class=\"c1\"><span class=\"c0\">Am I supposed to clean my body up or something? It makes me recall a horrific scene that I’ve seen somewhere, where cannibalistic tribes wash their captives before slicing them up and eating them alive. </span></p><p class=\"c1\"><span class=\"c0\">When I’m done with the hygienic process, I am led to what appears to be a dining hall. The sight of so many people gathered together makes me feel like an outsider, and I can’t help but wonder if I am about to be the main course of this grisly feast.</span></p><p class=\"c1\"><span class=\"c0\">I am taken to an old man dressed slightly different than the others, who regards me with a measured gaze.</span></p><p class=\"c1\"><span class=\"c0\">“[] [][][][] [][][][] [][][] [][][][] [][][][] [][][] [][] [][][][]. [][][][][] [][][].”</span></p><p class=\"c1\"><span class=\"c0\">Again, I don’t understand what he’s saying. Are they about to do a ritual before the meal?</span></p><p class=\"c1\"><span class=\"c0\">Then, the little boy and girl show up. They appear to be shy but eventually gather enough courage to run up to me and give me a big warm hug. It seems that they are still grateful to me for saving their lives.</span></p><p class=\"c1\"><span class=\"c0\">They take my hands and bring me to a nearby table. It feels strange but maybe they are allowed to spend a bit more time with me before the others kill me off?</span></p><p class=\"c1\"><span class=\"c0\">When we walk down, everyone else looks at us and erupts in applause. Things start to become strange when they all sit down as soon as I sit down. I hear a few bell rings, then the side door opens up and lines of people carry out plates of food. They place the food nicely on the table and… I also get to have the food too?</span></p><p class=\"c1\"><span class=\"c0\">Wait a minute. They aren’t killing me? They are showing me their gratitude!</span></p><p class=\"c1\"><span class=\"c0\">I look carefully at the faces of the people here and realise that they are all giving me a gentle smile, including the chief. </span></p><p class=\"c1\"><span class=\"c0\">Hahaha… I laugh awkwardly to myself. It’s a strange moment of relief and gratitude at the same time as I realise that I have misjudged these people. They aren’t savages. </span></p><p class=\"c1\"><span class=\"c0\">Now that I take a closer look at the surroundings, I’m inside a mediaeval town hall and the way how people dress is as ordinary as they can get.</span></p><p class=\"c1\"><span class=\"c0\">I try these unfamiliar dishes and I can’t help but marvel at how different this world is from my own. I cannot recognise any meat or vegetable on the plates, but seeing that everyone is enjoying it, why not give it a try, especially when I’m already on an empty stomach?</span></p><p class=\"c1\"><span>The look may seem a bit plain, but each dish carries a unique taste that I cannot clearly describe in words. I may not know what animals these pieces of juicy meat come from, but at least, their taste resembles pork in my world. The vegetables are similar to the water spinach but to my surprise, as soon as I bite into it, a burst of </span><span>flavoury</span><span class=\"c0\">&nbsp;water is squished out of the stems.</span></p><p class=\"c1\"><span class=\"c0\">Well, what can I say? Let’s dig in on the rest of the plates here.</span></p><p class=\"c1\"><span class=\"c0\">— </span></p><p class=\"c1\"><span class=\"c0\">[One year later]</span></p><p class=\"c1\"><span class=\"c0\">“Hey, where [][][] you go[][][]?”</span></p><p class=\"c1\"><span class=\"c0\">A skinny looking boy in autumn brown curly hair runs after me. It’s Baldon, the little boy who I saved a year ago.</span></p><p class=\"c1\"><span class=\"c0\">“I - hunt,” I replied.</span></p><p class=\"c1\"><span class=\"c0\">Surprise! I am now able to speak their language, albeit in basic terms. It’s called Valorish. I have been diligently studying to comprehend the locals here and to my amazement, their alphabet and pronunciation bear a striking resemblance to my home language. Although the vocabulary appears distinct and the enunciation differs, the fundamental principles of grammar and spelling are akin.</span></p><p class=\"c1\"><span class=\"c0\">I am still at a beginner level though. There are still many words and phases that I don’t truly understand, but at least I am now able to hold a basic conversation.</span></p><p class=\"c1\"><span class=\"c0\">“[][][] I join?” Baldon asked.</span></p><p class=\"c1\"><span class=\"c0\">“No. You - care - Annie.”</span></p><p class=\"c1\"><span class=\"c0\">“But… I want [][] [][] hunt[][][] [][][][] you.”</span></p><p class=\"c1\"><span class=\"c0\">“When - you - older.”</span></p><p class=\"c1\"><span class=\"c0\">“I’m [][][][][][][] eleven [][][][] year!”</span></p><p class=\"c1\"><span class=\"c0\">“Not - old - enough.”</span></p><p class=\"c1\"><span class=\"c0\">“Then how old?”</span></p><p class=\"c1\"><span class=\"c0\">“Hm… sixteen?”</span></p><p class=\"c1\"><span class=\"c0\">“Sixteen?! That [][] five years away!”</span></p><p class=\"c1\"><span class=\"c0\">“If you - behave, I - take - you out - early.”</span></p><p class=\"c1\"><span class=\"c0\">“Fine. I will [][][][] play with Annie. When [][][] you go[][][] [][] [][] back?”</span></p><p class=\"c1\"><span class=\"c0\">“Before… Hm…”</span></p><p class=\"c1\"><span class=\"c0\">“Dawn?”</span></p><p class=\"c1\"><span class=\"c0\">“Dawn! Yes, dawn. Before - dawn.”</span></p><p class=\"c1\"><span class=\"c0\">“Are you sure you will take me hunt[][][] when I’m sixteen?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I promise, Baldon.” Baldon sulks and walks back into his hut.</span></p><p class=\"c1\"><span class=\"c0\">I prepare a variety of pouches of different sizes and hang them on my body. I also bring a sleek bow and a handful of arrows to help with the hunt.</span></p><p class=\"c1\"><span class=\"c0\">In addition to learning the local language, I’ve picked up numerous survival skills from the kind locals who have been very welcoming and helpful. They taught me the art of hunting, fishing, cooking, and equipping me with knowledge I need to navigate the surrounding terrain.</span></p><p class=\"c1\"><span class=\"c0\">Furthermore, they’ve generously allowed me to reside in a cosy hut of my own, although it may be a tad cramped, it provides ample room for all my essential requirements.</span></p><p class=\"c1\"><span class=\"c0\">I have also had the opportunity to learn more about the geographical area surrounding me, starting with the charming town I reside in, called Woodplain.</span></p><p class=\"c1\"><span class=\"c0\">Located in the outer part of the majestic kingdom of Valoria, it is fortunately quite peaceful and has beautiful landscapes. However, no one from the kingdom has ever stepped foot here due to two main reasons.</span></p><p class=\"c1\"><span class=\"c0\">Firstly, the distance is an obstacle. This world lacks any advanced means of transportation, and the fastest way to reach here is through horses or carriages that can take months.</span></p><p class=\"c1\"><span class=\"c0\">Secondly, the presence of terrifying monsters had scared away potential visitors. These beasts, aptly named “hellspawns” by the locals, have a devil-like appearance and an even more savage characteristic.</span></p><p class=\"c1\"><span class=\"c0\">These hellspawns are scattered everywhere, from the dense forests and towering mountains to the endless sky and vast seas. I was told that they come in different shapes and sizes, but the only form I’ve seen so far was the one I killed a year ago.</span></p><p class=\"c1\"><span class=\"c0\">These hellspawns have really tough skin that regular weapons can't cut through. Even though I don’t understand the logic behind it, but so far, my dagger is the only weapon that can damage these creatures here.</span></p><p class=\"c1\"><span class=\"c0\">Since then, we have spotted about fifteen of them and I have valiantly defeated each one. Each time I slay a hellspawn, it transforms into essence and flows into my body.</span></p><p class=\"c1\"><span class=\"c0\">The locals, at first, were bewildered by this strange phenomenon, but they have now come to accept it as I mean no harm and have always tried my best to adapt to the community here. They are also quite taken back by the fact that it’s their first time seeing these many hellspawns over the past few decades.</span></p><p class=\"c1\"><span class=\"c0\">Previously, only one every few years would appear, and in an area far away from the town. That’s why the folks here believe that this forest is most likely a safe haven, blessed by God, to let them survive.</span></p><p class=\"c1\"><span class=\"c0\">I have come to learn that the origins of these fearsome hellspawns remain a big mystery. As the locals recount, floating stone pillars have emerged around the same time as these terrifying creatures. The ground beneath these pillars sinks so deep into the underground that no one can tell how far it reaches. Many speculate that these holes may even connect to the netherworld, and that the hellspawns emerge from there.</span></p><p class=\"c1\"><span class=\"c0\">Lastly, these hellspawns do not merely feed on their victims. Instead, they simply kill every mortal they come across, sometimes including higher intelligent creatures. It’s almost as if… someone is controlling these beasts to bring extinction to mankind. Sounds crazy, hey?</span></p><p class=\"c1\"><span class=\"c0\">“I want [][] eat rabbit.” </span></p><p class=\"c1\"><span class=\"c0\">A small little girl comes out from the same hut as Baldon and speaks up. Her name is Annie.</span></p><p class=\"c1\"><span class=\"c0\">Rabbit is one of the main sources of meat around this area. They lack fangs or claws and are vulnerable to our hunting tools. The best they can do is hopping away when our presence is noticed. That’s why it makes them a highly sought-after source of meat in the woods. The other option is boar meat, but it’s a lot more difficult to hunt.</span></p><p class=\"c1\"><span class=\"c0\">“Sure.” I replied. “If - I can - find - one.”</span></p><p class=\"c1\"><span class=\"c0\">“You can. They are every[][][][][] around [][][][].”</span></p><p class=\"c1\"><span class=\"c0\">“Here? Every…?”</span></p><p class=\"c1\"><span class=\"c0\">“Where - everywhere - everywhere around here.”</span></p><p class=\"c1\"><span class=\"c0\">“Okay. I will - try.”</span></p><p class=\"c1\"><span class=\"c0\">“Not try. You have [][] [][][] it. I want [][] eat rabbit.”</span></p><p class=\"c1\"><span class=\"c0\">“Annie, I can’t - always - catch one every - time.”</span></p><p class=\"c1\"><span class=\"c0\">“Baldon told me you always [][][][][][] survive every time [][][][][] [][] a hellspawn.”</span></p><p class=\"c1\"><span class=\"c0\">“That brat… It’s not even the same thing.” I responded in my native language.</span></p><p class=\"c1\"><span class=\"c0\">“?”</span></p><p class=\"c1\"><span class=\"c0\">“Nothing. Okay, I will try - best - get you - biggest - rabbit out.”</span></p><p class=\"c1\"><span class=\"c0\">“Okay~”</span></p><p class=\"c1\"><span class=\"c0\">— </span></p><p class=\"c1\"><span class=\"c0\">[ Three hours later ]</span></p><p class=\"c1\"><span class=\"c0\">After receiving hunting lessons from these kind villagers, I have honed my skills and am now able to catch rabbits and sometimes wild boars.</span></p><p class=\"c1\"><span class=\"c0\">Today, like any other day, I was able to successfully catch a rabbit. While I’m sorry for taking its life, I must eat to survive. I am aware of the cycle of life and try to be thankful for the sacrifice the animal makes.</span></p><p class=\"c1\"><span>I can tell that I’m </span><span>taking life</span><span class=\"c0\">&nbsp;here pretty well. I haven’t even thought about my previous life, though it’s most likely because there was nothing for me to think about.</span></p><p class=\"c1\"><span class=\"c0\">My parents passed away when I was young and I was raised by my uncle and aunt, who kicked me out as soon as I turned eighteen. Then of course— friends, were those mysterious beings that I definitely did not have. I guess there is nothing that ties me back to my old world so it’s no surprise that I do not think about it.</span></p><p class=\"c1\"><span class=\"c0\">Compared to my past, where no one ever cared about me, the villagers here have welcomed me with open arms since I arrived and taught me many great things. I’m really grateful for everything that they’ve done for me.</span></p><p class=\"c1\"><span class=\"c0\">Anyway, I hope that Annie will enjoy this… Hm… What is this strange smell? It’s similar to the one that sometimes goes straight into the back of my nose. It’s… </span></p><p class=\"c1\"><span class=\"c0\">Blood!</span></p><p class=\"c1\"><span class=\"c0\">Panic sets in as I fear it could be a hellspawn attacking the village in my absence. I quickly make my way back to the village.</span></p><p class=\"c1\"><span class=\"c0\">No, this is not possible. All the previous incidents, even when I’m out in the forest, the hellspawn always seems to target me only.</span></p><p class=\"c1\"><span class=\"c0\">...</span></p><p class=\"c1\"><span class=\"c0\">What is this…</span></p><p class=\"c1\"><span class=\"c0\">What the fuck is this…</span></p><p class=\"c1\"><span class=\"c0\">What appears in my mind is a pile of corpses stacked on each other, and they are… all the familiar faces.</span></p><p class=\"c1\"><span class=\"c0\">No… This can’t be real.</span></p><p class=\"c1\"><span class=\"c0\">Beside this madness, there’s a pitch black disturbing creature standing there maliciously. Instead of crawling like the previous hellspawns, this one stands on its hindlegs while its arms grow absurdly large, to the point that the fingers can nearly touch the ground with its hunchback.</span></p><p class=\"c1\"><span class=\"c0\">Unlike the previous hellspawns I encountered, this one has a massive third mouth that spans from its chest down to its abdomen, lined with razor-sharp teeth. Within this gruesome maw, I see… small pieces of flesh and bone that… resemble a child’s figure.</span></p><p class=\"c1\"><span class=\"c0\">As if it’s not already macabre enough, on its other hand, the creature slowly lifts a rounded object and hurls it into the gaping stomach-mouth. My eyes widen in horror as I realise the object is a human head… and that is… </span></p><p class=\"c1\"><span class=\"c0\">Baldon’s head… It’s Baldon!</span></p><p class=\"c1\"><span class=\"c0\">“YOU BASTARD!!!”</span></p><p class=\"c1\"><span class=\"c0\">As if I’ve been thrown into a raging fire, I immediately draw my bow and fire an arrow at the hellspawn’s face, but it doesn’t even flinch. It’s as if I’ve thrown a pebble at a boulder. However, my action does get its attention, which is both a blessing and a curse.</span></p><p class=\"c1\"><span class=\"c0\">On one hand, I know I have to lead this hellspawn away from the village so that any remaining villagers can escape. On the other hand, I am alone in this battle, and the odds are stacked against me.</span></p><p class=\"c1\"><span class=\"c0\">I know that I must stay calm and focused if I am to have any chance of surviving this ordeal. As I take a breath to steady myself, I remind myself of my mission.</span></p><p class=\"c1\"><span class=\"c0\">I realise that I have not seen Annie yet, so she might still be alive somewhere here. I couldn’t save Baldon, but perhaps I can save her. With this thought in mind, I try to lure the hellspawn away from the village as far as possible so it cannot claim any more lives.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">What?!</span></p><p class=\"c1\"><span class=\"c0\">The monster makes a huge leap and lands right in front of me, blocking my escape route. How is it possible for a beast this big to jump so high and so quick?</span></p><p class=\"c1\"><span class=\"c0\">Just when it’s about to turn around and grab me with the other arm, I duck down and barely manage to evade it. I then use the momentum to slide down under its arm and slash the back of its thigh with my black dagger.</span></p><p class=\"c1\"><span class=\"c0\">However, it barely scratches it due to the monster’s thick hide. All of my instincts tell me that I can’t win this and must get away, so with all of my strength, I try to run as fast as I can.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn tries to grab me again but I manage to roll out of the way. I keep running while constantly asking myself if it is still chasing me.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">It catches up to me and swings me away.</span></p><p class=\"c1\"><span class=\"c0\">“Urgh!” I groaned.</span></p><p class=\"c1\"><span class=\"c0\">I struggle but still manage to get on my feet and run further into the forest. The sound of a tree wreck follows me but I’m too afraid to even stop and look.</span></p><p class=\"c1\"><span class=\"c0\">Behind the tree. This tree. That tree. I don’t know.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">It catches up to me again and with one hit, its gigantic arm sends me crashing into a tree. I started coughing out blood. My vision is fading.</span></p><p class=\"c1\"><span class=\"c0\">I can’t die here. It’s still not far enough from the village.</span></p><p class=\"c1\"><span class=\"c0\">Due to the blood loss, my vision starts to get blurry and I see multiple images of the hellspawn. I can’t even tell which one is the real one, or if it even matters anymore.</span></p><p class=\"c1\"><span class=\"c0\">Seeing my struggle, it lets out a wicked sound as if it’s laughing at my desperation. I try as hard as I can to keep running but in reality, I’m just limping away. </span></p><p class=\"c1\"><span class=\"c0\">The hellspawn slowly walks toward me as if it knows I can no longer escape from it. It swings its arm up and is ready to flatten me. I put up both of my arms in a desperate attempt to think that maybe I can miraculously block the attack.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">What is this? I’m still alive.</span></p><p class=\"c1\"><span class=\"c0\">I look up and see myself holding a pair of black daggers, blocking the monster’s arm. Suddenly, I can feel a surge of power in my arms so I strongly push the hellspawn away.</span></p><p class=\"c1\"><span class=\"c0\">For some odd reasons, more and more strength continues to flow within my body. Even the wound that I previously suffered seems to be slightly recovered.</span></p><p class=\"c1\"><span class=\"c0\">I didn’t know that I could actually summon more of this dagger.</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, it leaps at me again with a full intent of ripping me apart. I step aside and swing my daggers just like I did before in an attempt to cut its waist.</span></p><p class=\"c1\"><span class=\"c0\">The cut goes through and it lets out a painful cry.</span></p><p class=\"c1\"><span class=\"c0\">At that moment, I realised that the daggers are a slight upgrade of the previous one. Judging by the fact that it can cut through this one, the quality of the daggers must have improved from all the hellspawns that have been absorbed into my body for the past one year.</span></p><p class=\"c1\"><span class=\"c0\">The normal me from previous life would have pissed his pants but I don’t know why I don’t feel afraid to stand up against this monster right now.</span></p><p class=\"c1\"><span class=\"c0\">Call it bravery, or responsibility. I don’t care. I need to save Annie. I owe the village, and this is the least I can do to honour their sacrifices.</span></p><p class=\"c1\"><span class=\"c0\">The monster doesn’t let me continue my thought process and tries to smash me in a frenzy. I dodge its attacks with precision and throw in a few cuts whenever I can. </span></p><p class=\"c1\"><span class=\"c0\">I feel that I’m slowly turning this around.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn becomes more enraged as its body expands outward. Then, the large mouth in front of its body opens up with all of the pieces of corpses falling off. </span></p><p class=\"c1\"><span class=\"c0\">The sight of these dead bodies and that familiar head brings the nightmare back to me. My whole body feels like throwing up but again, I must hold on.</span></p><p class=\"c1\"><span class=\"c0\">Wait, there is something else.</span></p><p class=\"c1\"><span class=\"c0\">I see a faint light inside the mouth, and as it becomes more vivid, that’s when I realise.</span></p><p class=\"c1\"><span class=\"c0\">Fire!</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn breathes out fire through its third mouth like a flamethrower, burning all of the trees in its path.</span></p><p class=\"c1\"><span class=\"c0\">Thanks to the enhanced sense and vision that I just got, I once barely manage to get away in time. The fire keeps going on for a while until it starts to get weaker. I think the hellspawn cannot breath out the fire infinitely and will need to either take a break or replenish the fuel.</span></p><p class=\"c1\"><span class=\"c0\">As I have predicted, the fire stops. I feel that the hellspawn is trying to recharge, so I immediately run up to it in an attempt to cut it down.</span></p><p class=\"c1\"><span class=\"c0\">To my mistake, instead of stopping or taking a break, it decides to charge right back to me with a force that looks like it will crush everything in its path.</span></p><p class=\"c1\"><span class=\"c0\">I grab firmly on my sword, and just when the monster is able to hit me, I evade the attack and counter it with a side sweep.</span></p><p class=\"c1\"><span class=\"c0\">Before I could finish my slash, the monster slams its arm at me and sends me into the air. When I land down, the impact gets me real good.</span></p><p class=\"c1\"><span class=\"c0\">Normally, I should not be able to move my body from that hit, but thanks to this strange new power that I have just acquired, I’m still able to stand back up.</span></p><p class=\"c1\"><span class=\"c0\">I can’t win this one. I just can’t. There is no way in hell I can beat it right now. </span></p><p class=\"c1\"><span class=\"c0\">How about I just run away? The goal is to get this monster as far away as possible from the village. I was never meant to take it down from the first place, so why have I even been trying so damn hard for it?</span></p><p class=\"c1\"><span class=\"c0\">Once I make up my mind, I suddenly turn around and continue to run further into the forest. My mind is a blur, trying to think of a way to outsmart this creature, but my body is just focused on running.</span></p><p class=\"c1\"><span class=\"c0\">As I turn my head, I can see that the hellspawn is still chasing me and worse, closing in on me with each stride. It looks like I also need to give up on the idea of outrunning it.</span></p><p class=\"c1\"><span class=\"c0\">I have to find a way to slow it down, or else it will catch up to me and end my life. Suddenly, an idea pops into my head.</span></p><p class=\"c1\"><span class=\"c0\">I remember during one of my hunting lessons, the villagers told me about a type of plant that can paralyse its victims. I don’t know if it’s even effective against the hellspawn but it’s worth a try.</span></p><p class=\"c1\"><span class=\"c0\">I veer off the path and start sprinting towards the area where I know this plant grows— near the edge of a cliff. As I run, I can hear the hellspawn getting closer and closer, but I don’t stop. I push myself harder and harder until I finally reach the patch of plants.</span></p><p class=\"c1\"><span class=\"c0\">Without hesitating, I rip off my clothes, wrap it around my hand and grab a handful of leaves from the patch. I turn around, facing the hellspawn as it charges towards me with all its might.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">I manage to dodge its charge attack and throw the leaves into its face.</span></p><p class=\"c1\"><span class=\"c0\">“Did it work?” I asked myself.</span></p><p class=\"c1\"><span class=\"c0\">I observe the reaction from the hellspawn, ignoring the racing heart beats in my chest. The hellspawn roars in agony, but more of an irritated one rather than the painful one.</span></p><p class=\"c1\"><span class=\"c0\">Damn it. I should’ve known that a monster like this guy usually doesn’t get stunned by just a bunch of leaves. The hellspawn opens its third mouth and once again, prepares to do another fire attack.</span></p><p class=\"c1\"><span>I instinctively </span><span>throw</span><span class=\"c0\">&nbsp;one of my daggers into its mouth, hoping to disrupt its fire-breathing attack. To my surprise, the dagger seems to nullify its fire attack as the smoke comes out instead of the blazing hot flame.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn appears to recoil in pain when its attack backfires, and as it stumbles backwards, I notice that we’re both standing perilously close to the edge of a cliff.</span></p><p class=\"c1\"><span class=\"c0\">Wait, if it’s a cliff… maybe I can… </span></p><p class=\"c1\"><span class=\"c0\">At this moment, I realise what needs to be done. The hellspawn who is a danger to the village behind my back, is now facing me, with its back very close to the edge of the cliff.</span></p><p class=\"c1\"><span class=\"c0\">If… I just jump onto it and somehow push it back a bit more, perhaps I can push it off the cliff and even if it doesn’t kill it, it will still take the hellspawn a while to get back to the village?</span></p><p class=\"c1\"><span class=\"c0\">I don’t know whether I can survive it though… No. There is no more time to think. It’s time to act.</span></p><p class=\"c1\"><span class=\"c0\">I run straight into it, expecting a hook will come out from either of its arms.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">There it is— the hook.</span></p><p class=\"c1\"><span class=\"c0\">I jump up, over its arm, and then step onto it, using it as a sturdy ground to leap towards the hellspawn’s face. The hellspawn responds with an ominous growl, opening its large mouth to bite me, but I am not fazed. I use my remaining dagger and dig it deep within the hellspawn’s eye.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn writhes and struggles to get the dagger off while I hold onto it for my dear life, trying not to get thrown off the cliff. After god knows how many dizzying spins, I feel that my balance is about to slip away. I have only one more chance to end this.</span></p><p class=\"c1\"><span class=\"c0\">Just one more second…</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, the hellspawn starts to slow down. No way in hell that the paralysis leaves are starting to work now, right?</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn steps one of its feet off the cliff, and I know this is my opportunity. I pour all of my strength to push the dagger deeper down, almost as if the whole handle is burrowed deep into its eye socket. Then, I land a few more punches on its face before finally releasing my grip off the dagger.</span></p><p class=\"c1\"><span class=\"c0\">With the remaining of my last strength, I kick off the hellspawn face, causing it to further lose its balance and step into the empty air beside the cliff.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn struggles to grab onto something, and I try as best as I can to put my legs up, leaving the hellspawn helplessly to fall off the cliff.</span></p><p class=\"c1\"><span class=\"c0\">I fall down, about to lose my consciousness, but before that happens, I make sure I hear a loud thump sound coming from below. I put all of my focus on listening, and finally, there’s no more other sound.</span></p><p class=\"c1\"><span class=\"c0\">No roar, no tree crashing. It looks like the monster is finally done for.</span></p><p class=\"c1\"><span class=\"c0\">To make my confirmation even more clear, I see the dark matter floats back up and goes into my body. It feels like a small victory, a triumph of the light against the darkness.</span></p><p class=\"c1\"><span class=\"c0\">It’s finally over.</span></p><p class=\"c1\"><span class=\"c0\">I collapse on the ground, panting and sweating. My heart is still racing with adrenaline. Exhausted, I close my eyes and take a short break, trying to catch my breath.</span></p><p class=\"c1\"><span class=\"c0\">I look up at the sky, feeling a sense of pride and accomplishment. I know that I need to get back to the village, to look for Annie and any survivors, but for now, I am just glad that I made it out alive.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[An hour later]</span></p><p class=\"c1\"><span class=\"c0\">I’m finally back in the village after an hour of struggle between my body breaking apart and my mind telling me to keep going.</span></p><p class=\"c1\"><span class=\"c0\">The devastation of the village is even worse up close. I can smell the smoke and see the charred remains of buildings and homes. The air is heavy with a sense of loss and despair. My heart is heavy, and my mind is racing with thoughts of what it could have been if I was there.</span></p><p class=\"c1\"><span class=\"c0\">“Annie! Annie!” I shouted out her name repeatedly, hoping that she would hear me.</span></p><p class=\"c1\"><span class=\"c0\">I limp around, trying to search for any survivors. I desperately go through every corner, lift up all the things that I believe may be good hiding grounds, but still to no prevail.</span></p><p class=\"c1\"><span class=\"c0\">“Come on. Annie… Please tell me you’re still alive.” I murmured to myself.</span></p><p class=\"c1\"><span class=\"c0\">I remember that I have not yet seen her body so she may still be alive. The hellspawn was trying to consume all of the dead bodies when I first approached it, which means that either she might have escaped its grasp, or she was already at the bottom of its stomach.</span></p><p class=\"c1\"><span class=\"c0\">I shake my head, trying to rust off the false thoughts. I keep searching and searching but there is just nothing. Let’s just take a step back and re-imagine the whole situation.</span></p><p class=\"c1\"><span class=\"c0\">By the time I came back, everybody was dead, and the hellspawn was about to eat up… Baldon. All of the bodies were already inside the big mouth, so Baldon would have been the last one.</span></p><p class=\"c1\"><span class=\"c0\">That means the village was putting their lives in the front to save the kids. Baldon getting caught would be a situation where he was ready to sacrifice himself to protect his little sister. This potentially means that Annie has not been caught yet, because otherwise, she would have been the last one to be thrown into the mouth.</span></p><p class=\"c1\"><span class=\"c0\">Think… If the hellspawn was facing that direction… then… the storage?</span></p><p class=\"c1\"><span class=\"c0\">This would be a good hiding spot since the villagers store all types of meats here, so the smell would be able to cover her. In addition, hellspawns do not eat the bodies so they would most likely skip past this hut. Though, the one today was a different case.</span></p><p class=\"c1\"><span class=\"c0\">As I step inside the storage hut, my heart races and my breath quickens. I search around frantically, my eyes darting from one corner to the next. It’s dark and musty, with a strong smell of meat filling the air.</span></p><p class=\"c1\"><span class=\"c0\">Is she here…</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">I see a familiar little figure hiding behind trunks of meat in the corner.</span></p><p class=\"c1\"><span class=\"c0\">“Annie!” I shouted, relief flooding through me.</span></p><p class=\"c1\"><span class=\"c0\">“Anni…”</span></p><p class=\"c1\"><span class=\"c0\">…</span></p><p class=\"c1\"><span class=\"c0\">“No… No. This can’t be…”</span></p><p class=\"c1\"><span class=\"c0\">It’s indeed Annie… just… I can clearly see the left side of her torso has been burnt up all the way to the chest. I refuse to believe in my vision and get a hold of her fragile body.</span></p><p class=\"c1\"><span class=\"c0\">Her emotionless unclosed eyes, and the expressionless from her face… She’s gone.</span></p><p class=\"c1\"><span class=\"c0\">…</span></p><p class=\"c1\"><span class=\"c0\">“ARGGHHHHH!!!”</span></p><p class=\"c1\"><span class=\"c0\">I let out a cry of despair— one that I never thought that I would feel. I failed them. I failed her.</span></p><p class=\"c1\"><span class=\"c0\">Here I thought that I would be someone special, who was brought into this world with a unique power to absorb the monsters here.</span></p><p class=\"c1\"><span class=\"c0\">Here I thought that I would continue to grow stronger and become a hero in this world.</span></p><p class=\"c1\"><span class=\"c0\">Yet… the very first people who accepted me and took care of me… I could not protect even a single one of them.</span></p><p class=\"c1\"><span class=\"c0\">I keep crying, unable to stop my tears from overflowing. The flames of rage and despair keep burning inside of me, and I can’t seem to put them out. I keep asking myself over and over again, “Why did this have to happen?”</span></p><p class=\"c1\"><span class=\"c0\">Annie’s lifeless body is still in my arms and I refuse to let her go. It’s like holding onto a precious memory that I never want to fade away.</span></p><p class=\"c1\"><span class=\"c0\">I stare up at the sky, wondering if there is any hope left in this world. As the day goes by and night wears on, I slowly drift into a restless sleep, still clutching onto Annie’s body.</span></p><p class=\"c1\"><span class=\"c0\">My dreams are haunted by images of the hellspawn and the burning village, and I wake up many times, finding myself drenched in sweat.</span></p><p class=\"c1\"><span class=\"c0\">I know that I can’t keep wallowing in my grief and self-pity. I need to find a way to honour the memory of those who have fallen, and to make sure that their lives will not be forgotten.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Few days later]</span></p><p class=\"c1\"><span class=\"c0\">“That should be the last one.”</span></p><p class=\"c1\"><span class=\"c0\">I lay out the last body into the ground, burrowed, along with the rest of the villagers. With only limited resources, all I can do is place tree branches with their names for each of the tombs.</span></p><p class=\"c1\"><span class=\"c0\">I head back to the burnt hut and gather as many usable items as I can. With the village turning out like this, I don’t think I can stay here anymore. Honestly, I don’t even know where I am supposed to go.</span></p><p class=\"c1\"><span class=\"c0\">I consider seeking out other survivors or exploring new areas to find a new community to join. I may not be a local here, but I have adapted a few useful abilities that can be valuable in helping others. Not to mention that I can hold my own ground against a hellspawn.</span></p><p class=\"c1\"><span>However, I don’t know if other people out there would be as welcoming as here. I shake my head, and remind myself that I have mourned the loss and done with my grief so I need to stop thinking back about how good it was, or would have been, and instead, just focus on moving myself forward.</span></p><div><p class=\"c2\"><span class=\"c0\"></span></p></div>"
}]