[{
    "id":1,
    "title":"A New Beginning",
    "html":"<p class=\"c1\"><span class=\"c2\">&ldquo;Let justice be done, though the Heavens Fall.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">Every day feels like a replay of the past, starting from the moment I open my eyes until I close them for a night&rsquo;s rest. Even when I&rsquo;m only in my early youth, that spark of ambition is nowhere to be found&mdash;almost as if it never existed in the first place.</span></p><p class=\"c1\"><span class=\"c0\">My days go by without any standout moments. No achievements. No mistakes either. Just a quiet simple life. I might as well have been invisible, and nobody would have known that I was no longer there.</span></p><p class=\"c1\"><span class=\"c0\">The mystery surrounding my parentage adds to the loneliness. The people who are currently living with me&mdash;my supposed family, hardly pay me any attention. In return, I don&rsquo;t pry into their lives either. It&rsquo;s a strange kind of existence, like being a ghost in my own home.</span></p><p class=\"c1\"><span class=\"c0\">The same questions echo in my mind over and over again. Why am I here? What&rsquo;s my purpose in this world? But no matter how much I think about it, the answers are never there to be found.</span></p><p class=\"c1\"><span class=\"c0\">Looking at others and their big dreams, it makes me feel lost. I can see that some people want honour and fame, while some people only want money, and a few others who just want a simple and happy life. When it comes to me though, I am not sure.</span></p><p class=\"c1\"><span class=\"c0\">What is it that I truly desire?</span></p><p class=\"c1\"><span class=\"c0\">Money might seem tempting, but the stress of handling it and the never-ending responsibilities scare me. And fame? The idea of always being in the spotlight, dealing with envy, is enough to make me shudder.</span></p><p class=\"c1\"><span class=\"c0\">An ordinary life, on the other hand, seems to be my lot, though it is a far cry from a happy one. And so, I continue to ponder, sinking deeper into the warm embrace of my blankets, struggling to discern my truest heart&rsquo;s desire.</span></p><p class=\"c1\"><span class=\"c0\">&mdash;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Vincas&hellip; Wake up&hellip;&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">A gentle, feminine voice rouses me from my slumber, its soft tones coaxing me awake. </span></p><p class=\"c1\"><span class=\"c0\">Why do I need someone to tell me to wake up?</span></p><p class=\"c1\"><span class=\"c0\">I wonder groggily, my mind foggy from a deep sleep. As I slowly attempt to move my limbs, I find myself struggling against a strange resistance. Gradually, the sensation returns to me, starting with my arm, then my fingers, and finally my legs.</span></p><p class=\"c1\"><span class=\"c0\">I take a look at my surroundings, and it dawns on me that I am in a pitch-black space. The rough surface beneath me yields no clues as to my whereabouts other than the fact that I am definitely not at home.</span></p><p class=\"c1\"><span class=\"c0\">A glimmer of light in the distance draws me forward, and I make my way toward it, crawling through the dark. Eventually, I reach a small pond, the surface of which radiates a faint luminosity. The water is crystal clear, and I dip my hands into it, splashing it onto my face to clear the cobwebs from my mind. </span></p><p class=\"c1\"><span class=\"c0\">As I gaze into the reflection, I see the same short black hair and clear brown eyes that have always been mine. Despite the surreal circumstances of my awakening, I am still the same person.</span></p><p class=\"c1\"><span class=\"c0\">I take a deep breath, trying to calm myself down. The air here is fresh, but it&#39;s different from what I&#39;m used to. It feels like a mix of pine and damp earth.</span></p><p class=\"c1\"><span class=\"c0\">Slowly and steady, I manage to walk myself out of what seems to be a cave. I then turn my attention to the beautiful long running blue sky and&hellip;</span></p><p class=\"c1\"><span class=\"c0\">Is that a&hellip;</span></p><p class=\"c1\"><span class=\"c0\">Before me looms an immense stone pillar, suspended high in the sky&mdash;a colossal, inverted teardrop hovering impossibly against the clouds.</span></p><p class=\"c1\"><span class=\"c0\">The shape is strange and unsettling, tapering to a narrow point at its base while widening upward, where a hollowed void gapes at its centre. </span></p><p class=\"c1\"><span>What </span><span class=\"c5\">is</span><span class=\"c0\">&nbsp;that thing? I&rsquo;ve never seen anything like it before.</span></p><p class=\"c1\"><span class=\"c0\">It radiates an ominous energy, almost tangible, as if the air itself grows heavy and oppressive beneath its eerie shadow. Every instinct within me recoils; a silent dread grips me as I stare up at it, though I can&rsquo;t place exactly why.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, a faint scream pierces the stillness of the air, drifting toward me from somewhere deeper within the forest. </span></p><p class=\"c1\"><span>I freeze, my instincts urging caution&mdash;whatever is out there could be dangerous. But&hellip; </span><span>what</span><span class=\"c0\">&nbsp;if it&rsquo;s a legitimate cry of help?</span></p><p class=\"c1\"><span class=\"c0\">Hesitation gnaws at me. Should I go, or should I not?</span></p><p class=\"c1\"><span class=\"c0\">Part of me is terrified of what could be behind the sound&hellip; but another part of me feels like this is finally the unordinary moment that I&rsquo;ve been waiting for.</span></p><p class=\"c1\"><span class=\"c0\">Whatever&hellip; If I die, I die.</span></p><p class=\"c1\"><span class=\"c0\">Bracing myself, I sprint forward, weaving through the thick undergrowth and winding trees. The scream grows louder as I press on, joined by other desperate voices that seem to echo from multiple directions. </span></p><p class=\"c1\"><span class=\"c0\">The unmistakable clash of metal against metal cuts through the cries, reverberating in the cool, damp air&mdash;like the sound of a fierce battle raging just beyond my sight.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">The sharp rustling of leaves nearby snaps me to a halt. </span></p><p class=\"c1\"><span class=\"c0\">My breath catches as I spot movement just beyond the trees. Slowly, from behind the shadowy trunks, something steps into view&mdash;a creature like nothing I&rsquo;ve seen before.</span></p><p class=\"c1\"><span class=\"c0\">The creature&rsquo;s skin is a deep, unsettling black, and its tiny humanoid form stands on all fours. Its eyes are large and white with tiny black pupils, and its body is covered in a menacing array of sharp, spiky horns that run from its forehead down to its lower back. Its fingers and toes are tipped with razor-sharp claws, just as deadly as its horns. Its gaping maw is filled with sharp teeth, the same deep black as the rest of its body.</span></p><p class=\"c1\"><span class=\"c0\">In a simpler term, this creature is terrifying, but even as fear grips me, I know I have to act fast if I want to survive. I search frantically for something, anything, to defend myself with. My hand alights on a small pebble.</span></p><p class=\"c1\"><span class=\"c0\">The monstrous creature starts running at me, so I hurl that pebble with all my might at it. Unfortunately, it does nothing.</span></p><p class=\"c1\"><span class=\"c0\">The creature seems to have marked me as its prey and then attacks me in ferocity. But to my own surprise, my body responds with lightning-fast reflexes which allow me to avoid its deadly strikes time and time again.</span></p><p class=\"c1\"><span class=\"c0\">It&rsquo;s true what they say about human strength: it&rsquo;s only when we&rsquo;re pushed to the brink that we can truly unleash our full potential. </span></p><p class=\"c1\"><span class=\"c0\">Even though this monster is no bigger than a child, I can&rsquo;t afford to let my guard down for a moment. Every instinct in my body is screaming at me to stay alert and focused.</span></p><p class=\"c1\"><span class=\"c0\">Just imagine: it&rsquo;s like facing a snarling wild dog on a deserted street&mdash;no matter how much you try to convince yourself that you&rsquo;re not afraid, there&rsquo;s always that nagging voice in the back of your mind telling you to run&mdash;to get away while you still can. But in that moment, all you can do is stand your ground and hope that you have what it takes to survive.</span></p><p class=\"c1\"><span class=\"c0\">Facing off against this otherworldly creature, I can feel my heart pounding in my chest and my breath coming in short, ragged gasps. But at the same time, there&rsquo;s a fierce determination burning within me, a refusal to let this monster defeat me. For better or worse, I am all in and there&rsquo;s no going back now.</span></p><p class=\"c1\"><span class=\"c0\">As the fight rages on, I feel a sense of exhilaration building within me. For the first time in my life, I am truly alive, and every fibre of my being is focused on this moment.</span></p><p class=\"c1\"><span class=\"c0\">I stare down the monster with newfound courage, my heart pounding in my chest as I try to keep my fear at bay.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Despite my best efforts, the creature manages to land a blow on my hip, leaving a trail of blood in its wake. I grit my teeth, trying to ignore the pain as I continue to fight on.</span></p><p class=\"c1\"><span class=\"c0\">It&rsquo;s a long struggle. I don&rsquo;t know when was the last time that I had to be this focused. The entire time, this monster has just been trying to kill me while I&rsquo;m doing my best to avoid its deadly attacks.</span></p><p class=\"c1\"><span class=\"c0\">It is not only me who has noticed that my body is growing weaker and weaker with each passing moment, the monster does too. Suddenly, it lunges forward, and even with all my might to push it back, I still stumble and fall.</span></p><p class=\"c1\"><span class=\"c0\">&quot;Get off, you stupid f&hellip;&quot; I yelled helplessly.</span></p><p class=\"c1\"><span class=\"c0\">The menacing monster relentlessly tries to tear my head off at every opportunity. Its razor-sharp teeth are only inches away from my neck. I know that if I don&rsquo;t do something fast, I&rsquo;ll be nothing but dead meat. Summoning every ounce of strength in my body, I unleash a forceful kick with both legs, hoping to knock the creature off me.</span></p><p class=\"c1\"><span class=\"c0\">Unfortunately, my kick is not strong enough to dislodge the monster, and I realise with a sinking feeling that I may not survive this encounter. It&#39;s only been a short time but it looks like I&#39;m going to be sent back to my world.</span></p><p class=\"c1\"><span class=\"c0\">The monster tries to tear off my face, but I manage to twist my head just in time. However, its fangs sink into my left shoulder instead. A sharp cry escapes my lips as pain shoots through me. With only a bit of strength left on my right arm, I swing it repeatedly at its head, but the creature refuses to release its grip.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">What is this? I&rsquo;m still alive.</span></p><p class=\"c1\"><span class=\"c0\">I look up, and to my astonishment, the creature is impaled by a gleaming, razor-sharp spear that&rsquo;s buried deep into its twisted flesh. </span></p><p class=\"c1\"><span class=\"c0\">Faint cry echoes around its trembling form as it writhes in a last, futile attempt to escape.</span></p><p class=\"c1\"><span class=\"c0\">Believing that it finally dies, I let out a huge sigh of relief and lay down flat.</span></p><p class=\"c1\"><span class=\"c0\">A figure steps forward, clad in a full suit of silver armour.</span></p><p class=\"c1\"><span class=\"c0\">&quot;[][][] [][][] [][]?&quot;</span></p><p class=\"c1\"><span class=\"c0\">As I look on in astonishment, my saviour is speaking a language I don&rsquo;t understand. He seems taken aback by my reaction, and I can see the confusion and disbelief etched on his face.</span></p><p class=\"c1\"><span class=\"c0\">&quot;[][][][] [][] [][][][][][][][][][]?&quot;</span></p><p class=\"c1\"><span class=\"c0\">&quot;What are you saying? I don&#39;t understand.&quot;</span></p><p class=\"c1\"><span class=\"c0\">&quot;[][] [][] [] [][][][][][][]!&quot;</span></p><p class=\"c1\"><span class=\"c0\">The warrior then disappears back into the fray, likely off to face more of these creatures. </span></p><p class=\"c1\"><span class=\"c0\">Still in shock, I slowly push myself to my feet, my mind struggling to catch up with the chaos unfolding around me. As I steady myself, the scene comes into focus&mdash;a vast battlefield stretches out in every direction. </span></p><p class=\"c1\"><span class=\"c0\">Hideous creatures swarm the area, locked in violent clashes with hundreds of silver-cloaked warriors. Their weapons glint as they strike, a constant rhythm of metal against flesh, filling the air with the dreadful sounds of war.</span></p><p class=\"c1\"><span class=\"c0\">Heart pounding, I search for any place to hide, anywhere I might escape the horrors around me. But before I can move, one of those twisted monsters catches sight of me. </span></p><p class=\"c1\"><span class=\"c0\">I try to make a break for it, but my legs, still weak from the last fight, stumble over something solid. I hit the ground hard, glancing back to see what caused my fall&mdash;it&#39;s a warrior&#39;s lifeless body, the empty eyes staring into nothingness.</span></p><p class=\"c1\"><span class=\"c0\">With a shaky breath, I look up, expecting the creature to be upon me. But in an instant, it&rsquo;s cut down, collapsing to the ground beside me with a sickening thud. Another warrior stands over me, spear in hand, giving a swift nod before rushing back into the melee.</span></p><p class=\"c1\"><span class=\"c0\">I glance down at the corpse at my feet, a sense of urgency gnawing at me. I&rsquo;m sorry, whoever you are, but I need something to protect myself.</span></p><p class=\"c1\"><span class=\"c0\">Scanning the body, I look for a spear&mdash;something with reach to keep those creatures at bay. But there&rsquo;s nothing nearby. </span></p><p class=\"c1\"><span class=\"c5\">Damn&hellip; now what?</span><span class=\"c0\">&nbsp;</span></p><p class=\"c1\"><span>My gaze shifts down to the soldier&rsquo;s belt, where a pair of daggers hang, each blade gleaming faintly. Not ideal, but they&rsquo;ll have to </span><span>do</span><span class=\"c0\">.</span></p><p class=\"c1\"><span class=\"c0\">With a quick, nervous tug, I unhook the daggers, feeling the cold weight of the handles in my hands. For a moment, I catch the empty stare of the warrior&rsquo;s face, and a sick feeling rises in my throat. I swallow it down&mdash;there&rsquo;s no time for hesitation.</span></p><p class=\"c1\"><span class=\"c0\">Just as I turn to leave, a low, thunderous crunch echoes from behind me. The ground shudders beneath my feet, and I whip around to see trees splintering, crashing down as something massive forces its way through the forest.</span></p><p class=\"c1\"><span class=\"c0\">In front of me, there&rsquo;s another pitch black disturbing creature standing there maliciously. Instead of crawling like the previous monsters, this one stands on its hindlegs while its arms grow absurdly large, to the point that the fingers can nearly touch the ground with its hunchback.</span></p><p class=\"c1\"><span class=\"c0\">Unlike the others I encountered, this one has a massive third mouth that spans from its chest down to its abdomen, lined with razor-sharp teeth. Within this gruesome maw, I see small pieces of flesh and bone.</span></p><p class=\"c1\"><span class=\"c0\">As if it&rsquo;s not already macabre enough, on its other hand, the creature slowly lifts a rounded object and hurls it into the gaping stomach-mouth. My eyes widen in horror as I realise the object is a human head&hellip; the same person who saved me from the first monster.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">The monster suddenly charges right in front of me. How is it possible for a beast this big to run so quickly?</span></p><p class=\"c1\"><span class=\"c0\">Just when it&rsquo;s about to turn around and grab me with the other arm, I duck down and barely manage to evade it. I then use the momentum to slide down under its arm and slash the back of its thigh with one of my daggers.</span></p><p class=\"c1\"><span class=\"c0\">However, the dagger barely scratches it due to the monster&rsquo;s strange black hide. All of my instincts tell me that I can&rsquo;t win this and must get away, so with all of my strength, I try to run as fast as I can.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn tries to grab me again but I manage to roll out of the way. I keep running while constantly asking myself if it is still chasing me.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">It catches up to me and swings me away.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Urgh!&rdquo; I groaned.</span></p><p class=\"c1\"><span class=\"c0\">I struggle but still manage to get on my feet and run further into the forest. The sound of a tree wreck follows me but I&rsquo;m too afraid to even stop and look.</span></p><p class=\"c1\"><span class=\"c0\">Behind the tree. This tree. That tree. I don&rsquo;t know.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">It catches up to me again and with one hit, its gigantic arm sends me crashing into a tree. I started coughing out blood. My vision is fading.</span></p><p class=\"c1\"><span class=\"c0\">Due to the blood loss, my vision starts to get blurry and I see multiple images of the monster. I can&rsquo;t even tell which one is the real one, or if it even matters anymore.</span></p><p class=\"c1\"><span class=\"c0\">Seeing my struggle, it lets out a wicked sound as if it&rsquo;s laughing at my desperation. I try as hard as I can to keep running but in reality, I&rsquo;m just limping away. </span></p><p class=\"c1\"><span class=\"c0\">The creature slowly walks toward me as if it knows I can no longer escape from it. It swings its arm up and is ready to flatten me. I put up both of my arms in a desperate attempt to think that maybe I can miraculously block the attack.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">What is this? I&rsquo;m still alive.</span></p><p class=\"c1\"><span class=\"c0\">I look up and see myself holding a pair of black daggers, blocking the monster&rsquo;s arm. Suddenly, I can feel a surge of power in my arms so I strongly push the hellspawn away.</span></p><p class=\"c1\"><span class=\"c0\">For some odd reasons, more and more strength continues to flow within my body. Even the wound that I previously suffered seems to be slightly recovered.</span></p><p class=\"c1\"><span class=\"c0\">I feel a tingling sensation towards my right hand, and when I take a closer look, a mysterious star-shaped mark has appeared on the back of my hand.</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, it leaps at me again with a full intent of ripping me apart. I step aside and swing my daggers just like I did before in an attempt to cut its waist.</span></p><p class=\"c1\"><span class=\"c0\">The cut goes through and it lets out a painful cry. At that moment, I realised that these black daggers are definitely enhanced.</span></p><p class=\"c1\"><span class=\"c0\">The normal me from previous life would have pissed his pants but I don&rsquo;t know why I don&rsquo;t feel afraid to stand up against this monster right now.</span></p><p class=\"c1\"><span class=\"c0\">Call it bravery, or recklessness. I don&rsquo;t know. It might even be the adrenaline that&rsquo;s driving me.</span></p><p class=\"c1\"><span class=\"c0\">The monster doesn&rsquo;t let me continue my thought process and tries to smash me in a frenzy. I dodge its attacks with precision and throw in a few cuts whenever I can. </span></p><p class=\"c1\"><span class=\"c0\">I feel that I&rsquo;m slowly turning this around.</span></p><p class=\"c1\"><span class=\"c0\">It becomes more enraged as its body expands outward. Then, the large mouth in front of its body opens up with all of the pieces of corpses falling off. </span></p><p class=\"c1\"><span class=\"c0\">The sight of these dead bodies and that familiar head brings the nightmare back to me. My whole body feels like throwing up but again, I must hold on.</span></p><p class=\"c1\"><span class=\"c0\">Wait, there is something else.</span></p><p class=\"c1\"><span class=\"c0\">I see a faint light inside the mouth, and as it becomes more vivid, that&rsquo;s when I realise.</span></p><p class=\"c1\"><span class=\"c0\">Fire!</span></p><p class=\"c1\"><span class=\"c0\">The monster breathes out fire through its third mouth like a flamethrower, burning all of the trees in its path.</span></p><p class=\"c1\"><span class=\"c0\">Thanks to the enhanced sense and vision that I just got, I once barely manage to get away in time. The fire keeps going on for a while until it starts to get weaker. I think the monster cannot breath out the fire infinitely and will need to either take a break or replenish the fuel.</span></p><p class=\"c1\"><span class=\"c0\">As I have predicted, the fire stops. I feel that it is trying to recharge, so I immediately run up to it in an attempt to cut it down.</span></p>"
}]