[{
    "id":2,
    "title":"Fateful Encounter",
    "html":"<p class=\"c3\"><span class=\"c0\">I’m losing track of the distance covered since leaving Woodplain, and to make matters worse, I have no clue which direction I've been heading all this time. All I know is that I’ve been moving forward, crossing through numerous forests and mountains.</span></p><p class=\"c3\"><span class=\"c0\">Along the way, hellspawns— those menacing creatures, oftenly show up. Sometimes I avoided them, sometimes I faced them head-on and defeated them.</span></p><p class=\"c3\"><span class=\"c0\">I made sure those battles weren’t for nothing. After taking down the hellspawns, I diligently collected their essence. At the beginning, I was puzzled by the daggers that would suddenly appear when danger lurked. To figure out how to control this power, I spent hours trying to recreate that feeling.</span></p><p class=\"c3\"><span class=\"c0\">Sadly, my efforts proved futile. However, I did not give up. Countless hours were spent, both day and night, in pursuit of unlocking the latent power within me. Gradually, I began to sense its presence, a sign that I might be onto something.</span></p><p class=\"c2\"><span class=\"c0\">Through unwavering focus, I slowly grasped that the essence I collected wasn't something I could touch but rather, it was a part of me. As my understanding deepened, I learned to shape this mysterious source, bending it to my will.</span></p><p class=\"c2\"><span class=\"c0\">Nevertheless, this newfound ability came with its share of challenges. Every attempt to turn the essence into something else failed. I had a hunch— maybe my intentions needed to align with something more specific? Not just any intentions, but ones focused on protecting others or fighting the hellspawns?</span></p><p class=\"c2\"><span class=\"c0\">That was why I couldn’t just conjure random objects like shovels or fishing rods. I knew for the fact that when facing a hellspawn, I could always summon the same pair of daggers.</span></p><p class=\"c2\"><span class=\"c0\">These daggers were indestructible. I subjected them to relentless battering against rocks and even let hellspawns devour them, but they always emerged unscathed. Furthermore, should I cast them aside, they’d reappear back in my hands whenever I wanted.</span></p><p class=\"c2\"><span class=\"c0\">This newfound power made me feel overwhelmingly strong. I believed with enough time, practice and learning, I could reach incredible heights and become a beacon of hope for mankind.</span></p><p class=\"c2\"><span class=\"c0\">Once, in a nerve-wracking encounter, I faced a hellspawn armed with deadly spikes, rendering my daggers useless up close. Forced to retreat, I ran for days, with the relentless fiend hot on my heels.</span></p><p class=\"c2\"><span class=\"c0\">During brief breaks, a realisation hit me. What about a different weapon? In the past, I had indulged in swordsmanship as a hobby. How could I overlook an obvious choice— a sword?</span></p><p class=\"c2\"><span class=\"c0\">Crafting it, however, was no easy feat. Due to the pursuing hellspawn, I struggled to concentrate on forming my desired weapon. Early attempts failed until I realised that I needed to start small, shaping the weapon from the base up.</span></p><p class=\"c2\"><span class=\"c0\">With painstaking effort, I guided my power, weaving into the substance of my creation until at last, a sword took shape. Yet, when pitted against the hellspawn, my hope was crushed. The sword’s edge was blunt, forcing me to resort to crude bludgeoning. I went pummeling the hellspawn until it stopped moving.</span></p><p class=\"c2\"><span class=\"c0\">In search of a proper solution, I retraced my steps, trying to figure out why the daggers worked while the sword failed. Then, it hit me— maybe I just didn’t understand my weapon of choice enough?</span></p><p class=\"c2\"><span>The first dagger was created when I needed a killing tool to get out of that hellspawn’s </span><span>grasp</span><span class=\"c0\">&nbsp;when it was pinning me down. The second dagger was most likely created because I needed more power to face that fire-breathing bastard, and dagger was the only thing I was familiar with at that time.</span></p><p class=\"c2\"><span class=\"c0\">I felt that if I wanted to craft a sword, I must understand the fundamentals of the weapon’s usage. As a result, I tried to recall all the memories that I had about my swordsmanship, while slowly, with every hellspawn defeated, I channelled the essence into the once-failed sword. </span></p><p class=\"c2\"><span class=\"c0\">Layer after layer, the energy grew denser, not into a broader form, but a sharper and narrower edge. Through relentless repetition, defining my technique over time, I’ve achieved it.</span></p><p class=\"c3\"><span class=\"c0\">!!!</span></p><p class=\"c3\"><span class=\"c0\">Before me stands a sinister blade, coated in an obsidian hue. The weapon boasts a subtle curve— a single-edged design. Its elongated grip graciously accommodated both of my hands.</span></p><p class=\"c3\"><span class=\"c0\">I deliberately omitted a hand guard from the design, having found it a hindrance when switching hands or inverting the sword. However, this choice requires heightened vigilance, for a slight slip in grip could lead to unintended contact with the razor-sharp edge.</span></p><p class=\"c3\"><span class=\"c0\">Confident in its indestructibility, I crafted the blade with a sleekness that strikes a balance between slimness and the requisite level of sharpness. The outcome allows me to wield the weapon with swiftness, effortlessly cleaving through the hellspawns.</span></p><p class=\"c3\"><span class=\"c0\">With each swing, a sense of familiarity grew, as if this blade had been an integral part of me since time immemorial.</span></p><p class=\"c3\"><span class=\"c0\">!!!</span></p><p class=\"c3\"><span class=\"c0\">It’s the familiar smell again that I would never forget— the smell of blood.</span></p><p class=\"c3\"><span class=\"c0\">I stumble upon the gruesome aftermath of the village massacre, the air heavy with the scent of death. My instincts kick in, and I hasten toward the source of tragedy.</span></p><p class=\"c3\"><span class=\"c0\">As I approach, I catch sight of two young men locked in a desperate struggle against a monstrous, stone-like creature. Before I can fully analyse the situation, I think it’s best to sneak behind them and observe first.</span></p><p class=\"c3\"><span class=\"c0\">One of them, an agile and focused figure, conjures ethereal spears with swift, precise movements of his hands. One spear after another flies towards the target, as if these deadly weapons dance to his command. The spears strike the monster, chipping away at its stony exterior, but it shows no signs of yielding.</span></p><p class=\"c3\"><span class=\"c0\">Beside him, another young man seems to be able to create a shimmering portal in the air. He skillfully directs the spears through the portal, making them reappear at unpredictable angles, attempting to catch the hellspawn off guard. The portal definitely defies the laws of physics for a tactical advantage, however, the monster remains resilient to their attacks.</span></p><p class=\"c3\"><span class=\"c0\">One of them then signals to the other with the portal, as if they’re about to try something different. As the hellspawn lunges forward at the man who can conjure weapons, he times his actions with precision, dodging it at the last second, and luring it towards the portal created behind him.</span></p><p class=\"c3\"><span class=\"c0\">The hellspawn, transported to a different ground, is momentarily disoriented. Seizing the opportunity, the adept young man conjures a barrage of spears and tries to aim them at the creature’s vulnerable spots from multiple angles. </span></p><p class=\"c3\"><span class=\"c0\">He carefully observes where the hellspawn reacts. The one part that the hellspawn focuses his defence more, he knows that is the weak spot. He immediately follows up with a decisive blow, causing the monster to crumble.</span></p><p class=\"c3\"><span class=\"c0\">With the immediate threat neutralised, they catch their breaths amidst the eerie silence that follows. As they seem to be cleaning up the aftermath, a nagging suspicion grows within me.</span></p><p class=\"c3\"><span class=\"c0\">The corpses surrounding the area bear the marks of slashing attacks, yet the stone-like hellspawn they have just defeated specialised in crushing blows. Something doesn’t add up. I continue to scan the surroundings just in case of another unexpected enemy.</span></p><p class=\"c3\"><span class=\"c0\">While the two young men are still engrossed in their conversation, I notice subtle disturbance in the empty space behind one of them. It’s as if the air is warped, then a chilling realisation strikes me— there’s another hellspawn nearby, camouflaged and waiting for a chance!</span></p><p class=\"c3\"><span class=\"c0\">“Watch out!” I yelled.</span></p><p class=\"c3\"><span class=\"c0\">Without a moment’s hesitation, I take action. I swiftly summon a dagger and hurl it toward the concealed threat. The dagger lands, revealing a second monster with sickles for arms as it materialises.</span></p><p class=\"c3\"><span class=\"c0\">Startled, the two young men react quickly, leaping away to create distance from a new formidable enemy.</span></p><p class=\"c3\"><span class=\"c0\">Locking eyes, a silent understanding passes between me and the two young men. Although surprised and confused, it’s a shared acknowledgement that we need to join forces to confront this hellspawn ahead.</span></p><p class=\"c3\"><span class=\"c0\">!!!</span></p><p class=\"c3\"><span class=\"c0\">When we assume that the situation can’t get worse, a crumbling sound crackles up on the other side of us. It then reveals that the stone-like hellspawn has also resurrected itself and is now pincering us with the sickle-arms hellspawn.</span></p><p class=\"c3\"><span class=\"c0\">It appears that the stones themselves are its body and are joined by a strange magnetic force. To defeat it, we would need to either destroy the stones, or find the energy source behind this power.</span></p><p class=\"c3\"><span class=\"c0\">“What now?” the young man with portal ability asked. From now on, I’ll refer to him as the portal guy for simplicity, while the other guy will be referred to as the spear guy.</span></p><p class=\"c3\"><span class=\"c0\">The spear guy glances at me, and then back to him and replies. “Let’s [][][][] up for now.”</span></p><p class=\"c3\"><span class=\"c0\">Despite the fact that I haven’t spoken Valorish for a few months, I’m glad that I’m still able to understand a few words they said. It seems like they want to… team up, I suppose?</span></p><p class=\"c3\"><span class=\"c0\">I look at them, and they respond with the same idea by nodding their heads. The air is filled with tension as the three of us prepare for the impending clash.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawns, having fully played their cards, now advance towards us with lethal intent. The spear guy readies up a floating spear, while the portal guy positions himself away from the trap point.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawns attack simultaneously. Thanks to my experience over the past few months, I manage to avoid the onslaught, and it seems that the others have also gotten themselves on a better ground too.</span></p><p class=\"c1\"><span class=\"c0\">Weapons clash and portals shift hold against the relentless attacks from the hellspawns. </span></p><p class=\"c1\"><span class=\"c0\">As the battle rages on, our synchronisation improves. I, guided by instinct, exploit weaknesses in the monsters’ movements. The young men, in turn, adapt their abilities to complement my combat style. </span></p><p class=\"c1\"><span class=\"c0\">It becomes a dance of survival, a symphony of skill and bravery woven together against the dual threat. In the face of adversity, our unspoken agreement to unite against the common enemies proves to be our greatest strength. </span></p><p class=\"c1\"><span class=\"c0\">The hellspawns, now on the defensive, struggle to contend with the seamless collaboration of our newfound alliance.</span></p><p class=\"c1\"><span class=\"c0\">The air crackles with tension as I’m holding my ground against the hellspawn with sickle-like arms. Its sharp edges glint in the dappled sunlight, obstructing my eyesight to fight effectively.</span></p><p class=\"c1\"><span class=\"c0\">The portal guy, recognising the imminent threat, creates random portals around the hellspawn to temporarily neutralise its offences.</span></p><p class=\"c1\"><span class=\"c0\">Seizing the opportunity, I lunge at the sickle-arms monster. The battle is fierce. The monster’s agile strikes continuously meet with my dodges and swift counterattacks. I don’t have a moment of my time to notice much of my surroundings but I assume the other man with the spears-summoning ability is holding his ground against the stone-like hellspawn.</span></p><p class=\"c1\"><span class=\"c0\">Then, out of the blue, an ethereal spear appears next to my opponent, aiming for its neck. However, the hellspawn is able to immediately respond and move its vital point away. The surprise attack distracts it and allows me to follow up with an uppercut on its right arm and takes away half of its offensive power.</span></p><p class=\"c1\"><span class=\"c0\">I try to jump to the other side to follow up with another attack on its other arm, but as soon as I step to the side, I find myself behind the stone-like hellspawn.</span></p><p class=\"c1\"><span class=\"c0\">Despite the confusion, I instantly identify the gap between the rocks on the hellspawn’s back and resume my attack on this target instead. The hellspawn screams in pain and swings a giant arm around, but luckily, the spear guy drags me out of the danger.</span></p><p class=\"c1\"><span class=\"c0\">We three position ourselves again. I glance at the portal guy, and he gives me a simple thumb-up. Without a word spoken, I can half-guess that this guy is the strategist and support, while the other guy and I are the frontliners.</span></p><p class=\"c1\"><span class=\"c0\">There’s still a bit of doubt behind me, but at this moment, I have no choice but to put faith in them and follow their coordination.</span></p><p class=\"c1\"><span class=\"c0\">As the fight unfolds, I continue my usual combat to exploit openings in the hellspawns’ defences while the spear guy orchestrates a seamless barrage of attacks. Every now and then, we would be teleported to the other opponents, or random attacks would appear and completely throw the hellspawns off.</span></p><p class=\"c1\"><span class=\"c0\">Just like that, the sickle-arms hellspawn, unable to withstand the combined assault and lack of the armour that the stone-like hellspawn has, falters and succumbs to our relentless strikes.</span></p><p class=\"c1\"><span class=\"c0\">With the first monster defeated, we turn our attention to the formidable stone-like creature. Its armoured exterior seems impenetrable, and we’re aware that it can resurrect itself with a strange magnetic energy.</span></p><p class=\"c1\"><span>However, I </span><span>notice</span><span class=\"c0\">&nbsp;a subtle difference between the first time it was defeated and the strike from me. Initially, when it fell, the magnetic energy brought all the stones back together, and it returned unharmed. Yet, after my second attack, I can see that the same part remains exposed without a stone covering.</span></p><p class=\"c1\"><span class=\"c0\">I turn to the other two guys, gesturing towards that vulnerable spot. They struggle to comprehend, so I point at my dagger, then back at the portal guy. Using a few attack motions, I try to convey my intention, hoping they’ll understand.</span></p><p class=\"c1\"><span class=\"c0\">“I think he [][][][][] that he can cut through the hellspawn with his dagger.” The portal guy said to the spear guy.</span></p><p class=\"c1\"><span class=\"c0\">They both nod at me, signalling that I can take the lead. I charge forward, baiting out the hellspawn big swing with a quick duck-and-slide. The spear guy follows suit, conjuring a few spears that home in on the hellspawn. Although not inflicting real damage, they are still able to push back the hellspawn a bit to allow more room for me to move around.</span></p><p class=\"c1\"><span class=\"c0\">The portal guy helps to teleport me to the blind spot of the hellspawn time after time, allowing me to unleash clean hits one after another. Together, the three of us adapt and adjust our movement to each other’s advantage on the fly. Slowly but surely, the combined efforts begin to chip away the stone-like armour.</span></p><p class=\"c1\"><span class=\"c0\">Every time when the hellspawn tries to gather the surrounding stones, the portal guy keeps on creating portals to redirect the stones somewhere else. Unable to recover from both my attack and the distraction of the other two, it finally leaves a big opening to us.</span></p><p class=\"c1\"><span class=\"c0\">I step forward and deliver a decisive blow, striking at what I believe to be the core of the hellspawn where the strange magnetic energy resides.</span></p><p class=\"c1\"><span class=\"c0\">With a thunderous roar, the stone-like hellspawn crumbles. The battlefield falls silent. The dust settles as we stand victorious. Our teamwork has triumphed over the hellspawns, forging an unspoken bond through the crucible of battle.</span></p><p class=\"c1\"><span class=\"c0\">As the adrenaline subsides, a sense of camaraderie fills the air. I exchange nods of gratitude with these two young men, acknowledging the strength we found in unity.</span></p><p class=\"c1\"><span class=\"c0\">Now with a closer look, the features of these two guys come into sharper focus. The spear guy has short, slightly curly chestnut brown hair. He’s decked out in leather gear, with a few armour pieces on his torso for protection. His piercing green eyes convey a sense of determination.</span></p><p class=\"c1\"><span class=\"c0\">On the other hand, the portal guy sports slightly longer navy blue hair and wears glasses. His attire is lighter than the spear guy, missing some armour pieces, suggesting a supportive role where heavy protection isn’t crucial. Behind those glasses are hazelnut brown eyes, reflecting a keen intelligence.</span></p><p class=\"c1\"><span class=\"c0\">The portal guy approaches me, gratitude evident in his eyes.</span></p><p class=\"c1\"><span class=\"c0\">“Thank you.” he said.</span></p><p class=\"c1\"><span class=\"c0\">“You - are - welcome.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">After a period of time of not speaking to anyone, my Valorish definitely sounds rough. However, what comes after is a very confused expression in exchange between the two young men.</span></p><p class=\"c1\"><span class=\"c0\">“My - Valorish - is not - good.” I continued.</span></p><p class=\"c1\"><span class=\"c0\">“Are you not from here?” the spear guy came up and asked.</span></p><p class=\"c1\"><span class=\"c0\">I’m not entirely sure what the “here” in this question refers to so I respond with a confused expression. Even though I’ve been in this world for quite some times, the fact that I still fail to fully comprehend their words makes me feel isolated.</span></p><p class=\"c1\"><span class=\"c0\">It’s as if my frustration is apparent, the portal guy simply puts his hand on my shoulder to assure me that everything is fine. The other guy then steps closer, and with a strange movement of his hand, he then utters a few words from his mouth.</span></p><p class=\"c1\"><span class=\"c0\">“Can you understand me now?”</span></p><p class=\"c1\"><span class=\"c0\">“What? How… How did I just…” I responded in shock, because for some reason, I can clearly understand every single word that he just said.</span></p><p class=\"c1\"><span class=\"c0\">What’s more confusing to me is that I cannot recall the exact words, but at that moment, I am able to understand. It’s as if the words are directed straight into my brain.</span></p><p class=\"c1\"><span class=\"c0\">When I look back at them, they both seem to be familiar with something like this as if this isn’t their first time in this situation.</span></p><p class=\"c1\"><span class=\"c0\">“What did you do? How can I understand you guys? And… how am I able to talk… to you right now?” I asked. “I’m sure that right now I’m just conveying my thoughts into words in my own consciousness but for some strange reasons, they are coming out as Valorish?”</span></p><p class=\"c1\"><span class=\"c0\">“We will explain to you later. For now, I’m glad that we can finally have a conversation.” the portal guy replied. “My name is Xenon, and this guy here is Cyrus. It’s one of his abilities that allows us to freely speak to each other right now.”</span></p><p class=\"c1\"><span class=\"c0\">“I see. My name is Vincas. Thank you for your earlier help.”</span></p><p class=\"c1\"><span class=\"c0\">“No. It was us who were supposed to thank you. If it wasn’t for you calling out for the sneak attack back there, I think one of us would be in the afterlife already.” Cyrus said.</span></p><p class=\"c1\"><span class=\"c0\">“Anyway, let’s head back to the walls first and then we can continue our discussion.” Xenon suggested.</span></p><p class=\"c1\"><span class=\"c0\">“The walls?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“You don’t know the walls?” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“It’s alright. I think he’s new around here. We can explain everything later.” Xenon insisted.</span></p><p class=\"c1\"><span class=\"c0\">“Before that, let’s give these guys a proper burial first.” I said.</span></p><p class=\"c1\"><span class=\"c0\">“I know it’s out of respect, but I don’t think we have the stamina to do that with the amount of bodies here. Once we get back to the walls and give a report, they will send some men to handle the stuff here.” Xenon replied.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus also agrees and nods at me, implying that I should just follow them for now and just like that, I’m on my way to the “walls”.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[After a while]</span></p><p class=\"c1\"><span class=\"c0\">As we journey towards our destination, the landscape transforms, and a sense of anticipation hangs in the air. The horizon slowly unveils the grandeur of the protective bastion - the giant white walls.</span></p><p class=\"c1\"><span class=\"c0\">From a distance, the towering walls appear as an imposing fortress, stretching high into the sky, their pristine surface gleaming in the sunlight. I can’t help but marvel at the sheer scale of the structure, a testament to the might and determination of the kingdom that lay beyond.</span></p><p class=\"c1\"><span class=\"c0\">“This is… the walls?” I asked in shock.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. That’s what many people like to call it. Have you ever been to the capital city before?” Xenon replied.</span></p><p class=\"c1\"><span class=\"c0\">“Wait. This is the capital city of Valoria?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes?”</span></p><p class=\"c1\"><span class=\"c0\">“Wow… No. I’ve never been to the capital city before. I heard it’s called… Dawnguard?”</span></p><p class=\"c1\"><span class=\"c0\">“You’re correct. The capital city is named Dawnguard. I’m surprised that you’ve never been to Dawnguard before. It’s one of the very few strongholds against hellspawns in the world and is the heart of Valoria so almost everyone is seeking to find a place here.”</span></p><p class=\"c1\"><span class=\"c0\">“I’m aware of that. It’s just that I’ve just been living in the countryside so I don’t know many details about it.”</span></p><p class=\"c1\"><span class=\"c0\">“I see. It’s uncommon to see people still striving outside of the walls but it’s not impossible. You must have grown up really far from here.”</span></p><p class=\"c1\"><span class=\"c0\">“Something like that.”</span></p><p class=\"c1\"><span class=\"c0\">“Interested in knowing the city?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes. If you don’t mind?”</span></p><p class=\"c1\"><span class=\"c0\">“Of course not. Dawnguard was built on a very simple concept— to defend against the hellspawns and provide a safe haven for its citizens. The city itself is made up of four circular districts. You have the core district at the innermost, then each district acts as a barrier, expanding out from the core.</span></p><p class=\"c1\"><span class=\"c0\">In front of us is what we officially call Luminara, positioned at the outermost layer. It gets its name from the radiant glow of the rising sun. This district is known for its residential areas, marketplaces, and the warmth of its citizens.</span></p><p class=\"c1\"><span class=\"c0\">Nestled within the second layer is the Astrum. It pays homage to the celestials that we worship. It might house administrative buildings, cultural institutions and areas dedicated to scholarly pursuits.</span></p><p class=\"c1\"><span class=\"c0\">Elysium, positioned deeper within Dawnguard, invokes a sense of paradise and tranquillity. This district is home to parks, gardens and luxurious estates, creating an oasis within the bustling city.</span></p><p class=\"c1\"><span class=\"c0\">Occupying the central core of Dawnguard, Citadel is the heart of the city and the last line of defence. This district houses the royal palace, military barracks and crucial government structures.”</span></p><p class=\"c1\"><span class=\"c0\">“That’s… amazing.”</span></p><p class=\"c1\"><span class=\"c0\">“I know, right. I was just as shocked as you were when I first learned about Dawnguard.” Cyrus commented.</span></p><p class=\"c1\"><span class=\"c0\">“Based on the names and the mention of celestials, it seems like Dawnguard is a religious city?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">Both Xenon and Cyrus look at me in awe, as if I just asked something extremely weird.</span></p><p class=\"c1\"><span class=\"c0\">“Looks like we are going to have a long history lesson later, my friend.” Xenon responded.</span></p><p class=\"c1\"><span class=\"c0\">“Hah…” I awkwardly smiled.</span></p><p class=\"c1\"><span class=\"c0\">As we draw nearer, the details of the walls come into sharper focus. The smooth, ivory facade rises with an almost ethereal quality, creating an aura of invincibility. The sunlight plays upon the walls, casting intricate shadows that dance along the surface, highlighting the craftsmanship and architectural prowess that went into this construction.</span></p><p class=\"c1\"><span class=\"c0\">The enormity of the walls become more apparent with each step, and I find myself dwarfed by their sheer size. The structure stands as a guardian, a sentinel watching over the realm with a stoic and timeless presence. The walls, seemingly endless, encircled the capital city, providing a sense of security that resonates with the magnitude of the responsibilities it holds.</span></p><p class=\"c1\"><span class=\"c0\">As we approach the gate, I can’t help but feel a mixture of awe and respect. The gate, adorned with intricate carvings and symbols, hinted at the rich history and culture within. Cyrus and Xenon each show the guards a piece of metal, and exchange a few words with them— most likely about me. The guards let us through. I pass through the colossal entrance, and the scale of the city unfolds before my eyes.</span></p><p class=\"c1\"><span class=\"c0\">The bustling streets, vibrant markets, and towering structures within the walls paint a vivid picture of life in the capital city. The contrast between the protective exterior and the lively interior speak of a kingdom that has learned to thrive while safeguarding its residents.</span></p><p class=\"c1\"><span class=\"c0\">For me, the sight of the giant white walls mark not only a physical boundary but also a symbol threshold. It is almost like my first true entry into a world unknown, filled with journeys and destinies ahead.</span></p><p class=\"c1\"><span class=\"c0\">“First up, we will go back to our inn and get ourselves cleaned up. Then we’ll head out for a drink and I will tell you everything that you need to know about Dawnguard. How does that sound?” Xenon suggested.</span></p><p class=\"c1\"><span class=\"c0\">“Sure.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">We continue our walk on the bustling town, a place larger and livelier than I have ever seen. The streets teem with activity, merchants peddle their wares, children play in the squares, and the air hums with the harmonious sounds of a thriving community. It was a stark contrast to the desolation world out there.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and Xenon, familiar with the town, arrange accommodations for the three of us. After a much-needed rest, during which we clean up the aftermath of the battle and change into fresh clothes, we reconvene in the lounge of our lodgings.</span></p><p class=\"c1\"><span class=\"c0\">As we explore, we stumble upon a local bar, where the lively atmosphere beckons us inside. Seated around a table, along with the fresh new clothes, it feels as if I’m fully blended in with the locals here.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus hands each of us a cup, and it looks like the content inside is alcoholic. I hesitate a bit; it's been a while since my last drink, and I'm not sure how quickly it might affect me.</span></p><p class=\"c1\"><span class=\"c0\">“Just one.” Cyrus said as if he understood.</span></p><p class=\"c1\"><span class=\"c0\">“Alright.” I grabbed the drink.</span></p><p class=\"c1\"><span class=\"c0\">“So… where do you want to start?” Xenon asked.</span></p><p class=\"c1\"><span class=\"c0\">“Everything. About Dawnguard. About Valoria. About you guys. Explain to me as if I’m a toddler.”</span></p><p class=\"c1\"><span class=\"c0\">“Alright… so…”</span></p><p class=\"c1\"><span class=\"c0\">“Hey. Before that, there’s something else I’d like to ask first.” Cyrus interrupted.</span></p><p class=\"c1\"><span class=\"c0\">Xenon and Cyrus nod at each other, as if they have already planned ahead on this upcoming question for me. Cyrus then takes a slightly deeper breath, waits for the right moment, and utters out the words.</span></p><p class=\"c1\"><span class=\"c0\">“Are you from another world?”</span></p><p class=\"c1\"><span class=\"c0\">“...”</span></p><p class=\"c1\"><span class=\"c0\">“As in… a completely different world.” Cyrus continued, assuming that I was confused.</span></p><p class=\"c1\"><span class=\"c0\">However, I was shocked rather than confused. Since I’ve arrived here, this is the first time that someone questions my true identity. I’ve always thought that my behaviour would seem out of place at times but nobody seems to take note of it.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I’m not from this world.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and Xenon are immediately greeted with a surprise with their eyes wide open. They then look at each other, and crack up a smile.</span></p><p class=\"c1\"><span class=\"c0\">“Us to.” Cyrus responded.</span></p><p class=\"c1\"><span class=\"c0\">“No way. Are you saying that you both…?”</span></p><p class=\"c1\"><span class=\"c0\">“Xenon was teleported to this world. I was reincarnated here. Both of us arrived here after our deaths in the old world.”</span></p><p class=\"c1\"><span class=\"c0\">“In my case, I was the same as Xenon with a slight difference. I wasn’t dead. I only went to sleep, and when I woke up, I found myself in this world.”</span></p><p class=\"c1\"><span class=\"c0\">“Interesting. It’s been a very long time since we’ve met someone from another world.”</span></p><p class=\"c1\"><span class=\"c0\">“Wait. One more thing. When you said you were also from another world, I assume you came from Earth?” Xenon asked.</span></p><p class=\"c1\"><span class=\"c0\">“Dude, where else would he come from?” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“Valhalla is a proof of another world. There might be many more that we aren’t aware of.”</span></p><p class=\"c1\"><span class=\"c0\">“Well, that’s true. So Vincas, are you from Earth?”</span></p><p class=\"c1\"><span class=\"c0\">Curiosity gleams in Cyrus and Xenon’s eyes as they question my origin, wondering if I hail from the same world as them.</span></p><p class=\"c1\"><span class=\"c0\">“I believe so.”</span></p><p class=\"c1\"><span class=\"c0\">Their surprise was evident, because it was such a weird answer to a simple question, but they quickly composed themselves.</span></p><p class=\"c1\"><span class=\"c0\">“What do you mean? Are you not from Earth?” Xenon asked in a serious tone.</span></p><p class=\"c1\"><span class=\"c0\">“It’s not like that. Usually, I would be able to answer that question with ease. However, since I’ve arrived here, the longer time I’ve spent, the more of my memory starts to fade away. And now, I can only vaguely remember a few details in my old world.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">They both look at me in silence, either trying to comprehend my response or to find an explanation behind this phenomenon.</span></p><p class=\"c1\"><span class=\"c0\">“When you mentioned Earth, I recalled that I’ve heard of the name before. It definitely felt very familiar, as if I was from there. However, as hard as I tried, I just could not bring out a vivid image or a piece of memory to ascertain the fact that I once lived there.” I tried to provide a proper description of my trouble.</span></p><p class=\"c1\"><span class=\"c0\">“Perhaps hearing a few more words from there would help to open up your memory? For example, I came from America, and Xenon came from China. Does it help?” Cyrus responded.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I’m aware of those names. In fact, now that you mentioned them, an image of a circular planet is becoming clearer in my head. It looks like…” I replied while searching for a set of writing tools.</span></p><p class=\"c1\"><span class=\"c0\">“Here.” Xenon took out a notebook and a pen from his pouch.</span></p><p class=\"c1\"><span class=\"c0\">I then draw the shape and outlines of the lands on the planet as close to the image that I have in my head as possible. I’m not someone who’s confident in his drawing skill so they may not…</span></p><p class=\"c1\"><span class=\"c0\">“That’s it. It’s Earth. We’re all from the same world.” Cyrus said.</span></p><p class=\"c1\"><span class=\"c0\">I look up, noticing Xenon’s approval expression on Cyrus’s statement.</span></p><p class=\"c1\"><span class=\"c0\">“Do you remember the general shape of your country?” Cyrus continued.</span></p><p class=\"c1\"><span class=\"c0\">“It’s… an island— a very large island, all the way out in the ocean. I remember it’s well known for having unique creatures there and…”</span></p><p class=\"c1\"><span class=\"c0\">“I think you’re from Australia.” Cyrus helped me to wrap up my doubts. “Isn’t it, Xenon? I don’t think anywhere else would fit that description better than Australia?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes, I think so too.” Xenon agreed.</span></p><p class=\"c1\"><span class=\"c0\">“How did you guys fare at the beginning when you got here?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“I had it easy because I was reincarnated as a child under a noble house. I have to admit that a lot of things were spoonfed to me so I don’t think I have much to share.” Cyrus answered.</span></p><p class=\"c1\"><span class=\"c0\">“I had it slightly rougher. When I woke up, the first thing I saw was a dark room, a fallen stool and pieces of clothes tied up, on the floor. I assumed that the previous owner of this body attempted to suicide. I wasn’t sure whether he fell down while doing that, knocked himself unconscious or if he actually succeeded. Regardless, the truth still remains that I took over his body.” Xenon went next.</span></p><p class=\"c1\"><span class=\"c0\">“Were you able to find out the reason why the previous owner of your body made such a choice?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“He— now I, came from a fallen noble family. We used to be at the top but after a few incidents, the entire house had fallen to the bottom tier. The only hope was on me, and I previously didn’t deliver. The pressure pushed the previous me to suicidal.” Xenon answered as if it was a very normal thing to speak out.</span></p><p class=\"c1\"><span class=\"c0\">Well, I guess it’s because that wasn’t his choice, and he didn’t truly have that experience so it was just him telling a story of someone else’s life.</span></p><p class=\"c1\"><span class=\"c0\">“I woke up in a cave and through a fateful encounter, I was accepted into a village. I learned many things from the villagers there, such as language, hellspawns origin and survival skills. One day when I went out hunting, a fire-breathing hellspawn attacked the village and when I returned, the entire village was wiped out. I faced the hellspawn, went through probably the toughest fight in my life, and managed to barely defeat it. I left the village to seek a better asylum, and met you guys.”</span></p><p class=\"c1\"><span class=\"c0\">As I recount the tragic fate that befell the village, my heart grows solemn. The weight of the memory hangs in the air, casting a momentary shadow over the conversation. Cyrus and Xenon were listening intently, expressions shifting from curiosity to empathy.</span></p><p class=\"c1\"><span class=\"c0\">“Anyway, earlier, you two showed the guards at the gate something like a medallion. What are they?”</span></p><p class=\"c1\"><span class=\"c0\">“Oh… this?” Cyrus took out his medallion.</span></p><p class=\"c1\"><span class=\"c0\">Now that I take a closer look, the finely crafted bronze medallion is suspended from a sturdy chain. This medallion bears the symbol of a majestic deer, fashioned in the shape of a perfect circle, giving it a sense of symmetry and balance.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. What is it?”</span></p><p class=\"c1\"><span class=\"c0\">“You can think of this as the identity card— a privileged one, in fact.” Cyrus answered.</span></p><p class=\"c1\"><span class=\"c0\">“You’re already well aware of the situation outside the walls. For the people to survive, they need something to fight back the hellspawns. The answer is the sentinels.” Xenon added.</span></p><p class=\"c1\"><span class=\"c0\">“Sentinels?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I have to bring you a bit further back to the relationship between hellspawns and us. Do you know the origin of hellspawns? ” Xenon asked.</span></p><p class=\"c1\"><span class=\"c0\">“I’ve heard a bit about it. One day, floating stone pillars suddenly appeared and the ground beneath these pillars sank so deep that the hellish creatures crawled out from there. These creatures are called hellspawns.”</span></p><p class=\"c1\"><span class=\"c0\">“Yup, you got it right. At the beginning, we were able to fend them off with normal weapons. However, bigger and stronger hellspawns started showing up and completely rendered those weapons useless. These merciless monsters were unstoppable and wiped out nearly half of the population. Do you know how we managed to survive that disaster?”</span></p><p class=\"c1\"><span class=\"c0\">“Hm… I assume it’s related to the special power that all three of us have?”</span></p><p class=\"c1\"><span class=\"c0\">“That’s right— the blessings. Legend says that at the time, eight celestial beings descended to the mortal realm and bestowed their power to eight individuals. Those eight heroes stood up against the strongest of the hellspawns and became the pillars of mortals. The blessings simply did not end there because one after another, several people started to receive power that allowed them to fight alongside the eight heroes. Although the chance of receiving a blessing was extremely rare, the alliance that time was strong enough to drive the hellspawns back to almost where they first appeared.</span></p><p class=\"c1\"><span class=\"c0\">The entire world used whatever of the remaining resources to build up several bastions, strong enough to protect the others who didn’t receive a blessing. The original eight, who are still considered the strongest that have ever been blessed, were chosen to lead the mortals. They became the rulers— the title given to them that exceeded the monarchy at that time.</span></p><p class=\"c1\"><span class=\"c0\">Now, back to the present time, every now and then, an individual might receive a blessing. Due to that history, these individuals will be highly wanted and more often than not, scouted to become the sentinels. Nowadays, you can think of a sentinel as a trained soldier, dedicated to protect the realm from hellspawns and maintain peace across the world.”</span></p><p class=\"c1\"><span class=\"c0\">“In other words, the sentinels are what you call a knight in mediaeval time, and a police in modern time. Their purpose is to protect and serve the people.” Cyrus helped Xenon to conclude the lecture.</span></p><p class=\"c1\"><span class=\"c0\">“Tsh. Really? Knight and police? That’s such a bad example to compare.” Xenon chuffed. “Anyway, was that able to help you fully paint the picture of the current system?” He then turned towards me.</span></p><p class=\"c1\"><span class=\"c0\">“That’s a lot to take in so I might need some time to process.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">Honestly, I have to admit that Xenon did an amazing job summarising the entire history in just a few paragraphs. Although there are still a few parts that I’d like to know more about, the fact that those parts did not cause any confusion and only brought curiosity meant it was a damn great summary.</span></p><p class=\"c1\"><span class=\"c0\">“It’s fine. You’ll get to know more later on.” Xenon responded with a smile.</span></p><p class=\"c1\"><span class=\"c0\">“IF— you join us.” Cyrus said.</span></p><p class=\"c1\"><span class=\"c0\">“Join you two? Do you mean to become a sentinel?” I expressed doubt about my suitability for such a role. “Is that even… possible for me?”</span></p><p class=\"c1\"><span class=\"c0\">“Of course, my dude. Your skills were evident from the previous battle we just had together. Moreover, you received a blessing. It automatically qualifies you for the position, regardless of experience.” Cyrus answered.</span></p><p class=\"c1\"><span class=\"c0\">“But I barely know anything about Valoria, Dawnguard and…”</span></p><p class=\"c1\"><span class=\"c0\">“You will learn about all of these when you become a sentinel. Come on. Early tomorrow morning, I’ll help you to register for the trial.”</span></p><p class=\"c1\"><span class=\"c0\">“Hey hold on. Everything’s probably moving too fast for Vincas. Let him digest.” Xenon stopped Cyrus.</span></p><p class=\"c1\"><span class=\"c0\">“What’s there to think about? Unlike us, he doesn’t have a place to call home. If he becomes a sentinel, he would receive proper accommodations as well as a source of income to get him back on his feet. Moreover, he also gains a status, something that is very crucial for his future if he wants to continue residing here?” Cyrus argued.</span></p><p class=\"c1\"><span class=\"c0\">“Yes, I know, but you left out the part that he would be fighting monsters in this job, Cyrus. Regardless, it’s still a job that has a risk of death. It’s not something that can be forced upon a person. We should give him more time to think about it.” Xenon explained.</span></p><p class=\"c1\"><span class=\"c0\">“You get money and a place to stay for being a sentinel?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“Of course. Sentinels are literally the most sought after job in the world. You protect the lives of all the people here. Why would they not give you all the resources that you need?” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“Then I’m in.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">“See. Easy. How do you like that, Xenon?” Cyrus mocked him.</span></p><p class=\"c1\"><span class=\"c0\">“Are you sure, Vincas? If you just want a shelter and a way to live out your life, we both have multiple different ways to help you out. Being a sentinel means that you carry a responsibility, and you can lose your life at any moment.” Xenon was still in doubt.</span></p><p class=\"c1\"><span class=\"c0\">“Yes, I’m sure.” I replied firmly. </span></p><p class=\"c1\"><span class=\"c0\">I can understand Xenon’s concern, but if I’m just going to live out my life despite the second chance that I have in this world with a unique gift, I’d be back to exactly who I was before— and it’s not something that I would ever want again. Xenon, in return to my answer, nods in satisfaction.</span></p><p class=\"c1\"><span class=\"c0\">Maybe I still have a lot of regrets. Maybe I still haven’t fully forgiven myself. However, what is there to mourn? What is lost has already been lost. What matters now is how I move forward carrying those regrets.</span></p><p class=\"c1\"><span class=\"c0\">In the echoes of my failures, I find the strength to redeem myself again. Every life that I couldn’t protect, I will save twice as many. For every soul that I couldn’t rescue, I shall become the unwavering guardian of countless others.</span></p><p class=\"c1\"><span class=\"c0\">“Just then, you mentioned registering for the trial. Can you elaborate on that?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“It’s a trial by combat. Basically, it’s a simple test to check if you have the skills to become a sentinel.” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“Then don’t I need more time to prepare for the trial?”</span></p><p class=\"c1\"><span class=\"c0\">“Not really. I’ve seen your skills. You’re more than enough.”</span></p><p class=\"c1\"><span class=\"c0\">“I see.”</span></p><p class=\"c1\"><span class=\"c0\">“I know that you still have a lot of questions to ask, so let us know and we’ll always help you out.” Xenon said.</span></p><p class=\"c1\"><span class=\"c0\">“Thanks. Actually, one last thing that has been puzzling me.”</span></p><p class=\"c1\"><span class=\"c0\">“Go ahead.”</span></p><p class=\"c1\"><span class=\"c0\">“I am sure that my Valorish is terrible. How am I able to speak fluently to you two? It feels… so strange. I don’t know how to properly describe it. It’s like whatever I think and want to say, I can speak them out, but I can only remember the content of what I said and not the actual words themselves.”</span></p><p class=\"c1\"><span class=\"c0\">“Oh… It’s because of me.” Cyrus replied instead of Xenon.</span></p><p class=\"c1\"><span class=\"c0\">“What did you do?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“Well…” Cyrus looked around, then leaned closer to my ear. “One thing first— we are not meant to let others know too many details about our blessings.”</span></p><p class=\"c1\"><span class=\"c0\">“Why?”</span></p><p class=\"c1\"><span class=\"c0\">“There are many reasons for it. It will be good for you to follow my advice. Anyway, since we’ve already confirmed that you’re an Earthling, I think I can let you in for a little bit of how my blessing works.”</span></p><p class=\"c1\"><span class=\"c0\">“Okay.”</span></p><p class=\"c1\"><span class=\"c0\">“I make rules. Whatever rule that I make will be enforced in reality. What I did to you was simply stating a rule that we can communicate to each other smoothly via Valorish, despite the fluency and knowledge of the language.”</span></p><p class=\"c1\"><span class=\"c0\">What is this bullshit? And here I believe that I was gifted for being able to summon some mysterious cool blades, but this guy here can straight-up bend reality to his likings?</span></p><p class=\"c1\"><span class=\"c0\">“That… sounds so broken. You can literally do anything?” I could not hide my surprise.</span></p><p class=\"c1\"><span class=\"c0\">“Well, theoretically, yes. However, there are a lot of limitations. Some of them, if I carelessly breach, can cost me my life.” Cyrus replied casually.</span></p><p class=\"c1\"><span class=\"c0\">“...”</span></p><p class=\"c1\"><span class=\"c0\">Nevermind then. A double-edged ability is probably something that I would not want.</span></p><p class=\"c1\"><span class=\"c0\">“But wasn’t your ability something related to the floating spears?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“That was an effect from one of my rules.” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“I see. What about you, Xenon?” I asked quietly..</span></p><p class=\"c1\"><span class=\"c0\">“I thought it was obvious?” Xenon paused. “I create teleport portals.”</span></p><p class=\"c1\"><span class=\"c0\">“I assume you also have some kinds of limitations— like the number of portals or the distance?”</span></p><p class=\"c1\"><span class=\"c0\">“Something like that. How about you, Vincas?” Xenon asked.</span></p><p class=\"c1\"><span class=\"c0\">“I can summon some weapons that I craft within my mind. They don’t have any mind blowing ability other than their durability and are somehow more effective on hellspawns.”</span></p><p class=\"c1\"><span class=\"c0\">“More effective on hellspawns?”</span></p><p class=\"c1\"><span class=\"c0\">“Yea. They seem to hurt the hellspawns more than regular weapons, but as you previously mentioned, I guess it’s the entire purpose of a blessing— to defeat the hellspawns.”</span></p><p class=\"c1\"><span class=\"c0\">“Actually… you got the right answer, but just a slight incorrect reasoning.” Cyrus said.</span></p><p class=\"c1\"><span class=\"c0\">“What do you mean? “I replied.</span></p><p class=\"c1\"><span class=\"c0\">“I assume by now, you have fully understood that hellspawns can’t simply be subjugated via normal weapons. Correct?” Xenon said.</span></p><p class=\"c1\"><span class=\"c0\">“Yes.”</span></p><p class=\"c1\"><span class=\"c0\">“The reason is because those weapons do not have mana.”</span></p><p class=\"c1\"><span class=\"c0\">“Mana?”</span></p><p class=\"c1\"><span class=\"c0\">“You have never heard of the term ‘mana’ before?” Cyrus responded in surprise. “Do you even read any book or watch any movie?”</span></p><p class=\"c1\"><span class=\"c0\">“Eh…”</span></p><p class=\"c1\"><span class=\"c0\">“Mana is a form of energy in this world. It resides within our bodies and serves as an energy source to enable our blessings. The more mana you have in your body, the stronger your blessing is.</span></p><p class=\"c1\"><span class=\"c0\">In order to damage the hellspawns, mana is needed. That is why only those who have blessings can kill these creatures. In short, blessings convert the mana from your body into either an element, an object or an effect, and the mana within these is the what damages the hellspawns.”</span></p><p class=\"c1\"><span class=\"c0\">“I see. It all makes sense now.”</span></p><p class=\"c1\"><span class=\"c0\">“Yes.”</span></p><p class=\"c1\"><span class=\"c0\">“There are just so many things that I still don’t know. I really appreciate the help coming from both of you.”</span></p><p class=\"c1\"><span class=\"c0\">“You’re welcome, my dude. Xenon and you are the only ones that I know who come from Earth. It has already been nearly a decade since I met Xenon, so that was how long it took to find another Earthling.”</span></p><p class=\"c1\"><span class=\"c0\">“Cyrus is right. In this estranged world, we're all that we have.” Xenon agreed.</span></p><p class=\"c1\"><span class=\"c0\">As the evening wanes and laughter echoes through the cosy corners of the bar, we share a final round of toasts to bid our farewell to the night.</span></p><p class=\"c1\"><span class=\"c0\">Excitement bubbles within me for all the new things that I’ve learned today about this new world. The discoveries feel like puzzle pieces falling into place, opening the door to unexplored adventures.</span></p><p class=\"c1\"><span class=\"c0\">Armed with new knowledge, I’m eager for what lay ahead. The promise of new things to learn and challenges to face fuel my curiosity. With a heart full of possibilities, I embrace the thrill of a potential sentinel life where I can write my own heroic story.</span></p><div><p class=\"c5\"><span class=\"c0\"></span></p></div>"
}]