[{
    "id":3,
    "title":"Sentinel Trial",
    "html":"<p class=\"c0\"><span class=\"c1\">Today marks the day of the trial. Thanks to Cyrus and Xenon, I’ve been granted a few more days at the inn until I can officially become a sentinel. Then, my accommodations will be provided by the kingdom.</span></p><p class=\"c0\"><span class=\"c1\">“Are you ready?” A familiar sound came across.</span></p><p class=\"c0\"><span class=\"c1\">Finally, Cyrus arrives at the inn. To be honest, I can’t lie that I was quite nervous since last night and didn’t get much sleep. I also woke up early this morning just to fully prepare for the day. Fortunately, the inn provided breakfast, so I didn’t have to face the big day on an empty stomach.</span></p><p class=\"c0\"><span class=\"c1\">“Yup.” I replied. </span></p><p class=\"c0\"><span class=\"c1\">While looking around, I noticed that today, there was only Cyrus. </span></p><p class=\"c0\"><span class=\"c1\">“Where’s Xenon?” I asked.</span></p><p class=\"c0\"><span class=\"c1\">“Oh. He has some other urgent stuff to attend to, so it’s just going to be me today.”</span></p><p class=\"c0\"><span class=\"c1\">“I see.”</span></p><p class=\"c0\"><span class=\"c1\">“Don’t worry. I have you covered.”</span></p><p class=\"c0\"><span class=\"c1\">“Thanks. Where do we register?”</span></p><p class=\"c0\"><span class=\"c1\">“At the garrison. It’s in Astrum.”</span></p><p class=\"c0\"><span>“Isn’t </span><span>Astrum</span><span class=\"c1\">&nbsp;the inner district? And the garrison sounds like a military camp.”</span></p><p class=\"c0\"><span class=\"c1\">“Astrum— yes. Don’t worry, we’ll be able to pass through pretty easily. Garrison— just the way people call it here.”</span></p><p class=\"c0\"><span class=\"c1\">“Wait a second. Why did you say ‘passing through easily’? Do people normally have trouble getting through?”</span></p><p class=\"c0\"><span class=\"c1\">“Something like that.”</span></p><p class=\"c0\"><span class=\"c1\">“I don’t get it. It’s just another district, isn’t it?”</span></p><p class=\"c0\"><span class=\"c1\">“Yes, but there are still some differences. You need to be… well, at least a certain level in the society hierarchy in order to be granted an entry to Astrum.”</span></p><p class=\"c0\"><span class=\"c1\">“What? Do you mean that you have to be rich to go to Astrum? Does that apply to the other two inner districts as well?”</span></p><p class=\"c0\"><span class=\"c1\">“Not exactly. The poor can sometimes go to Astrum, but there are a lot more restrictions on them, such as having a letter of reference from someone in the inner district, or being a sentinel.”</span></p><p class=\"c0\"><span class=\"c1\">“Is this some kind of joke? In times like this, when humanity should be coming together for survival and our future, people are still bothered by differences in status?” My words resonated with frustration.</span></p><p class=\"c0\"><span class=\"c1\">“Well— yes, but without a hierarchy, there would be no order and laws. Unlike other kingdoms, Valoria did not have unlimited resources. Dawnguard was only able to become what it is right now thanks to the nobles’ support. That’s why since then, they’ve always had a bigger saying when it comes to how things work here.”</span></p><p class=\"c0\"><span class=\"c1\">“Seriously?”</span></p><p class=\"c0\"><span class=\"c1\">“Yes. Seriously. Don’t think too much about it. You’ll get used to it soon. Anyway, I’m a noble too, you know? I can get you to places around the capital easily so this won’t be a problem for you.”</span></p><p class=\"c0\"><span class=\"c1\">“But…”</span></p><p class=\"c0\"><span class=\"c1\">“Come on, let’s go. We’re going to miss out on something interesting.”</span></p><p class=\"c0\"><span class=\"c1\">“What’s happening?”</span></p><p class=\"c0\"><span class=\"c1\">“There will be a big shot registering to be a sentinel today. If we get there quickly, we’ll be able to watch her trial.”</span></p><p class=\"c0\"><span class=\"c1\">“Hold on. Who’s this big shot you’re talking about?”</span></p><p class=\"c0\"><span class=\"c1\">“You’ll see when we get there.”</span></p><p class=\"c0\"><span class=\"c1\">“...”</span></p><p class=\"c0\"><span class=\"c1\">—</span></p><p class=\"c0\"><span class=\"c1\">[A moment later]</span></p><p class=\"c0\"><span class=\"c1\">Finally, we’ve arrived at Astrum. I also understand what Cyrus meant earlier. When we approached the gate at the second wall, several guards awaited. People were also divided into two queues.</span></p><p class=\"c0\"><span class=\"c1\">The first queue, seemingly endless, was filled with commoners, based on my assumption on their attire. I watched as one by one reached the checkpoint, only to have their entry denied. There was dissatisfaction at times, but they were immediately met with imposing armed enforcers.</span></p><p class=\"c0\"><span class=\"c1\">On the other side, Cyrus and I found ourselves in a different queue— an almost empty one. Why the difference? Here was what happened: we strolled through, earning curious glances from the commoners. The guard greeted us, and that was when Cyrus brought out the medallion and said:</span></p><p class=\"c0\"><span class=\"c1\">“Cyrus Lightbearer.”</span></p><p class=\"c0\"><span class=\"c1\">“Ah— Sir Lightbearer. Welcome.”</span></p><p class=\"c0\"><span class=\"c1\">And just like that, we made our way into Astrum. Easy, right? It felt almost like we’d exploited the system. It’s disheartening when I reflect on it because even in a fantasy world, societal imbalances persist.</span></p><p class=\"c0\"><span class=\"c1\">Anyway, Cyrus urges me repeatedly to pick up the pace. Even though he has only been providing limited details on this big-shot, I believe I have already guessed at least half of it.</span></p><p class=\"c0\"><span class=\"c1\">Firstly, according to Cyrus, this big-shot seems to be a girl.</span></p><p class=\"c0\"><span class=\"c1\">Secondly, based on the fact that he is so excited to see her in person, this girl is not just any girl, but an extraordinarily beautiful one with high status. I mean— looking at his face right now; it’s as if he’s practically drooling, probably lost in thoughts of her beauty in his imagination. What a pervert.</span></p><p class=\"c0\"><span class=\"c1\">We’ve arrived at a sizable structure, quite imposing in its appearance, reminiscent of a guild. According to Cyrus earlier, it’s referred to as the garrison here. Stepping inside, the lounge area is bustling with numerous individuals</span></p><p class=\"c0\"><span class=\"c1\">I trail behind Cyrus as we navigate to the opposite side, where a long desk stands. Behind it, three impeccably dressed ladies in uniform assist people with their paperwork. Cyrus swiftly guides me to one of them.</span></p><p class=\"c0\"><span class=\"c1\">The lady at the counter speaks professionally and clearly. She walks me through the vital aspects of being a sentinel— duties, responsibilities, and such.</span></p><ol class=\"c4 lst-kix_ggpn9g8xhvis-0 start\" start=\"1\"><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Protect the kingdom: sentinels are tasked with safeguarding the kingdom and its citizens from hellspawns.</span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Slay hellspawns: sentinels must actively seek out and eliminate any hellspawns that pose a threat to the safety and well-being of the kingdom's citizens. This includes patrolling known hellspawn habitats and responding to reports of hellspawn sightings.</span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Maintain vigilance: sentinels must remain vigilant at all times, keeping a watchful eye on the kingdom's borders and territories for any signs of danger or unrest. They should be prepared to respond swiftly to any potential threats.</span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Report incidents: sentinels are required to report any significant incidents, threats, or discoveries related to hellspawn, to the kingdom. This ensures the kingdom to devise an appropriate action to be taken to address the situation. </span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Train and develop skills: sentinels should continuously train and develop their skills to become more effective guardians of the kingdom. This may involve honing combat abilities, studying hellspawn behaviour, or learning new techniques and strategies for defence. </span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Respect authority: sentinels must respect the authority of the royals, the nobles and the higher ranked sentinels; and follow their orders and instructions without question. This fosters a sense of discipline and unity within the sentinel ranks, ensuring smooth coordination and cooperation in times of crisis. </span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Serve with honour: sentinels should conduct themselves with honour, courage, and integrity at all times, serving as role models for the citizens of the kingdom. They should strive to uphold the highest standards of conduct and professionalism in their duties.</span></li><li class=\"c0 c2 li-bullet-0\"><span class=\"c1\">Sacrifice for the greater good: sentinels must understand that their role often requires personal sacrifice and dedication to the greater good of the kingdom. They must be willing to put themselves in harm's way to protect others and defend the realm from hellspawns.</span></li></ol><p class=\"c0\"><span class=\"c1\">Despite all these wordings, the main duty of a sentinel is to simply serve the kingdom, and slay the hellspawns. The rest of the rules are mainly there for legal action if a violation occurs.</span></p><p class=\"c0\"><span class=\"c1\">Anyway, the sentinel trial is conducted in combat, though it is more of a formality than an actual fighting ring. The primary requirement is that the registrant has received a blessing. This trial is more about showcasing your ability to the kingdom so that they can assign missions more fitting for your abilities.</span></p><p class=\"c0\"><span class=\"c1\">The trial is straightforward. An examiner— a high-ranking sentinel, will test me through combat. The passing criteria? Last for five minutes. Simple as that. No need to defeat the examiner or snatch some specific item. It’s merely a test to showcase my ability for five minutes.</span></p><p class=\"c0\"><span class=\"c1\">Everything proceeds smoothly, and I’m instructed to wait until my name is called in the testing ground. Just as we’re wrapping up, loud noises echo from outside. Cyrus, eyes gleaming with excitement, swiftly pulls me towards the testing ground.</span></p><p class=\"c0\"><span class=\"c1\">The testing ground resembles a small-sized arena, with the centre reserved for the candidate and the examiner. About five rows of seats, filled due to the presence of the big-shot, surround the arena. Cyrus guides me to the first row, which is already packed, leaving me curious about his intentions… until he waves his hands, whispers something, and two individuals stand up, offering us their seats.</span></p><p class=\"c0\"><span class=\"c1\">“What did you just do…?”</span></p><p class=\"c0\"><span class=\"c1\">“I paid them to reserve the seats for us.”</span></p><p class=\"c0\"><span class=\"c1\">“You what?”</span></p><p class=\"c0\"><span class=\"c1\">“Sh— Focus. She’s here.”</span></p><p class=\"c0\"><span class=\"c1\">Of course he would be using his noble status for such conveniences, but since it causes no harm, I suppose there’s really nothing for me to complain about.</span></p><p class=\"c0\"><span class=\"c1\">In the centre, a middle-aged man emerges. He’s dressed in light, combat-oriented clothing and exudes the aura of a seasoned veteran, so I assume he must be the examiner for today. He takes a deep breath, then announces a name.</span></p><p class=\"c0\"><span>“Eris </span><span>Flameheart</span><span class=\"c1\">.”</span></p><p class=\"c0\"><span class=\"c1\">Then, the crowd erupts into a frenzy. Shouts and cheers fill the air, prompting Cyrus to stand up, leaving me no choice but to join him for a better view.</span></p><p class=\"c0\"><span class=\"c1\">From the same gate the examiner emerged, a young maiden adorned with radiant, fiery-red locks cascading down in twintails walks out, flanked by two knights. Her lustrous hair dances with every movement, a reflection of her vibrant spirit. Now I understand what Cyrus meant; she’s undeniably beautiful.</span></p><p class=\"c0\"><span class=\"c1\">With a closer look, her porcelain complexion, illuminated by a natural rosy blush, exudes an alluring warmth. Drifting gently in the breeze, a delicate scarf encircles her neck, its soft fabric enhancing her elegant presence. Adorned in light and airy garments, she radiates an effortless grace, as if she were a living embodiment of spring itself.</span></p><p class=\"c0\"><span class=\"c1\">The noise from the crowd grows increasingly deafening, and almost everyone is on their feet. Honestly, it’s becoming annoying, making it harder to follow the proceedings.</span></p><p class=\"c0\"><span class=\"c1\">“Damn— She’s hot.”</span></p><p class=\"c0\"><span class=\"c1\">“Hey Cyrus, can you please calm down? You’re getting too excited.”</span></p><p class=\"c0\"><span class=\"c1\">“Are you blinded? Can’t you see that we’re witnessing a goddess descending.”</span></p><p class=\"c0\"><span class=\"c1\">“I know. I know. But still, it’s not like leaning closer will get her to notice you, right?”</span></p><p class=\"c0\"><span class=\"c1\">“Silence!” a commanding voice echoed from the examiner, slicing through the air.</span></p><p class=\"c0\"><span class=\"c1\">The entire atmosphere seems to shudder, and everyone promptly settles back into their seats in silence.</span></p><p class=\"c0\"><span class=\"c1\">“Ms. Flameheart, welcome. I am Reynold of House Armstrong, and I’ll be your examiner for today.” the examiner declared. </span></p><p class=\"c0\"><span class=\"c1\">Eris gracefully nods in acknowledgement, maintaining her noble demeanour.</span></p><p class=\"c0\"><span class=\"c1\">“The test is simple. You need only survive for five minutes to pass. Weapons and magic are allowed. Are you ready?” Reynold asked.</span></p><p class=\"c0\"><span class=\"c1\">“I’m ready.” Eris responded confidently.</span></p><p class=\"c0\"><span class=\"c1\">When Reynold appears to be ready, Eris initiates the battle with a breathtaking display, conjuring a massive fireball that ignites the crowd with excitement. The fiery projectile hurtles towards Reynold, releasing a burst of intense heat upon impact, sending waves of warmth across the entire stadium. The audience gasps, captivated by the spectacle. </span></p><p class=\"c0\"><span class=\"c1\">Reynold calmly emerges from the fiery aftermath, unscathed, unveiling a golden barrier around him. I’m not sure what this magical shield does, but it appears to neutralise the intense heat and potential harm from Eris’s fire-based attacks.</span></p><p class=\"c0\"><span class=\"c1\">In response, Eris, displaying quick thinking, conjures a flame veil around herself. She has good intuition. I have to acknowledge that it’s a wise decision to cast a defensive spell when uncertain about the opponent’s ability.</span></p><p class=\"c0\"><span class=\"c1\">A soft-spoken voice interrupts my thoughts with a gentle “Excuse me”.</span></p><p class=\"c0\"><span class=\"c1\">I turn to find a woman beside me, her features concealed by a hooded cloak and a white mask. I can’t help but wonder if the sun’s heat influenced her choice of attire. Suppressing any commentary, I realise she merely wants to reach her seat, conveniently located next to Cyrus. However, the trial has everyone engrossed, oblivious to her need for passage.</span></p><p class=\"c0\"><span class=\"c1\">Deciding to act, I nod at her and discreetly pull Cyrus’s sleeve, diverting his attention. When he turns around and sees my finger pointing at the mysterious lady, he understands the message and leans back to create space. The hooded woman swiftly moves past us and settles into the seat beside Cyrus.</span></p><p class=\"c0\"><span class=\"c1\">Cyrus, true to form, promptly dives back into the trial, his enthusiasm undiminished. It hasn’t taken long for me to grasp the essence of his character in these two days, and it’s not exactly a flattering revelation.</span></p><p class=\"c0\"><span class=\"c1\">Eris intensifies her assault, casting several fireballs. However, each attempt is effortlessly nullified by Reynold's unyielding barrier. As Reynold manoeuvres skillfully around the battlefield, Eris persists in her fiery onslaught. </span></p><p class=\"c0\"><span class=\"c1\">The rising temperature prompts the emergence of a large protective barrier over the stadium, shielding the crowd from the escalating flames. Looking at the shield surrounding us, I wonder if one person made it. It seems like the people who work here have already planned for when things go wild.</span></p><p class=\"c0\"><span class=\"c1\">Seizing the assurance that others are safe, Eris decides to charge up for an even more colossal fireball. But Reynold, a seasoned veteran, intercepts her channelling with a light push to get her off balance before she can unleash the full force. </span></p><p class=\"c0\"><span class=\"c1\">Despite the interruption, a smaller-scale fireball is released, only to be swiftly nullified by Reynold once again. Exhaustion begins to take its toll on Eris, evident in her wearied demeanour. </span></p><p class=\"c0\"><span class=\"c1\">Recognizing Eris's exceptional control over the flames, Reynold deems the test concluded. He steps forward, announcing:</span></p><p class=\"c0\"><span class=\"c1\">\"Ms. Flameheart, your mastery over fire is truly remarkable. I declare that you have not only showcased your skill but also passed this test with flying colours.\" </span></p><p class=\"c0\"><span class=\"c1\">The crowd erupts into applause, acknowledging Eris's prowess and Reynold's discerning evaluation. I have to agree with Cyrus on this one— that young lady is like a walking inferno. If it weren’t for this magical barrier, we might all be reduced to charcoal by now.</span></p><p class=\"c0\"><span class=\"c1\">As the trial concludes, Eris Flameheart is bestowed with the title of a sentinel. Once she gracefully departs, the crowd disperses like water pouring out of a jug. In the blink of an eye, the entire stadium empties. The only lingering figures are Cyrus, me and the hooded woman beside him.</span></p><p class=\"c0\"><span class=\"c1\">The day’s trials aren’t confined to Eris. Judging by the dwindling number of spectators, it seems my turn is imminent. Although, truth be told, no one seems particularly interested in my upcoming trial. I spot Reynold in conversation with another staff member, his gaze eventually lands on us.</span></p><p class=\"c0\"><span class=\"c1\">“Vincas.” He called out my name.</span></p><p class=\"c0\"><span class=\"c1\">I don’t possess a last name at the moment, so it didn’t make its way into my registration. Cyrus explained that in usual circumstances, this absence might label me as a commoner. However, since we’re enrolling to become sentinels, people might assume I’m concealing my identity, leaving a chance they won’t look down on me too much.</span></p><p class=\"c0\"><span class=\"c1\">I stand up from my seat and navigate the stadium through the “normal” route, a path not reserved for noble offspring. Cyrus leans over and whispers.</span></p><p class=\"c0\"><span class=\"c1\">“Hey Vincas, you might struggle with conversations down there, so just look up to me if you need help.”</span></p><p class=\"c0\"><span class=\"c1\">“Aight.” I replied. It appears that there’s a limited range to his ability. </span></p><p class=\"c0\"><span class=\"c1\">As I descend, I sense Cyrus’s eagerness to support me. Yet, what catches me off guard is that the hooded woman remains seated beside him. Is she also here to undertake the sentinel trial?</span></p><p class=\"c0\"><span class=\"c1\">I reach the arena floor. Reynold gazes in my direction and delivers a lengthy sentence that I fail to comprehend. I shift my attention to Cyrus, who promptly shouts.</span></p><p class=\"c0\"><span class=\"c1\">“He[] [][][][][]!”</span></p><p class=\"c0\"><span class=\"c1\">I assume that Reynold must have been explaining the rules and enquiring about my readiness, with Cyrus stepping in to respond. A touch perplexed, Reynold redirects his focus to me, awaiting confirmation. I nod in response, and in the next moment, a black blade materialises in my hand.</span></p><p class=\"c0\"><span class=\"c1\">“[][][][][][][][][][][].” Reynold commented.</span></p><p class=\"c0\"><span class=\"c1\">I take the initiative, leaping towards Reynold. My first slash, executed diagonally, misses. However, it’s within my plan. Swiftly, I halt the blade’s motion and reverse its direction, transforming the attack into a horizontal slash.</span></p><p class=\"c0\"><span class=\"c1\">Reynold effortlessly evades once more. Recognising the challenge, I step back, pondering my strategy. After a brief moment of blade fidgeting, I impulsively hurl the weapon at him. Despite the surprise on his face, he sidesteps the incoming blade and swiftly advances towards me, likely assuming I’m now unarmed.</span></p><p class=\"c0\"><span class=\"c1\">In response, I summon the pair of daggers in my hands and execute a cross slash. Reynold, reacting quickly, seizes both my wrists, preventing the attack. Leaping with both legs, I aim a chest kick, anticipating him to retreat. However, he moves away, and I adapt by allowing myself to fall and roll, minimising the impact. I swiftly stand up and hurl the daggers at him in a one-two motion.</span></p><p class=\"c0\"><span class=\"c1\">Ducking skillfully, Reynold evades both projectiles as I sprint towards him. While it seems like a familiar tactic, this time, there’s a twist. Crouching down, I attempt a low leg kick. Reynold anticipates and jumps, avoiding the kick as expected.</span></p><p class=\"c0\"><span class=\"c1\">Recalling my blade, I leverage the spin from my previous kick to execute an upward slash. As Reynold is now mid-air, stopping this attack becomes exceptionally challenging. Recognising the urgency, he deploys his barrier to deflect my blade.</span></p><p class=\"c0\"><span class=\"c1\">Unexpectedly, my blade penetrates the barrier effortlessly. This outcome isn’t part of my initial plan. I anticipated it to shatter my blade, akin to how it nullified Eris’s flames, and I had a backup plan for that scenario. The blade slices through the barrier like a hot knife through butter, stunning Reynold.</span></p><p class=\"c0\"><span class=\"c1\">He emits a loud roar, forcing out multiple layers of barriers. Although my blade remains unaffected, the contract propels my body faraway. After a series of rolls, I swiftly rise to my feet, assuming my stance once again, preparing for my original backup plan.</span></p><p class=\"c0\"><span class=\"c1\">“[][][][]’[] [][][][][][].” Reynold suddenly stopped and said.</span></p><p class=\"c0\"><span class=\"c1\">Confused, I glance at Cyrus, who’s also expecting Reynold’s response.</span></p><p class=\"c0\"><span class=\"c1\">“You [][][][][][].” Reynold said.</span></p><p class=\"c0\"><span class=\"c1\">I turn my attention to Cyrus again, but this time, I see both his arms raised and a wide, cheeky smile across his face. I interpret his jubilant reaction as a clear indication that I’ve successfully passed the test.</span></p><p class=\"c0\"><span class=\"c1\">I look at Reynold and offer a final bow as a gesture of respect. He responds with a subtle nod, acknowledging the conclusion of my trial.</span></p><p class=\"c0\"><span class=\"c1\">“How [][][] you do [][][][]?” He asked.</span></p><p class=\"c0\"><span class=\"c1\">Cyrus sprints down into the arena, coming beside me with an eager expression. He gestures toward Reynold and says.</span></p><p class=\"c0\"><span class=\"c1\">“You can talk to him now.”</span></p><p class=\"c0\"><span class=\"c1\">“Alright.” I responded, while turning back to Reynold. “Apologies. What did you mention earlier?”</span></p><p class=\"c0\"><span class=\"c1\">Reynold pauses, seemingly trying to comprehend the situation, but proceeds.</span></p><p class=\"c0\"><span class=\"c1\">“How did you manage to cut through my barrier?”</span></p><p class=\"c0\"><span class=\"c1\">“Well, I’m not entirely sure myself. It’s my first time witnessing that too.”</span></p><p class=\"c0\"><span class=\"c1\">“Could it be your blade?”</span></p><p class=\"c0\"><span class=\"c1\">“Most likely. I’ve used it to fend off hellspawns, but I never knew it had these mysterious effects.”</span></p><p class=\"c0\"><span class=\"c1\">“Fighting hellspawns? Have you faced one before?”</span></p><p class=\"c0\"><span class=\"c1\">Reynold’s response catches me off guard, prompting me to seek Cyrus’s assistance.</span></p><p class=\"c0\"><span class=\"c1\">“Indeed.” Cyrus responded on my behalf. “He encountered one during our recent journey beyond the walls. A hellspawn attacked us, and in that crucial moment, he received the blessing and summoned the blade.”</span></p><p class=\"c0\"><span class=\"c1\">Huh? What’s that? That wasn’t exactly what happened. I thought to myself, slightly puzzled by Cyrus’s embellished response. Nonetheless, I choose to nod in agreement, trusting there was a reason for his words.</span></p><p class=\"c0\"><span class=\"c1\">Reynold turns his attention to him and asks. “And you are?”</span></p><p class=\"c0\"><span class=\"c1\">“Cyrus Lightbearer. I’m his accomplice.” Cyrus replied with a grin. “He’s a bit shy, so I’m just helping him out.”</span></p><p class=\"c0\"><span class=\"c1\">Really? Shy? Well, whatever works, I guess.</span></p><p class=\"c0\"><span class=\"c1\">“I see.” Reynold paused, and it felt like gears were turning in his mind. “Anyway, congratulations, Vincas. You’re now a sentinel.”</span></p><p class=\"c0\"><span class=\"c1\">He extends his hand, and I shake it firmly.</span></p><p class=\"c0\"><span class=\"c1\">“Thank you, Sir Armstrong.” I replied appreciatively.</span></p><p class=\"c0\"><span class=\"c1\">Exiting the stadium with Cyrus, my mind keeps circling back to the mysterious woman who had joined us earlier. I can’t shake the curiosity about her identity.</span></p><p class=\"c0\"><span class=\"c1\">“Hey Cyrus, can we stick around a bit longer?” I asked.</span></p><p class=\"c0\"><span class=\"c1\">“Hm… why?” Cyrus questioned.</span></p><p class=\"c0\"><span class=\"c1\">“I want to watch the next trial.”</span></p><p class=\"c0\"><span class=\"c1\">“How do you know there’s another one— Oh, for her?” Cyrus finally caught on. “Yeah, I’m cool with that. Let’s stay and watch.”</span></p><p class=\"c0\"><span class=\"c1\">While we’re making our way back to the stadium seats, we cross paths with the mysterious woman descending toward the arena. Taken aback by our sudden change of plans, she hesitates momentarily before proceeding. She continues down to the arena, heading straight for Reynold.</span></p><p class=\"c0\"><span class=\"c1\">She seems to share something confidential with Reynold. The veteran sentinel’s expression shifts to one of surprise, and he attempts to lower his body, but she intervenes, using her hands to prop up his elbows and prevent him from what I assume to be kneeling.</span></p><p class=\"c0\"><span class=\"c1\">After their hushed conversation concludes, Reynold unexpectedly turns towards Cyrus and me.</span></p><p class=\"c0\"><span class=\"c1\">“I apologise for the inconvenience, but may I ask both of you to leave the stadium for the rest of the day?” He requested.</span></p><p class=\"c0\"><span class=\"c1\">Cyrus and I exchange puzzled glances.</span></p><p class=\"c0\"><span class=\"c1\">“Well, I guess we have no choice. Let’s go then?” Cyrus suggested.</span></p><p class=\"c0\"><span class=\"c1\">“Hm…” I responded.</span></p><p class=\"c0\"><span class=\"c1\">We exit the stadium once again. As we walk away, Cyrus begins to voice his thoughts.</span></p><p class=\"c0\"><span class=\"c1\">“There’s definitely something fishy going on. I don’t recall people getting asked to leave the stadium ever, unless they are being super rude and bothering others, which I don’t think is the case for us.”</span></p><p class=\"c0\"><span class=\"c1\">“Yeah, I think it’s that lady’s request.” I speculated.</span></p><p class=\"c0\"><span class=\"c1\">“Why did she want us to leave, though? We don’t even know her?” Cyrus wondered.</span></p><p class=\"c0\"><span class=\"c1\">“She probably doesn’t want us to see her blessing?”</span></p><p class=\"c0\"><span class=\"c1\">“Ah… that must be it. Maybe it’s something not as flashy as the Flameheart daughter or yours, so she must have felt a bit shy for others to see it.”</span></p><p class=\"c0\"><span class=\"c1\">“Perhaps.”</span></p><p class=\"c0\"><span class=\"c1\">Cyrus’s reasoning does seem plausible. Eris Flameheart set the stadium ablaze, and I managed to break through the same barrier that stopped her. Considering Reynold’s reaction, these feats likely exceed the capabilities of an ordinary registrant. It makes sense that the mysterious lady didn’t want to showcase something basic or potentially fail in front of us, especially after witnessing Eris and me.</span></p><p class=\"c0\"><span class=\"c1\">“Anyway, where do we go now?” I inquired.</span></p><p class=\"c0\"><span class=\"c1\">“We need to first head back to the garrison for your new medallion.” Cyrus responded.</span></p><p class=\"c0\"><span class=\"c1\">As we leave, I sense a slight tremor beneath the ground. It might be just my heightened awareness that could still be lingering around from the test, as no one else seems to notice anything. Perhaps it will take some time to switch off the combat mode within me.</span></p><p class=\"c0\"><span>Cyrus leads me back to the garrison to finish up the paperwork. Like Cyrus and Xenon, I too receive a bronze medallion adorned with a majestic deer carved in the centre. Curiosity piqued, I </span><span>flip</span><span class=\"c1\">&nbsp;it over, expecting my name on the back but there’s nothing.</span></p><p class=\"c0\"><span class=\"c1\">“Excuse me, miss. I notice that a lot of us get the same medallion. So that makes me wonder, what’s stopping someone from stealing a medallion and pretending to be a sentinel?” I asked.</span></p><p class=\"c0\"><span class=\"c1\">“Well, it’s technically possible, but the consequences for identity theft, especially impersonating a sentinel, are severe. People rarely attempt it.” She replied.</span></p><p class=\"c0\"><span class=\"c1\">“But don’t all the medallions look the same? How will people be able to identify the crime?”</span></p><p class=\"c0\"><span class=\"c1\">“The medallions indeed look the same, but each one of them conceals the identity of its owner within a hidden system.”</span></p><p class=\"c0\"><span class=\"c1\">“How does that work?”</span></p><p class=\"c0\"><span class=\"c1\">“The kingdom has ways to check the identity linked to a medallion, though it’s not disclosable to the public.”</span></p><p class=\"c0\"><span class=\"c1\">“I see, so it’s secure against counterfeit products?”</span></p><p class=\"c0\"><span class=\"c1\">“Exactly. The identities are purposely concealed. Let’s say if the name of the owner is carved on the medallion, then a physical inspection would usually be performed. However, since this task would most likely be done by a human being, there would be a higher chance of a fake medallion bypassing the verification.”</span></p><p class=\"c0\"><span class=\"c1\">“I see. Is the garrison the only place that will verify the medallion?”</span></p><p class=\"c0\"><span class=\"c1\">“No. Gates and checkpoints across Dawnguard can access the same method to verify the medallion’s identity. Besides, I’d like to bring up a point that a counterfeit medallion would not be that useful.”</span></p><p class=\"c0\"><span class=\"c1\">“Why is that?”</span></p><p class=\"c0\"><span class=\"c1\">“Sentinels don’t accept any form of payment for their services. Instead, the kingdom would provide full support to them. As a result, faking a sentinel oftenly brings no real benefits to the perpetrator.”</span></p><p class=\"c0\"><span class=\"c1\">“I see.”</span></p><p class=\"c0\"><span class=\"c1\">I thank the receptionist and conclude my quick questioning session.</span></p><p class=\"c0\"><span class=\"c1\">“Congratulations, man. Now you are one of us. When Xenon returns, let’s have a drink.”</span></p><p class=\"c0\"><span class=\"c1\">“Sure!”</span></p><p class=\"c0\"><span class=\"c1\">[ Mysterious lady’s perspective ]</span></p><p class=\"c0\"><span class=\"c1\">Today was the big test day, and despite being well-prepared, nerves tingle within me. The trial was usually held in the stadium, and the thought of facing a crowd made my anxiety flare up.</span></p><p class=\"c0\"><span class=\"c1\">Back in my youth, I faced crowds often, even delivered speeches. But “that” incident changed everything. The uncontrollable shivers, cold sweat, and a pounding head— it’s like a trauma etched into me.</span></p><p class=\"c0\"><span class=\"c1\">Yet, I wouldn’t let this anxiety break my resolve today. There were bigger reasons for success now— my father’s approval, and the chance to make our kingdom proud. Fully prepared, I’d even donned a ragged cloak with a low hood, hiding my face perfectly.</span></p><p class=\"c0\"><span class=\"c1\">Another reason why today was chosen was because of Eris. Why was I able to say her name so casually? It was because she was my childhood friend. We’d probably known each other for over… a decade now?</span></p><p class=\"c0\"><span class=\"c1\">Anyway, she had always been urging me to join her on the path of becoming a sentinel. However, due to my circumstances, it had not been easy and she understood.</span></p><p class=\"c0\"><span class=\"c1\">When I finally decided to take the plunge, her joy was evident. We agreed to coordinate our test days so that she could assist me in hiding my identity.</span></p><p class=\"c0\"><span class=\"c1\">For her test, Eris planned to captivate the entire stadium using her noble status, appearance and lastly, her fiery abilities. Just as we had planned, Eris was able to storm up a grand spectacle that got everyone’s attention. Seizing the moment, I managed to slip in unnoticed.</span></p><p class=\"c0\"><span class=\"c1\">The plan seemed foolproof. Eris’s grand display would eventually conclude, the crowd would disperse, and then it would be my turn when no one else lingered around.</span></p><p class=\"c0\"><span class=\"c1\">It seems like a perfect plan, doesn’t it? Yet, there is an unexpected turn of events. Someone else, not Eris or me, has also registered for the test today. Initially, I thought luck was still on my side because he would go first, meaning by the time it’s my turn, he would have finished and left.</span></p><p class=\"c0\"><span class=\"c1\">But no, this guy and his friend decide to stroll back into the stadium?! Why? What were they thinking, suddenly returning here? Did they catch a glimpse of my face and find out about my real identity?</span></p><p class=\"c0\"><span class=\"c1\">Anyway, no-no-no, this is not okay. This was not what I signed up for. This was not what I prepared months for. As they walk back to the seating area, I dash into the arena and head straight to the examiner, Reynold.</span></p><p class=\"c0\"><span class=\"c1\">“Sir Armstrong, I’m the next registrant for the trial. May I have a request before we start?”</span></p><p class=\"c0\"><span class=\"c1\">“Hm…”</span></p><p class=\"c0\"><span class=\"c1\">He eyes me strangely and then pulls out the paper, presumably the list of test participants for the day. He scans through the list and probably arrives at my name, then quickly looks back up at me. Yeah, I know this reaction. It’s what I always get.</span></p><p class=\"c0\"><span class=\"c1\">I slightly lift my head so he can see part of my face, but carefully enough so the two guys in the seating area cannot notice. He immediately recognises my identity and starts to kneel down.</span></p><p class=\"c0\"><span class=\"c1\">I quickly halt him by gently holding up his elbows. It would definitely raise suspicions if the test examiner was to kneel down in front of a registrant.</span></p><p class=\"c0\"><span class=\"c1\">Well, it can’t be helped. At the end of the day, I am Ciarra Crownsworth, princess of Valoria, and third in line to the succession of the throne.</span></p><p class=\"c0\"><span class=\"c1\">I might not have as much prestige as my two older brothers, who are higher in the line of succession, but my status as a princess holds immense political power. Many noble men seek my hand in marriage for the political alliance it brings, but political marriage is what I despise the most.</span></p><p class=\"c0\"><span class=\"c1\">It’s the very reason why I’m here— to prove my strength as a potential leader of the great kingdom of Valoria, and not just another piece on someone else’s chessboard.</span></p><p class=\"c0\"><span class=\"c1\">“Milady, I apologise for not recognising you earlier.” Reynold said.</span></p><p class=\"c0\"><span class=\"c1\">“It’s okay, Sir Armstrong. With my disguise, there’s no way you could have. Anyway, about my request…”</span></p><p class=\"c0\"><span class=\"c1\">“Yes, milady. Please speak your mind, and I’ll do my best to fulfil your request.”</span></p><p class=\"c0\"><span class=\"c1\">“May I request all the other spectators in the stadium to leave? I want my sentinel trial to be a secret.”</span></p><p class=\"c0\"><span class=\"c1\">“Of course, milady. Please give me a moment.”</span></p><p class=\"c0\"><span class=\"c1\">Just like that, Reynold walks over to the other two gentlemen and instructs them to leave. They appear confused at first, but realising the authority of the bastion and its staff, they comply and exit. Now, a sense of peace settles over the stadium, allowing me to finally begin my trial.</span></p><p class=\"c0\"><span class=\"c1\">“Milady, are you sure about this?” Reynold confirmed once more.</span></p><p class=\"c0\"><span class=\"c1\">“Yes. Do not worry about hurting me. I’m not as weak as I look.”</span></p><p class=\"c0\"><span class=\"c1\">As soon as I finish my sentence, the ground beneath me starts to freeze, quickly expanding towards Reynold. Reacting swiftly, he leaps back, avoiding the encroaching ice. </span></p><p class=\"c0\"><span class=\"c1\">Beside me, two large ice spears materialise, hovering in the air. With a wave of my hands, both spears soar towards Reynold. In response, he promptly casts his golden barrier, shattering my icy projectiles.</span></p><p class=\"c0\"><span class=\"c1\">Then, a rain of ice shards is already waiting above him. Despite the barrier standing strong, the waves of ice shards slow down his movement, making it difficult for him to approach me easily. Another advantage of these tiny ice shards is that they melt quickly, creating a light, steamy fog under the current sun.</span></p><p class=\"c0\"><span class=\"c1\">Using this time, I channel my energy for a larger attack. Reynold notices and tries to force his way through. As he moves closer, he realises that the ground around me has been frozen earlier, making it slippery. Balancing on the icy surface is challenging, but for a veteran like Reynold, it doesn’t seem too difficult.</span></p><p class=\"c0\"><span class=\"c1\">He reaches out his hand, aiming for one of my arms.</span></p><p class=\"c0\"><span class=\"c1\">“That’s enough, milady.” Reynold calmly notified me before making contact.</span></p><p class=\"c0\"><span class=\"c1\">However, to his surprise, when he catches my left arm, my entire body freezes up, becoming an ice statue. It was actually my ice clone.</span></p><p class=\"c0\"><span class=\"c1\">While Reynold was under the heavy waves of attacks, I created an ice statue of myself. Due to the steamy fog from the ice rain, he wasn’t able to differentiate the statue from the real me. The actual me is now positioned behind Reynold.</span></p><p class=\"c0\"><span class=\"c1\">I quickly reached this position thanks to the small ice path I made, circling around the arena, and I just needed to skate on it. Now, my attack is fully charged, and the temperature around the arena is dropping drastically. Almost as if Reynold cannot believe it, a blizzard builds up right in front of him.</span></p><p class=\"c0\"><span>But then, I </span><span>stop</span><span class=\"c1\">ped. There is no need to go all out and force Reynold to play his trump cards too. I fully understand that it’s just the title of a sentinel. Reynold understands my intention as well, and the battle concludes here.</span></p><p class=\"c0\"><span class=\"c1\">“That was an amazing display of skills, milady. I am honoured to witness the blessing that has been passed down through generations of our rulers.”</span></p><p class=\"c0\"><span class=\"c1\">Reynold is correct. The ability to manipulate ice is the signature blessing that many generations of the royal family have shown to the world. It is no surprise that I would inherit the same power.</span></p><p class=\"c0\"><span class=\"c1\">There is nothing strange about it because it is a well-known fact that blessings can be inherited by the user’s descendents. Another famous example is the Flameheart family in Valoria, who has been known to produce many powerful fire users— Eris, for example.</span></p><p class=\"c0\"><span class=\"c1\">I appreciate Reynold’s comment, and in modesty, I also thank you for his guidance. Just like that, my trial has come to a conclusion.</span></p><p class=\"c0\"><span class=\"c1\">Aside from securing the sentinel position successfully today as planned, I also need to take note of those two men from earlier. One of them had the mysterious black blade and was able to cut through Reynold’s barrier, something that not even Eris or my attacks were able to do.</span></p><p class=\"c0\"><span class=\"c1\">The other, although appearing to be a companion, seems to possess some translating skills. Moreover, I vividly remember that I might have seen his face somewhere before. He definitely is one of the noble kids that I had met.</span></p><p class=\"c0\"><span class=\"c1\">Anyway, I’m sure that we’ll see each other soon eventually. Let me quickly head back and share the good news with Eris.</span></p>"
}]