[{
    "id": 3,
    "title": "History Lesson",
    "html": "<p class=\"c1\"><span>We continue walking through the encampment, weaving past clusters of soldiers and healers. Eventually, we </span><span>reach</span><span class=\"c0\">&nbsp;a slightly larger tent near the center of the camp. It&rsquo;s sturdier than the others, reinforced at the corners, with a well-maintained banner bearing a silver emblem fluttering outside. This must be where Cyrus resides.</span></p><p class=\"c1\"><span class=\"c0\">He had introduced himself earlier as a Templar&mdash;though I hadn&rsquo;t known what that meant at the time, the deference others show him now makes one thing clear: his rank is not a minor one.</span></p><p class=\"c1\"><span class=\"c0\">After getting ourselves comfortable on the chairs, Cyrus starts his lecture.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;A thousand years ago, floating stone pillars suddenly appeared and the ground beneath these pillars sank so deep that the hellish creatures crawled out from there. These creatures were called Hellspawns, the same ones that you saw in the battlefield, and the other unknown side where they came from was called Abyss. They then started attacking all lives discriminately, killing and consuming everything on sight. </span></p><p class=\"c1\"><span class=\"c0\">At the beginning, we were able to fend them off with normal weapons. However, bigger and stronger Hellspawns started showing up and completely rendered those weapons useless. These merciless monsters were unstoppable and wiped out most of the population.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Then&hellip; how were we able to survive through that for a thousand years?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Legend says that after around six hundred years, when all lives were about to be extinguished, the Celestials took pity on us and decided to bestow their power to the land. </span></p><p class=\"c1\"><span>Their unleashed power gave birth to a new, mysterious material&mdash;one that held the potential to grant humanity an entirely new kind of strength. We came to call this miraculous substance </span><span>Aetherion</span><span class=\"c0\">.</span></p><p class=\"c1\"><span>The first twelve individuals who discovered </span><span>Aetherion</span><span class=\"c0\">&nbsp;were forever changed. They awakened incredible abilities, powerful enough to stand against even the mightiest of Hellspawns, and dragged our world back from the very brink of extinction.</span></p><p class=\"c1\"><span>After that, one after another, a handful of individuals began to resonate with Aetherion. We call them </span><span>Resonators</span><span class=\"c0\">. However, they were unable to harness the crystal&rsquo;s power directly like the twelve heroes.</span></p><p class=\"c1\"><span>Fortunately, one among the twelve heroes, guided by the Celestials, crafted unique artifacts&mdash;tools that allowed those who resonated with Aetherion to channel its raw energy. These sacred creations are known as </span><span>Soulforges</span><span class=\"c0\">.</span></p><p class=\"c1\"><span class=\"c0\">Each Soulforge is individually crafted, tailored to the soul and nature of its bearer. With them, a Resonator can summon lightning from the heavens, hurl fireballs that scorch the earth, enhance their physical strength beyond mortal limits, or even transform into beasts of legend.</span></p><p class=\"c1\"><span class=\"c0\">Yet, the chance of resonating with Aetherion remained extraordinarily rare. Most of humanity would live and die without ever feeling its call.</span></p><p class=\"c1\"><span>Thus, the heroes gathered their kin and united their races, building vast, impenetrable strongholds to shield those without power. These sanctuaries became known as </span><span>Bastions</span><span class=\"c0\">, each one ruled and defended by one of the twelve great heroes.</span></p><p class=\"c1\"><span class=\"c0\">The twelve heroes, who stood at the peak of mankind, were called the Paragons, along with a title that was given to them based on their abilities and achievements. The Paragon of the Valorians who led our Bastion, Everlight, was known as the Dawn Bringer, because she was the inventor of Soulforge&mdash;a new light for humanity.</span></p><p class=\"c1\"><span class=\"c0\">Nowadays, the Resonators also carry on the title of their Paragons depending on which Bastion they come from. For example, Everlight&rsquo;s Resonators are also sometimes referred to as the Dawn Bringers.</span></p><p class=\"c1\"><span class=\"c0\">Generations after generations, Paragons choose their descendants to continue leading their people. There are cases where the lineage of a few Paragons does not continue, but the majority of the time, it&rsquo;s always the descendants. </span></p><p class=\"c1\"><span class=\"c0\">The reason is because Resonators in the same bloodline tend to also resonate with Aetherion, and gain similar abilities to their ancestors. As a result, the Paragons&rsquo; unmatched strength and legacy can carry on. </span></p><p class=\"c1\"><span class=\"c0\">Was that able to help you fully paint the picture of this world&rsquo;s situation?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;That&rsquo;s&hellip; a lot to take in so I might need some time to process.&rdquo; I replied.</span></p><p class=\"c1\"><span class=\"c0\">Honestly, I have to admit that Cyrus did an amazing job summarising the entire history. Although there are still a few parts that I&rsquo;d like to know more about, the fact that those parts did not cause any confusion and only brought curiosity meant it was a great summary.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;It&rsquo;s fine. You&rsquo;ll come to understand more in time,&rdquo; Cyrus said, his voice calm. &ldquo;Anyway, one of my men told me you survived an encounter with a Scorcher&mdash;that large Hellspawn that breathes fire. Most people wouldn&rsquo;t have made it out alive. You&rsquo;ve done well.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I was just&hellip; lucky,&rdquo; I replied. &ldquo;When it was about to kill me, the daggers I was holding suddenly became coated in a pitch-black layer. Then I felt this surge&mdash;this strength I&rsquo;ve never had before&mdash;and somehow, I managed to kill it.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Interesting.&rdquo; Cyrus narrowed his eyes, intrigued. &ldquo;Where did you get those daggers?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I&hellip; took them from a fallen soldier.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;From them?&rdquo; he repeated, genuine surprise on his face.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I&rsquo;m sorry. I only did it to survive. When I found him, he was already gone.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;No, I understand. That&rsquo;s not the issue.&rdquo; Cyrus turned to the side, rummaging through a small chest near the corner of the tent. After a moment, he returned, holding a familiar weapon. &ldquo;Was it like this?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">I nodded. &ldquo;Yes, that&rsquo;s the same kind of dagger.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Can you show me again?&rdquo; he asked, a spark of excitement in his voice.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I&hellip; I can try,&rdquo; I said, though doubt lingered in my mind. I wasn&rsquo;t even sure how it had happened in the first place.</span></p><p class=\"c1\"><span>I took the dagger from his hand and gripped it firmly. Nothing happened right away. I focused&mdash;on the blade, on the sensation from earlier, on that desperate moment when I thought I was going to die. I remembered the Scorcher&rsquo;s burning breath, the hopelessness, and my instinct to survive. I didn&rsquo;t </span><span>think</span><span>. I simply </span><span class=\"c3\">acted</span><span class=\"c0\">.</span></p><p class=\"c1\"><span class=\"c0\">Then, it happened.</span></p><p class=\"c1\"><span class=\"c0\">The dagger darkened. A pitch-black sheen spread across its surface, coating the entire weapon in an eerie, shadowy layer.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;How is this&hellip; possible?&rdquo; Cyrus murmured in disbelief.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;What do you mean? You mentioned people could gain powers through weapons before, right? The ones made from&mdash;what were the weapons called again?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Soulforges,&rdquo; he said, not taking his eyes off the blade. &ldquo;But this isn&rsquo;t one. This dagger isn&rsquo;t forged from Aetherion. It&rsquo;s just an ordinary weapon.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;...Then what does that mean?&rdquo;</span></p><p class=\"c1\"><span>Cyrus stepped back, visibly shaken. &ldquo;It means the power didn&rsquo;t come from the weapon&mdash;it came from </span><span class=\"c3\">you</span><span class=\"c0\">. This has never happened before. You&rsquo;ve&hellip; performed a miracle.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">I looked at the weapon in my hand, unsure how to feel. &ldquo;I&hellip; I don&rsquo;t even know how to react to that. What am I supposed to do now?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">Cyrus gave me a warm, resolute smile. &ldquo;Join me.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Join you?&rdquo; I blinked. &ldquo;You mean&hellip; the Order you mentioned before?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">He nodded. &ldquo;Yes. The Second Order of Everlight.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">I hesitated. &ldquo;Is that even possible? I&rsquo;m just&hellip; someone who woke up in the middle of a battlefield.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;You are someone who awakened a power unlike anything this world has ever seen. A force that doesn&rsquo;t rely on Aetherion. That kind of gift is beyond rare&mdash;it&rsquo;s revolutionary. It&rsquo;s not an exaggeration to say that you might be able to change the fate of not just Everlight, but the entire world.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">I gave an awkward laugh. &ldquo;That&rsquo;s&hellip; a lot. I barely survived a fight that you would&rsquo;ve ended in seconds.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;And yet you survived it, when most would&rsquo;ve died. Don&rsquo;t forget&mdash;many Resonators couldn&rsquo;t even defeat the weakest Hellspawn when they first received their Soulforges. But with training, discipline, and time, they grew stronger. You&rsquo;ve already shown you have potential. Let me help you shape it.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;But I barely know anything about Everlight, Bastions and&hellip; those monsters. I was there&mdash; watching people getting ripped apart by those monsters. I&hellip; don&rsquo;t know if I can face them again.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Your skills were evident from the fact that you survived despite being thrown right in the middle of the battlefield. Moreover, you&rsquo;re more special than any Resonator out there. It automatically qualifies you for a position, regardless of experience.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">Seeing that I&rsquo;m still hesitating, Cyrus continues.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;There must be a reason why you were teleported here, in this apocalyptic world. Considering the newfound power that you received, isn&rsquo;t it an indirect way of this world asking for your help against the Hellspawns?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I&hellip;&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;You&rsquo;ll get a better idea if I explain to you about the hierarchy of Everlight. </span></p><p class=\"c1\"><span class=\"c0\">As you have already known, at the very top of the Bastion is the Paragon. In Everlight, the militaria is categorised into six legions, named Orders, each with a specific role. We here are the Second Order, which specialises in frontline combat and large-scale engagements.</span></p><p class=\"c1\"><span class=\"c0\">The First Order is personally led by the current Paragon himself, and is under the command of the first Paragon&rsquo;s descendants, whom we refer to as the royal family. The other five Orders were managed by five of the most influential noble families in Everlight. The family heads are usually the ones who are at the top of the Orders, and they are called the Pillars. There is a saying of Five Pillars One Paragon in Everlight to emphasise that.</span></p><p class=\"c1\"><span class=\"c0\">Aside from the Pillar, there are two main ranks in an Order: Warden, and Templar. A Resonator is usually given the rank of a Templar, while an ordinary soldier is given the rank of a Warden. </span></p><p class=\"c1\"><span class=\"c0\">There are cases where a Resonator becomes a Warden, but that usually happens when the individual&rsquo;s resonance with Aetherion is weak&mdash;barely enough to manifest any real power.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">He leaned back slightly, folding his arms.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Everlight&rsquo;s resources are limited. Most of what we have is allocated to the military, ensuring the Bastion holds its ground against the never-ending waves of Hellspawns. But there&rsquo;s another reason. The Bastion also provides housing and wages to the Wardens. In these difficult times, many people enlist not only out of duty to protect their home, but simply to survive.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">He paused, his gaze steady. &ldquo;Templars, however, are different. They receive better accommodations, higher pay, and a respected status among the people. Many Resonators join the Orders for the recognition and honor that come with the role. It&rsquo;s rare, but just as a Resonator might start out as a Warden, an exceptional Warden can rise to become a Templar.</span></p><p class=\"c1\"><span class=\"c0\">With the potential you&rsquo;ve shown, if you were to join us, I believe you would at least start as a Templar. That means you&rsquo;d be provided with shelter, food, clothing, and a steady life within the Bastion&mdash;no more worrying about survival.</span></p><p class=\"c1\"><span class=\"c0\">But I won&rsquo;t sugarcoat it. Being a Templar also means placing yourself in harm&rsquo;s way. You&rsquo;ll be expected to fight on the front lines. It&rsquo;s dangerous. Many have died doing this work. So if you decide that this path isn&rsquo;t for you, I&rsquo;ll understand.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">I paused, my mind heavy with the weight of the decision before me.</span></p><p class=\"c1\"><span class=\"c0\">Maybe he&rsquo;s right. I&rsquo;m a stranger in this world&mdash;no family, no connections, no means to survive on my own. Left to wander aimlessly, I&rsquo;d eventually wither in the wilderness, another nameless corpse in a world full of danger.</span></p><p class=\"c1\"><span>It </span><span class=\"c3\">is</span><span class=\"c0\">&nbsp;a risk&hellip; but one that carries purpose, direction&mdash;and maybe even hope.</span></p><p class=\"c1\"><span>Wasn&rsquo;t I the one who always resented the monotony of my old life? Always complaining about how ordinary everything felt, about how nothing ever </span><span class=\"c3\">mattered</span><span class=\"c0\">?</span></p><p class=\"c1\"><span class=\"c0\">When I first encountered that Hellspawn, I could&rsquo;ve turned my back. I heard someone crying for help, and instead of running, I charged in. It wasn&rsquo;t just impulse&mdash;it was something inside me that refused to stay idle.</span></p><p class=\"c1\"><span class=\"c0\">Maybe&hellip; I&rsquo;ve always been waiting for something like this. A break from the mundane. A calling.</span></p><p class=\"c1\"><span class=\"c0\">Now, as fate opens its doors before me, why should I hesitate?</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I understand,&rdquo; I finally said, looking up at Cyrus, who had been patiently watching me. &ldquo;I think you&rsquo;re right.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">A small smile formed on his lips.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;I&rsquo;ll join your Order.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;That&rsquo;s the spirit,&rdquo; he said with a grin, placing a firm hand on my shoulder. &ldquo;Get some rest. The battle here is done, and we&rsquo;ll be heading back to Astrum first thing tomorrow.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Astrum?&rdquo; I repeated.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;It&rsquo;s one of Everlight&rsquo;s districts,&rdquo; he explained. &ldquo;I&rsquo;ll tell you more once we arrive. You&rsquo;ve already had more than enough to digest for one day.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Alright,&rdquo; I nodded. &ldquo;Thanks, Cyrus.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&mdash;</span></p><p class=\"c1\"><span class=\"c0\">[Next day]</span></p><p class=\"c1\"><span class=\"c0\">We&rsquo;re currently on our way to Astrum, and I honestly consider myself lucky to be acquainted with Cyrus due to the fact that I&rsquo;m sitting in the carriage, while many others are walking on foot.</span></p><p class=\"c1\"><span class=\"c0\">As we journey towards our destination, the landscape transforms, and a sense of anticipation hangs in the air. The horizon is slowly overtaking the grandeur of the white walls I saw yesterday.</span></p><p class=\"c1\"><span class=\"c0\">Around me, I can see farm fields stretching out in a mosaic of emerald green and burnt orange. Tracts of newly sown wheat yield a solf, almost velvet texture, while older fields, ready for harvest, gleamed with a golden sheen. The farm fields tell a cathedral of hard work, painted by the hand of nature, and sculpted from the sweat and struggles of the farmers.</span></p><p class=\"c1\"><span class=\"c0\">Then, from a distance, another towering wall appears like an imposing fortress, stretching high into the sky, their pristine surface gleaming in the sunlight. I can&rsquo;t help but marvel at the sheer scale of the structure, a testament to the might and determination of the kingdom that lay beyond.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Another&hellip; wall?&rdquo; I asked in shock.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Yes. We have a few of these in Everlight, and you should be able to guess what they are for.&rdquo; Cyrus replied, before continuing. &ldquo;Interested in knowing the inner structure?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Please, if you don&rsquo;t mind?&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Of course not.&rdquo; Cyrus smiled. &ldquo;Bastions were built on a very simple concept&mdash;to defend against the hellspawns and provide a safe haven for its citizens. Everlight is no different. The Bastion itself is made up of four circular districts. You have the core district at the innermost, then each district acts as a barrier, expanding out from the core.</span></p><p class=\"c1\"><span class=\"c0\">Where we are is officially called Luminara, positioned at the outermost layer. It gets its name from the radiant glow of the rising sun. This district is known for its agricultural areas and natural landscape.</span></p><p class=\"c1\"><span class=\"c0\">Nestled within the second layer is the Astrum. This district is home to most of the Bastion&rsquo;s citizens. All trading, marketplaces, day-to-day life activities happen here.</span></p><p class=\"c1\"><span class=\"c0\">Elysium, positioned deeper within Everlight, invokes a sense of paradise and tranquillity. This district is home to luxurious estates, creating an oasis within the bustling city. There are also many educational institutions and areas dedicated to scholarly pursuits here.</span></p><p class=\"c1\"><span class=\"c0\">Occupying the central core of Everlight, Citadel is the heart of the city and the last line of defence. This district houses the royal palace, military barracks and crucial government structures.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;That&rsquo;s&hellip; amazing. It sounds very well-structured, and with this many layers of protection, people in Everlight must have felt safe from the outside threats.&rdquo;</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Yes&hellip; perhaps.&rdquo; Cyrus commented, with a slight tone of doubt.</span></p><p class=\"c1\"><span class=\"c0\">As we draw nearer, the details of the walls come into sharper focus. The smooth, ivory facade rises with an almost ethereal quality, creating an aura of invincibility. The sunlight plays upon the walls, casting intricate shadows that dance along the surface, highlighting the craftsmanship and architectural prowess that went into this construction.</span></p><p class=\"c1\"><span class=\"c0\">The enormity of the walls become more apparent with each step, and I find myself dwarfed by their sheer size. The structure stands as a guardian, a sentinel watching over the realm with a stoic and timeless presence. The walls, seemingly endless, encircled the capital city, providing a sense of security that resonates with the magnitude of the responsibilities it holds.</span></p><p class=\"c1\"><span class=\"c0\">As we approach the gate, I can&rsquo;t help but feel a mixture of awe and respect. The gate, adorned with intricate carvings and symbols, hinted at the rich history and culture within. Cyrus shows the guards a piece of metal, and exchanges a few words with them. The guards let us through. We pass through the colossal entrance, and the scale of the city unfolds before my eyes.</span></p><p class=\"c1\"><span class=\"c0\">The bustling streets, vibrant markets, and towering structures within the walls paint a vivid picture of life in the Bastion. The contrast between the protective exterior and the lively interior speak of a haven that has learned to thrive while safeguarding its residents.</span></p><p class=\"c1\"><span class=\"c0\">For me, the sight of the giant white walls mark not only a physical boundary but also a symbol threshold. It is almost like my first true entry into a world unknown, filled with journeys and destinies ahead.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;First up, I will get you settled down at an inn. Then we&rsquo;ll head out to meet with a friend whom I mentioned previously. How does that sound?&rdquo; Cyrus suggested.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;Sure.&rdquo; I replied.</span></p><p class=\"c1\"><span class=\"c0\">Afterward, Cyrus passes down a few orders to his henchmen and they move along, separated from us. We two continue our walk on the bustling town, a place larger and livelier than I have ever seen. </span></p><p class=\"c1\"><span class=\"c0\">The streets teem with activity, merchants peddle their wares, children play in the squares, and the air hums with the harmonious sounds of a thriving community. It was a stark contrast to the desolation world out there.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus, familiar with the town, arranges accommodations for me. After a much-needed rest, during which we clean up the aftermath of the battle and change into fresh clothes, we reconvene in the lounge of our lodgings.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus is already waiting for me there. Once I approach him, he stands up and signals me it&rsquo;s time to go.</span></p><p class=\"c1\"><span class=\"c0\">&ldquo;We have agreed to meet at a bar once I return from this mission. Let&rsquo;s go. I&rsquo;ll introduce you to him. He will be very delighted to meet with you.&rdquo;</span></p>"
}]