[{
    "id":4,
    "title":"First Mission",
    "html":"<p class=\"c1\"><span class=\"c0\">After my trial, Cyrus offered to take me out for a celebratory meal. Unfortunately, Xenon couldn't join us since he had some pressing business to attend to. I couldn't help but wonder what it might be.</span></p><p class=\"c1\"><span class=\"c0\">During dinner, Cyrus mentioned that the kingdom would reach out to me in the next few days. When they do, it means they’ve arranged my accommodation and likely assessed me well enough to decide which future quests I’ll be assigned to.</span></p><p class=\"c1\"><span class=\"c0\">In the meantime, Cyrus suggested I take a tour around Dawnguard to get familiar with the area. He assured me he would cover my accommodation until the garrison sorted out my arrangements. There’s no words to describe how grateful I am to him right now. </span></p><p class=\"c1\"><span class=\"c0\">With some free time on my hands, I decided to head down to the marketplace tomorrow. Cyrus had also given me a small amount of money for food and necessities. Although I didn’t plan to spend it, feeling like I already owed him too much, I was curious about the types of goods they sold and how much they cost. It would be good to get an idea of the living expenses here.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next day]</span></p><p class=\"c1\"><span class=\"c0\">I’m walking down the familiar market, and it’s just as crowded as ever. People bustle about, and stalls line the streets, selling all sorts of items ranging from simple household goods like cooking utensils and furniture to a variety of foods. </span></p><p class=\"c1\"><span class=\"c0\">The food is particularly enticing. There are small snacks like fried meat skewers and sweet delicacies that look absolutely delicious. Restaurants offer more substantial meals, and as I browse the menus, I compare the prices with my budget. Cyrus gave me enough money to last a whole week, even if I eat three times a day. I know he’s a noble kid, but he’s incredibly generous. </span></p><p class=\"c1\"><span class=\"c0\">I come across a stall selling what appears to be fried chicken. The smell is irresistible, and the texture and size of the portions look top-notch. There's already a decently long line of customers. Maybe I can give it a try if they are willing to sell smaller portions?</span></p><p class=\"c1\"><span class=\"c0\">Just as I line up, a small dispute breaks out ahead of me, likely over someone cutting in line. The argument quickly escalates between two young guys, each insisting they were there first.</span></p><p class=\"c1\"><span class=\"c0\">Oh crap, they've taken it to the street. Fists are flying. As an off-duty sentinel, am I responsible for stopping something this silly? There's no guard nearby, so I guess it's up to me.</span></p><p class=\"c1\"><span class=\"c0\">I step in, wrapping my arms around one of the guys and pushing him away from the other.</span></p><p class=\"c1\"><span class=\"c0\">\"Stop - Stop!\" I said firmly.</span></p><p class=\"c1\"><span class=\"c0\">I quickly turn to the other guy, pushing him back as well to ensure there's a decent distance between them.</span></p><p class=\"c1\"><span class=\"c0\">\"Relax - Calm - Calm.\" I tried my best to express my message.</span></p><p class=\"c1\"><span class=\"c0\">Seriously, I don’t understand why people fight over such small things. Fortunately, they don’t seem very committed to the brawl. With me between them, they hold back. Clearly, they don't want to get into more trouble.</span></p><p class=\"c1\"><span class=\"c0\">\"Okay. We - talk.\"</span></p><p class=\"c1\"><span class=\"c0\">They both look at me in confusion— probably wondering why I am talking this way. I then spent a few minutes mediating the situation. It turns out there was a misunderstanding.</span></p><p class=\"c1\"><span class=\"c0\">One guy had originally been in line but stepped away to order a drink at the next stall, telling the person behind him he'd be back. However, that person ended up leaving. The other guy, unaware of this since he was looking elsewhere, thought he was next in line.</span></p><p class=\"c1\"><span class=\"c0\">After clearing up the confusion, both of them seem to calm down a bit.</span></p><p class=\"c1\"><span class=\"c0\">\"See? No - worry. No - need - fight.\" I said, giving them a reassuring smile.</span></p><p class=\"c1\"><span class=\"c0\">The dispute concludes with them shaking each other’s hand and walking away. Turns out I’m pretty good at playing the middle man too.</span></p><p class=\"c1\"><span class=\"c0\">“Hey, Vincas!”</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, Cyrus appears, looking urgent. Right away, he seems to be doing some weird gesture with his hands. It’s probably him applying his blessing so that we can talk to each other more comfortably.</span></p><p class=\"c1\"><span class=\"c0\">“What’s up?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“There’s a new mission,” Cyrus said, panting from his run.</span></p><p class=\"c1\"><span class=\"c0\">“Oh cool. What do you need to do?”</span></p><p class=\"c1\"><span class=\"c0\">“Us. There’s a new mission for both of us.” Cyrus clarified.</span></p><p class=\"c1\"><span class=\"c0\">“With me as well?!”</span></p><p class=\"c1\"><span class=\"c0\">“Hell yeah. You and me.”</span></p><p class=\"c1\"><span class=\"c0\">I look around and see that it’s only Cyrus here. “What about Xenon?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“He received a different mission.” Cyrus replied.</span></p><p class=\"c1\"><span class=\"c0\">“I see.” I nodded, feeling a mix of excitement and curiosity.</span></p><p class=\"c1\"><span class=\"c0\">“Do sentinels usually receive their first mission just a day after passing the trial?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“As far as I know, new sentinels usually receive their first mission at least a week after the trial. I’d say your inclusion means the kingdom has high expectations of you,” Cyrus answered.</span></p><p class=\"c1\"><span class=\"c0\">“Oh… Well then, I’d better not disappoint them.”</span></p><p class=\"c1\"><span class=\"c0\">After Cyrus catches his breath, we head to the garrison to check out the new mission. We arrive at the familiar desk, but this time, a different receptionist, a young lady with a friendly smile, is there to assist us. After a bit of verification on our medallions, she takes out the neatly bound document that outlines the mission details.</span></p><p class=\"c1\"><span class=\"c0\">The first mission is specifically tailored for me to get accustomed to the system. It’s relatively straightforward. Cyrus and I just need to assist a village located outside the protective wall, which has been dealing with frequent and terrifying hellspawn attacks.</span></p><p class=\"c1\"><span class=\"c0\">“In here, the mission says to investigate. If the reports say the villagers are getting attacked by hellspawns, what do we need to investigate?” I ask, curiosity piqued.</span></p><p class=\"c1\"><span class=\"c0\">“The report part is from the villagers’ perspective.” The receptionist explains patiently. “We need to send sentinels to confirm the accuracy of their report and then provide the necessary assistance.”</span></p><p class=\"c1\"><span class=\"c0\">\"Do people often fabricate reports of hellspawn attacks?\" I asked.</span></p><p class=\"c1\"><span class=\"c0\">\"Sometimes. With the kingdom's limited number of sentinels, we conduct thorough investigations before launching full-scale operations. It's also a practical way for new sentinels to gain experience.\" The receptionist explained.</span></p><p class=\"c1\"><span class=\"c0\">\"I see.\" I scan the document and spot a familiar name. \"Reynold Armstrong. Sir Armstrong is on this mission too?\"</span></p><p class=\"c1\"><span class=\"c0\">\"Yes, sometimes experienced sentinels like him join investigation missions to ensure safety and guide newcomers.\" The receptionist replied.</span></p><p class=\"c1\"><span class=\"c0\">\"So, is he considered quite experienced in dealing with hellspawns?\" I inquired.</span></p><p class=\"c1\"><span class=\"c0\">“...” The receptionist gave a silent response. “Isn't the sentinel's job dealing with hellspawns?” She calmly asked.</span></p><p class=\"c1\"><span class=\"c0\">“Ah… yes. Sorry. I meant if he was experienced in guiding new sentinels on their first few hellspawns eliminating missions.”</span></p><p class=\"c1\"><span class=\"c0\">\"Sir Armstrong is usually our go-to for guiding assignments because several sentinels who came out under his wings have been proven to produce excellent results later on.\"</span></p><p class=\"c1\"><span class=\"c0\">“Aren’t you lucky? Your first mission already has two veterans to guide you.” Cyrus grinned at me.</span></p><p class=\"c1\"><span class=\"c0\">“Hm… miss…” I ignored Cyrus and continued speaking to the receptionist. “This good sir here— is he also considered as an experienced sentinel?”</span></p><p class=\"c1\"><span class=\"c0\">“Sir Lightbearer has indeed had some experience in the field, but I would not dare to say that he is as qualified as Sir Armstrong in guiding new sentinels.” She politely answered.</span></p><p class=\"c1\"><span class=\"c0\">I smirk at Cyrus after hearing her response.</span></p><p class=\"c1\"><span class=\"c0\">\"The mission begins early tomorrow. Get a good rest tonight, and we'll meet at the inn in the morning.\" Cyrus changed the topic.</span></p><p class=\"c1\"><span class=\"c0\">Isn't this exciting? I got my first mission really quickly and now I get to learn from Sir Armstrong. During the trial, I could tell he's a really strong sentinel and he's holding back a lot. With his help, I think I can catch up to Cyrus and Xenon soon.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next day]</span></p><p class=\"c1\"><span class=\"c0\">\"Are you ready?\" Cyrus asked.</span></p><p class=\"c1\"><span class=\"c0\">\"One second,\" I replied.</span></p><p class=\"c1\"><span class=\"c0\">After double-checking all my clothes and tools, I believed I am ready to embark on my first mission.</span></p><p class=\"c1\"><span class=\"c0\">\"What are you bringing? Why are you carrying so many things?\" Cyrus queried.</span></p><p class=\"c1\"><span class=\"c0\">\"Hm? This— pouch, and this— dagger, and this— water...\" I began.</span></p><p class=\"c1\"><span class=\"c0\">\"You know we aren't going on a survival mission, right? It's an investigation, and the village isn't too far off. Things will be done within a few days.\"</span></p><p class=\"c1\"><span class=\"c0\">\"Don't I then need to survive during those few days?\" I retorted.</span></p><p class=\"c1\"><span class=\"c0\">\"The kingdom will provide all necessary rations for the entire journey forth and back,\" Cyrus reassured.</span></p><p class=\"c1\"><span class=\"c0\">\"Oh...\"</span></p><p class=\"c1\"><span class=\"c0\">We arrived at the meeting point, the western gate in the Luminara district. According to Cyrus, most missions for newcomers are typically on the west side of Dawnguard. Statistics show fewer hellspawns in this area, which explains why several small villages thrive outside the capital.</span></p><p class=\"c1\"><span class=\"c0\">Standing at the gate, waiting for us, is Reynold Armstrong, the same man who oversaw my trial. Beside him stands a few kingdom guards.</span></p><p class=\"c1\"><span class=\"c0\">“Sir Armstrong.” Cyrus greeted him.</span></p><p class=\"c1\"><span class=\"c0\">I follow Cyrus and greet the same way. It’s my first mission after all, and I want to start by picking up the basics. Being with Cyrus means I can easily communicate with others, which puts me at ease.</span></p><p class=\"c1\"><span class=\"c0\">“Cyrus Lightbearer, and Vincas.” Reynold acknowledged, his gaze shifting briefly to the guards who nodded in response. I mirrored their gesture.</span></p><p class=\"c1\"><span class=\"c0\">“Hm… do we need to introduce ourselves to…?” I asked Cyrus quietly.</span></p><p class=\"c1\"><span class=\"c0\">“The guards? No need. They prefer to keep a low profile” Cyrus explained.</span></p><p class=\"c1\"><span class=\"c0\">“I see.”</span></p><p class=\"c1\"><span class=\"c0\">We gather in a circle, signalling the start of the mission briefing.</span></p><p class=\"c1\"><span class=\"c0\">“I assume you’re all aware, but in case you aren’t— I’m Reynold Armstrong, and I’ll be leading the mission today. Our task is simple. We’re investigating a rural village to the west of Dawnguard. The villagers there reported a sighting of a large hellspawn and have requested the kingdom’s assistance in terminating the threat. Based on their description of the hellspawn, it’s believed to be a Ravager— a tier two hellspawn.”</span></p><p class=\"c1\"><span class=\"c0\">The kingdom guards murmur among themselves, clearly discussing the details of our target, but in an unusually relaxing mood.</span></p><p class=\"c1\"><span class=\"c0\">“Why do they seem so relieved to hear it’s a Ravager? What exactly is that?” I whispered to Cyrus.</span></p><p class=\"c1\"><span class=\"c0\">“It’s a…” Cyrus began, but Reynold cut in smoothly.</span></p><p class=\"c1\"><span class=\"c0\">“A large hellspawn, about the size of a bear but with stronger legs and a bigger mouth. Despite its bulk, it’s surprisingly fast and incredibly dangerous. One bite could tear you apart.” Reynold explained, answering my question directly.</span></p><p class=\"c1\"><span class=\"c0\">Our whispers had evidently carried too far.</span></p><p class=\"c1\"><span class=\"c0\">“Thank you, sir.” I replied, slightly embarrassed. “If it’s so dangerous, why do they seem… pleased?”</span></p><p class=\"c1\"><span class=\"c0\">“Because a Ravager is just that— a big brute. It relies on strength, not cunning. With our abilities, it should be straightforward to defeat.” Cyrus reassured me.</span></p><p class=\"c1\"><span class=\"c0\">“Are all tier two hellspawns similar? I’m not familiar with the ranking.” I admitted.</span></p><p class=\"c1\"><span class=\"c0\">“No, they vary greatly. Factors like their abilities, the environment, and the mission’s objectives make each encounter unique. Luckily for us, this one leans towards the easier side.” Reynold added, offering clarity.</span></p><p class=\"c1\"><span class=\"c0\">“Oh…” I listened intently, absorbing this valuable lesson from a veteran.</span></p><p class=\"c1\"><span class=\"c0\">“Hellspawns are classified into 5 tiers. The higher the tier, the stronger and more dangerous they are to mankind. The most common ones we encounter are tier one, known as Scouts. tier two hellspawns, like the Ravager we’re dealing with, are larger and more robust versions of tier one. tier three hellspawns possess special abilities such as fire-breathing or freezing. tier four hellspawns show signs of intelligence, considered evolved from tier three,” Reynold explained, pausing briefly before continuing.</span></p><p class=\"c1\"><span class=\"c0\">“Lastly, there’s tier five— the rarest and most dangerous. They haven’t been seen in decades and are capable of catastrophic feats like controlling weather and causing natural disasters. Just one could potentially devastate an entire kingdom, and there are records of only 6 ever documented.”</span></p><p class=\"c1\"><span class=\"c0\">I gulped at the gravity of his words, the enormity of the threat sinking in.</span></p><p class=\"c1\"><span class=\"c0\">“If they’re so powerful, then why haven’t they wiped out all of us yet?” I asked, my voice tinged with concern.</span></p><p class=\"c1\"><span class=\"c0\">“Because we also have powerful sentinels who can stand on equal ground with these hellspawns. Over centuries of war with the hellspawns, these tier five entities must have realised that wiping us out isn’t an easy task. That’s likely why they haven’t appeared in a very long time, which is… not a good sign.” Reynold explained solemnly.</span></p><p class=\"c1\"><span class=\"c0\">“Not a good sign?” I queried, my brow furrowing with concern.</span></p><p class=\"c1\"><span class=\"c0\">“Because we don’t know what they’ve been preparing. All our records of them are decades old. Some even stretch back centuries. It’s not that we lack powerful sentinels capable of facing them, but the unknown is always the biggest threat to the kingdom.” Reynold replied, his tone grave and measured.</span></p><p class=\"c1\"><span class=\"c0\">“I see.” </span></p><p class=\"c1\"><span class=\"c0\">It makes sense, in a terrifying way.</span></p><p class=\"c1\"><span class=\"c0\">The conversation continues, and under Sir Reynold’s guidance, I learn a great deal about hellspawns. Beyond the hellspawn identification, the most crucial lesson was about the tier five hellspawns— referred to as the named ones.</span></p><p class=\"c1\"><span class=\"c0\">The first to appear was End, the Shadow Emperor and the Ruler of Death. At the time, one of the seven kingdoms, Korin, stood as the most powerful kingdom, renowned for its battle-hardened warriors. Then, out of the blue, this monstrous being emerged one day, plunging the kingdom into ruin, claiming millions of lives and annihilating all the sentinels there. Legend has it that he could summon an army of undead from thin air, an unstoppable force that relentlessly reformed no matter how many were slain.</span></p><p class=\"c1\"><span>The second one to appear was named Chaos, the World Devourer. It emerged in the kingdom of the Aelves, Mitha, and nearly brought the entire realm to ruin. At the time, the queen of Mitha, unable to defeat Chaos, sacrificed herself to seal this monster away in the deepest reaches of the </span><span>aelven</span><span class=\"c0\">&nbsp;kingdom. Thus, Chaos remains imprisoned to this day, a looming threat in the shadows of Mitha's history.</span></p><p class=\"c1\"><span class=\"c0\">The third one, based on ancient records that might have even predated both End and Chaos, was known only as a terrifying entity that exerted control over countless mortals. Unlike the other tier five hellspawns, it did not directly cause widespread death or destruction. Since the proof of its existence was lost to history, it came to be referred to as Nameless, the Oblivion.</span></p><p class=\"c1\"><span>The fourth one appeared in </span><span>Dragnoel</span><span>, the kingdom of the D</span><span>ragonians</span><span>, laying waste to their capital city of </span><span>Dragnoel</span><span>&nbsp;and leaving hundreds of thousands dead. It was recorded to have a powerful weather controlling ability that completely countered the Dragonians’ aerial skills. Eventually, it met its end at the hands of the king of </span><span>Dragnoel</span><span class=\"c0\">, disappearing thereafter. The Dragonians named it Maelstrom, the Raging Tempest.</span></p><p class=\"c1\"><span class=\"c0\">The fifth entity emerged and seized control of a grand noble castle in Valoria, decimating all who dwelled within. Despite the kingdom dispatching countless sentinels and tens of thousands of guards to reclaim it, none returned. The sole survivor, upon his return, spoke of heaps of desiccated corpses, drained of blood as if by some unholy force. Thus, this malevolent being came to be known as Nocturne, the Blood Lord. As if feeling bothered by the consistent raids from the kingdom, the entity was believed to have used illusion and hid the castle away for decades.</span></p><p class=\"c1\"><span>The final entity emerged in </span><span>Ferocus</span><span class=\"c0\">, the kingdom of the Asurians, south of ours. As if to mock the flame-bearing blessings from one of the four main clans— the Flame Clan, it sought out the strongest flame users, burning them alive in a sinister blue blaze. That same fire was recorded to continue burning for years. This hellspawn earned the name Pyre, the Ghost Flame, as it once haunted the land, striking fear into the hearts of Asurians.</span></p><p class=\"c1\"><span class=\"c0\">I feel that I've at least grasped how terrifying these named ones are, and like everyone else, I hope they’d never appear in front of me. Yet, as a sentinel, it’s also expected of us to eventually be able to truly kill these monstrous beings and bring peace to the land.</span></p><p class=\"c1\"><span class=\"c0\">\"Stop!\" Cyrus suddenly said, holding me back.</span></p><p class=\"c1\"><span class=\"c0\">It is then that I notice the hand signal from Reynold at the front, instructing everyone to stay still.</span></p><p class=\"c1\"><span class=\"c0\">Is it the Ravager? Have we already encountered it?</span></p><p class=\"c1\"><span class=\"c0\">After a tense moment of nothing happening, Reynold signals the team to move forward.</span></p><p class=\"c1\"><span class=\"c0\">Ahead, a broken carriage lies across the path, its wheels shattered and goods scattered. Reynold must have suspected there could be hellspawns lurking nearby. Once he deems it safe, he moves in to investigate the damaged carriage more closely. The air feels thick with anticipation as we cautiously follow, every rustle and creak heightening our senses.</span></p><p class=\"c1\"><span class=\"c0\">There are a few traces of blood and several bodies scattered around. It looks like they died many days ago. The scene is heartbreaking— a family, it seems, with the bodies of a man, a woman, a child, and an elderly woman lying lifeless on the ground.</span></p><p class=\"c1\"><span class=\"c0\">The group decides to move on, the urgency of our mission pulling us away from the tragic sight.</span></p><p class=\"c1\"><span class=\"c0\">“Shouldn’t we bury them first?” I asked Cyrus, my voice heavy with the weight of what we’d seen.</span></p><p class=\"c1\"><span class=\"c0\">“We can do that later.” He replied, his tone resolute. “Our priority is to keep moving forward and rescue any others who might still be alive.”</span></p><p class=\"c1\"><span class=\"c0\">“I see.” I said, understanding the logic even as my heart ached.</span></p><p class=\"c1\"><span class=\"c0\">As bad as I feel leaving them there, I know we can’t afford to waste time if there’s potential danger up ahead.</span></p><p class=\"c1\"><span class=\"c0\">“Sir Reynold, may I ask something?” I said.</span></p><p class=\"c1\"><span class=\"c0\">“Go ahead.” He replied, his eyes still scanning the surroundings for any sign of danger.</span></p><p class=\"c1\"><span class=\"c0\">“If it’s so dangerous outside Dawnguard, why do people still live here? Can’t we bring them all back within the walls?”</span></p><p class=\"c1\"><span class=\"c0\">“We’ve been trying.” He sighed. “But some prefer the countryside despite the risks. It used to be safer in the western area of Valoria, but for some strange reason, hellspawns started appearing more frequently about a year ago.”</span></p><p class=\"c1\"><span class=\"c0\">“A year ago…” I echoed, a chill running down my spine. Isn’t that the same time I first arrived in this world? It can’t be just a coincidence, right?</span></p><p class=\"c1\"><span class=\"c0\">“Though we anticipated a situation like this.” Reynold continued, his tone steady. “...because further to the west, the centre of this continent has already been fully swarmed by hellspawns. It has always been a mystery to us that the hellspawns would split up their numbers to the north and south instead of approaching us directly from our west.”</span></p><p class=\"c1\"><span class=\"c0\">“I see.” I replied, trying to keep my voice calm.</span></p><p class=\"c1\"><span class=\"c0\">“Perhaps something had happened at the centre.” Reynold said, gravely.</span></p><p class=\"c1\"><span class=\"c0\">As we pressed forward, I couldn’t shake the unsettling feeling that my arrival in this world might be connected to the increased danger we now faced.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, we all hear cries for help echoing ahead. \"Up ahead.\" Reynold said, motioning for us to proceed quickly.</span></p><p class=\"c1\"><span class=\"c0\">As we approach, we witness a large bear-like hellspawn standing upright, massacring the villagers. It must be the Ravager.</span></p><p class=\"c1\"><span class=\"c0\">The villagers, armed with makeshift weapons like sharp sticks, bravely try to defend themselves. However, their weapons prove ineffective against the hellspawn's tough hide, shattering upon impact.</span></p><p class=\"c1\"><span class=\"c0\">When the hellspawn catches one of them, it easily crushes the villager with its strength. The brutal death further causes a commotion among the other survivors.</span></p><p class=\"c1\"><span class=\"c0\">I move to intervene, but Reynold stops me with a hand on my shoulder. I look at him, puzzled by his action. Why is he stopping me?!</span></p><p class=\"c1\"><span class=\"c0\">\"Not yet. There might be other hellspawns hiding around.\" Reynold whispered.</span></p><p class=\"c1\"><span class=\"c0\">Memories flashed back to when I first met Cyrus and Xenon, facing a similar situation with one hellspawn distracting them while another lay in wait to ambush. Reynold's caution indeed made sense.</span></p><p class=\"c1\"><span class=\"c0\">It pained me deeply to watch the villagers falling one by one. Each scream of pain pierced my heart, and the sight of death stained the air.</span></p><p class=\"c1\"><span class=\"c0\">Glancing at Reynold, his grim determination was evident as he shook his head, signalling restraint. Cyrus, too, clenched his fists tightly, his gaze turned away but filled with the same frustration and helplessness I felt.</span></p><p class=\"c1\"><span class=\"c0\">\"This isn't right.\" I murmured, overwhelmed by the chaos and the desperate fight for survival unfolding before us.</span></p><p class=\"c1\"><span class=\"c0\">No matter if it's an ambush or not, I can't just sit here like ducks doing nothing while people are dying right in front of me. I just… can’t.</span></p><p class=\"c1\"><span class=\"c0\">I will go in, even if another hellspawn appears and kills me, it is still fine. At least, I can save as many as I can, like the promise I made back then in Woodplain.</span></p><p class=\"c1\"><span class=\"c0\">Reynold tries to stop me as I move forward, but I ignore his gesture and leap into action. The hellspawn is caught off guard as I swing my black blade with swift precision.</span></p><p class=\"c1\"><span class=\"c0\">The blade slices through its arm, causing it to recoil with a roar of agony. Yet, the beast's response is swift and ominous— its body begins to swell, growing up to three or four times taller than me.</span></p><p class=\"c1\"><span class=\"c0\">With adrenaline pumping, I stand firm, blade in hand, facing the towering hellspawn.</span></p><p class=\"c1\"><span class=\"c0\">The hellspawn charges toward me, but just as it lunges forward, a spiritual spear flies across and pierces its thick neck— Cyrus has joined the fray. The spear strikes deep, but the wound closes almost instantly, showing the creature's formidable resilience. Guards rushes forward, encircling the hellspawn while Reynold summons a shimmering golden barrier.</span></p><p class=\"c1\"><span class=\"c0\">With the immediate threat contained, I turn to check on the nearest villager. He lays on the ground, blood staining his clothes. His chest bears a deep, gaping wound.</span></p><p class=\"c1\"><span class=\"c0\">\"You'll be okay.\" I murmured, trying to comfort the wounded villager.</span></p><p class=\"c1\"><span class=\"c0\">His words are laboured, interrupted by the steady flow of blood. I grip his hand, but his strength fades, slipping away despite my efforts. It seems that I have arrived too late.</span></p><p class=\"c1\"><span class=\"c0\">Turning back to Reynold, Cyrus, and the guards, I see them relentlessly attacking the Ravager. Despite their efforts, the hellspawn shows little sign of weariness. Each strike from Cyrus and the guards' spears seems futile as the wounds close almost immediately, revealing its formidable regenerative ability. Strangely, however, one of its arms remains damaged, refusing to regenerate.</span></p><p class=\"c1\"><span class=\"c0\">But the strangest part is that the arm still hasn't regenerated. It reminds me of the stone-like hellspawn from before. Perhaps my black blade has the ability to disrupt their regeneration.</span></p><p class=\"c1\"><span class=\"c0\">Reynold, lacking offensive capabilities, uses his barrier skillfully to absorb the hellspawn's attacks, diverting its attention from us. The hellspawn claws and slashes relentlessly, but none of its blows penetrate the golden shield.</span></p><p class=\"c1\"><span>Seeing an opening, I </span><span>dart</span><span>&nbsp;forward and swiftly </span><span>severe</span><span class=\"c0\">&nbsp;one of its legs. As the hellspawn staggers, Cyrus seizes the opportunity, summoning a barrage of spears that he hurls at its head.</span></p><p class=\"c1\"><span class=\"c0\">Once its head is gone, the guards, sensing the lingering threat of its regeneration, join in, thrusting their spears deep into the hellspawn's body. Reynold leaps onto the creature, using his barrier to deliver a crushing blow that further subdues it.</span></p><p class=\"c1\"><span class=\"c0\">After a tense moment, the hellspawn dissolves into a mysterious black essence that flows towards me. Reynold and the guards exchange puzzled glances, but I can only respond with a perplexed shake of my head as if I’m also not sure about this interaction.</span></p><p class=\"c1\"><span class=\"c0\">Yet, this is no time to dwell on mysteries. Reynold approaches me with a deeply concerned expression on his face.</span></p><p class=\"c1\"><span class=\"c0\">“That was reckless.” Reynold spoke calmly, yet with a heavy tone.</span></p><p class=\"c1\"><span class=\"c0\">“I couldn’t just stand by and watch people being killed.” I argued.</span></p><p class=\"c1\"><span class=\"c0\">“I warned you there might be more hellspawns nearby. Your actions could have endangered us all.”</span></p><p class=\"c1\"><span class=\"c0\">“Endangered? We’re here to save lives, not cower behind walls. If we’re too afraid to face the danger, why bother coming out here at all?”</span></p><p class=\"c1\"><span class=\"c0\">“Hey.” Cyrus stepped in, pulling me back.</span></p><p class=\"c1\"><span class=\"c0\">I notice Reynold's face darkening with anger.</span></p><p class=\"c1\"><span class=\"c0\">“What you did could have gotten not just the villagers, but all of us killed.” Reynold's voice was stern and serious.</span></p><p class=\"c1\"><span class=\"c0\">But I'm far from happy with Reynold's rebuke. </span></p><p class=\"c1\"><span class=\"c0\">\"Firstly, there was no ambush, so your analysis was wrong. Secondly, people are dying.” I argued. “Why can't you understand? They're dying right in front of us. We're sentinels. Our duty is to protect people, and yet we failed— miserably. All of them died because of you.\"</span></p><p class=\"c1\"><span class=\"c0\">\"They died because they chose to live here.\" Reynold countered firmly.</span></p><p class=\"c1\"><span class=\"c0\">I pause, recalling what I was told earlier— that the kingdom had offered to relocate them, but they had stubbornly chosen to remain outside the safety of the walls despite the risks.</span></p><p class=\"c1\"><span class=\"c0\">\"But still, we...\" I started, but Reynold cut me off.</span></p><p class=\"c1\"><span class=\"c0\">\"That's enough for today. We're returning to Dawnguard for the report.\" He said firmly.</span></p><p class=\"c1\"><span class=\"c0\">\"Now?\" I asked, incredulous.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes, now.\" He insisted.</span></p><p class=\"c1\"><span class=\"c0\">\"Can't we at least give the villagers a proper burial first? We didn't even do so for the family down the road earlier.\" I pleaded.</span></p><p class=\"c1\"><span class=\"c0\">\"That would take too much of our time. We don't know if elsewhere needs more manpower.\" Reynold explained curtly.</span></p><p class=\"c1\"><span class=\"c0\">\"Then you guys can go back. I'll stay here a little bit longer.\" I decided.</span></p><p class=\"c1\"><span class=\"c0\">Reynold sighs in resignation. \"Fine. Be quick.\"</span></p><p class=\"c1\"><span class=\"c0\">I turn towards Cyrus, seeking support. \"You... will help me, right?\"</span></p><p class=\"c1\"><span class=\"c0\">Cyrus hesitates before awkwardly replying. \"Well... yeah, I guess.\"</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[A few hours later]</span></p><p class=\"c1\"><span class=\"c0\">We finally finished burying all the bodies. With limited resources, all we can do is place a boulder on each grave. We stand in silence for a moment, paying our respects.</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, a group of people arrives. They look like kingdom guards, but slightly different from those who were with us earlier. This group of guards appear to have more agile armour as if it’s for the purpose of moving around easier.</span></p><p class=\"c1\"><span class=\"c0\">Behind them, another group of men carry large bags. One of the guards approaches Cyrus and me.</span></p><p class=\"c1\"><span class=\"c0\">\"I believe you two are the sentinels who were with Sir Armstrong on the mission today?\" He asked.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I both nod.</span></p><p class=\"c1\"><span class=\"c0\">\"If you could please present your medallions for verification.\" He requested, double-checking.</span></p><p class=\"c1\"><span class=\"c0\">We show him our medallions.</span></p><p class=\"c1\"><span class=\"c0\">While waiting for him to verify the medallions, I realise that the other people are… looting? They seem to break into every house and come back out with fully stacked bags of goods.</span></p><p class=\"c1\"><span class=\"c0\">“Hang on. What is happening?” I asked the guard.</span></p><p class=\"c1\"><span class=\"c0\">“What do you mean? They’re simply doing their jobs.” The guard replied.</span></p><p class=\"c1\"><span class=\"c0\">“Their jobs? Aren’t you guys just stealing?”</span></p><p class=\"c1\"><span class=\"c0\">After the guard hears it, he chuckles. “Stealing? From what? The dead?” He continued.</span></p><p class=\"c1\"><span>Is this guy serious? Did he really just laugh and make it a joke when people died right here not long ago? Even </span><span>worse so</span><span class=\"c0\">, when their belongings are taken away instead of being left here with their graves?</span></p><p class=\"c1\"><span class=\"c0\">“Yes. The Dead. Isn’t this disrespecting to them?” I said.</span></p><p class=\"c1\"><span class=\"c0\">“Disrespect?” Suddenly, the guard retorted. “Kid, these folks had it coming. They chose not to join us, opting for freedom, but as we all know, freedom comes at a price.” </span></p><p class=\"c1\"><span class=\"c0\">“What do you mean? Why wouldn’t they have freedom in Dawnguard?” I pressed.</span></p><p class=\"c1\"><span class=\"c0\">“When outsiders come to Dawnguard, they’re treated like commoners and must pay taxes,” Cyrus explained. “Since they often lack money, their only option is unpaid labour, which they liken to slavery.”</span></p><p class=\"c1\"><span class=\"c0\">“I had no idea. Why wasn’t this enforced on me?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“You were with me and Xenon. We're both nobles, so the guards didn’t see the need to verify your identity. Plus, becoming a sentinel means you'll never be treated like a commoner.” Cyrus clarified.</span></p><p class=\"c1\"><span class=\"c0\">“What's all this talk about taxes, slavery, and commoners in Dawnguard?” I questioned with a hint of disbelief.</span></p><p class=\"c1\"><span class=\"c0\">“Hey, that's enough.” the guard responded sternly, clearly displeased with my criticism of the kingdom. “These people chose to stay out here, hoarding their resources instead of contributing to the kingdom. It’s not our job to protect them or invest resources in their defence.”</span></p><p class=\"c1\"><span class=\"c0\">“Why does that matter? We’re talking about lives.” I argued passionately.</span></p><p class=\"c1\"><span class=\"c0\">“And when sentinels die trying to save them, who takes responsibility?” the guard countered sharply.</span></p><p class=\"c1\"><span class=\"c0\">“Sentinels are supposed to protect people. If they fear death, why take up this role?”</span></p><p class=\"c1\"><span class=\"c0\">“Isn’t that a contradiction? You say lives matter, yet you expect sentinels to sacrifice their lives for others. Who are you to decide who lives and dies?” The guard shot back.</span></p><p class=\"c1\"><span>“Isn’t the kingdom already making that decision with its current system?” I </span><span>challenged</span><span class=\"c0\">. “Who are we to determine who will live and who will die?”</span></p><p class=\"c1\"><span>Cyrus</span><span class=\"c0\">&nbsp;places his hand on my shoulder as a gentle reminder to let it go. After today's ordeal, exhaustion weighs heavy on me. I understand the kingdom's intricate workings now, and dwelling on it won't change a thing. So, I swallow my grief and let it pass, for now.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I walk to the side, watching the guards doing their dirty work.</span></p><p class=\"c1\"><span class=\"c0\">“Why didn’t you and Xenon tell me anything about this?” I asked.</span></p><p class=\"c1\"><span class=\"c0\">“We… thought that you wouldn’t be ready for this.” Cyrus replied with a sigh.</span></p><p class=\"c1\"><span class=\"c0\">“So you both were fully aware of this corrupted way of doing things?” I pressed further, my voice tinged with disappointment.</span></p><p class=\"c1\"><span class=\"c0\">“Yes.” Cyrus admitted reluctantly. “We both didn’t like it, and still don’t, but it’s how Valoria operates and survives until now.”</span></p><p class=\"c1\"><span class=\"c0\">“Until now… Don’t tell me that…” I trailed off, a sinking feeling settling in.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus nods solemnly, understanding the unspoken question.</span></p><p class=\"c1\"><span class=\"c0\">“The purpose of these missions wasn’t really about saving the people. It’s always about getting more resources for the kingdom.” Cyrus explained, his voice tinged with resignation.</span></p><p class=\"c1\"><span class=\"c0\">“Then all of the delaying and concern for ambush were just excuses to wait for the people to die out?” I raised my tone, frustration bubbling up.</span></p><p class=\"c1\"><span class=\"c0\">“Ambushes were real. There have been cases where groups of sentinels and kingdom guards lost many men to surprise attacks from hellspawns not mentioned in the original reports.” Cyrus tried to explain.</span></p><p class=\"c1\"><span class=\"c0\">“But it feels like it was just an excuse when there really wasn’t another hellspawn at all and these people here got slaughtered.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">“I don’t know. Maybe, but… whatever it was, it’s done now.” </span></p><p class=\"c1\"><span class=\"c0\">“But still…” I’m at a loss of words to express my frustration.</span></p><p class=\"c1\"><span class=\"c0\">“Let’s just head back home and take a break. Reynold will probably report to the higher-ups, and you might be suspended for a few days for disobeying orders.” </span></p><p class=\"c1\"><span class=\"c0\">“Seriously?”</span></p><p class=\"c1\"><span class=\"c0\">“It can’t be helped. Try not to make too much trouble out of it, otherwise, they might take away your medallion and exile you.” Cyrus warned, his tone sombre.</span></p><p class=\"c1\"><span class=\"c0\">I pause, taking a deep breath to calm myself. “Alright. Let’s go home.”</span></p><p class=\"c1\"><span>We make our way back to the garrison for the report. As expected, I </span><span>receive</span><span class=\"c0\">&nbsp;a warning for my actions and am suspended for a week. In the meantime, arrangements have been made for me to settle into new accommodations, and I’m advised to use the time to adjust to the change.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I part ways with heavy hearts.</span></p><p class=\"c1\"><span class=\"c0\">I follow the instructions on a piece of paper and navigate my way to the new accommodation, situated in the second layer of Dawnguard, Astrum. I guess it’s also the kingdom’s way of saying that I am now a sentinel so I no longer need to stay in the commoner district.</span></p><p class=\"c1\"><span class=\"c0\">Arriving at nightfall, I complete the necessary formalities and am shown to my room. Exhausted from the day’s events, I decided to freshen up. As a sentinel, I’m entitled to free meals, so I request some snacks before retiring for the night.</span></p><p class=\"c1\"><span class=\"c0\">In the quiet of my room, thoughts swirl in my mind. Can I continue in this role, following orders that may ignore innocent lives? It weighs heavily on me, questioning the true purpose of my duty and the sacrifices it may demand.</span></p><p class=\"c1\"><span class=\"c0\">Can I really do it?</span></p><p class=\"c1\"><span class=\"c0\">As I pondered over these questions, the weight of my previous life's promises and failures bore down on me. Should I merely conform to this new world's systems and repeat the patterns of my past life? Wouldn't that negate the very reason I ended up here?</span></p><p class=\"c2\"><span class=\"c0\">Also… What about my promise to Woodplain?</span></p><p class=\"c1\"><span class=\"c0\">Memories of Baldon, Annie, and my unfulfilled promise to Woodplain still haunts me. I couldn't save them. Wasn’t that the sole reason that I would continue moving forward and saving as many as those who I could not save?</span></p><p class=\"c1\"><span class=\"c0\">Why did I even doubt myself? </span></p><p class=\"c1\"><span class=\"c0\">If faced with a similar situation again, I know without hesitation that I would act the same, driven by my commitment to uphold that promise.</span></p><p class=\"c1\"><span class=\"c0\">I was not wrong today.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next morning]</span></p><p class=\"c1\"><span class=\"c0\">The sound of birds chirping mingles with the lively chatter of people, rousing me from sleep. I slowly rise, feeling sore and tired from yesterday's mission. Making my way to the restroom, I start to wash my face.</span></p><p class=\"c1\"><span class=\"c0\">Hm? This seems familiar...</span></p><p class=\"c1\"><span class=\"c0\">I pause, taking a deep breath, then splash water on my face and dry it with a towel. When I open my eyes again… </span></p><p class=\"c1\"><span class=\"c0\">Wait a second...</span></p><p class=\"c1\"><span class=\"c0\">Why am I still at the old accommodation?</span></p><p class=\"c1\"><span class=\"c0\">What?!</span></p><p class=\"c1\"><span class=\"c0\">Hold on. I distinctly remember finding my way to the new accommodation last night. Was I so tired that I started hallucinating?</span></p><p class=\"c1\"><span class=\"c0\">I quickly dress and head downstairs, only to confirm that I'm indeed at my old accommodation at Luminara.</span></p><p class=\"c1\"><span class=\"c0\">I... don't understand. </span></p><p class=\"c1\"><span class=\"c0\">Did someone secretly transport me back here while I was sleeping? Or did the kingdom suddenly decide to punish me more severely and take away my accommodation? </span></p><p class=\"c1\"><span class=\"c0\">Can they actually do that? </span></p><p class=\"c1\"><span class=\"c0\">Well, why am I even questioning it? Of course, they can.</span></p><p class=\"c1\"><span class=\"c0\">Anyway, I'll see if I can meet up with Cyrus later this week and ask him about the details. Since I don't have the new accommodation anymore, I probably won't get the free meals either. I'll just head to the market and use the money Cyrus gave me to grab some food.</span></p><p class=\"c1\"><span class=\"c0\">Walking down the familiar market again, it's still as crowded as ever. I know exactly what I want this time— fried chicken. Last time, I was busy resolving a conflict between two guys and before I could grab a bite, Cyrus dragged me to the garrison for our first mission. This time, though, I have the whole week free to enjoy the food here.</span></p><p class=\"c1\"><span class=\"c0\">Ah... the smell is just irresistible. The long line in front of the store tells me how popular they are with the locals. Here I am once again, lining up for the fried chicken.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Amidst the bustling market, a sudden commotion breaks out behind me, drawing my attention. Turning around, I see the familiar faces of two men who had clashed over queuing just days ago. It seems they've found themselves at odds once more.</span></p><p class=\"c1\"><span class=\"c0\">Come on, guys… </span></p><p class=\"c1\"><span class=\"c0\">I approach them calmly, hoping to defuse the situation before it escalates into a public spectacle.</span></p><p class=\"c1\"><span class=\"c0\">\"Hey - Hey - What - is - wrong?\" I interjected, trying to understand the cause of their disagreement. </span></p><p class=\"c1\"><span class=\"c0\">They both glance at me, their expressions a mix of surprise and frustration.</span></p><p class=\"c1\"><span class=\"c0\">\"Two - days - ago - no - fight. You - and - you - happy. Why - fight - again?\" I continued, gesturing to the earlier incident.</span></p><p class=\"c1\"><span class=\"c0\">\"What are you talk[][][] [][][][][], [][][][]?\" one of them retorted, his brow furrowed in disbelief.</span></p><p class=\"c1\"><span class=\"c0\">\"I - talk - two - days - ago.\" I persisted, puzzled by their sudden amnesia. \"You - and - you - here - fighting - but - later - calm down - and - no - fight.\"</span></p><p class=\"c1\"><span class=\"c0\">\"You are [][][][][], [][][].\" he replied dismissively. \"I don’t know [][][][] you [][][] talk[][][] [][][][][]. I’[][] never [][][][] you [][][][][][].\"</span></p><p class=\"c1\"><span class=\"c0\">Perplexed, I turn to the other man, seeking clarity. \"Is - he- okay? He - not - remember - our talk? It is - only - two - days - ago.\"</span></p><p class=\"c1\"><span class=\"c0\">His response is, however, equally bewildering. \"Stop mak[][][] a [][][][][] to [][][][][] for him. I don't know you, and I [][][][][][][][][] don't need your help.\"</span></p><p class=\"c1\"><span class=\"c0\">Their adamant denial leaves me baffled.</span></p><p class=\"c1\"><span class=\"c0\">What is happening here? Why are they pretending that they don’t know me? Is my face really that forgettable?</span></p><p class=\"c1\"><span class=\"c0\">Just when I’m about to be lost in my own thoughts, a familiar figure sprinted toward me. It was Cyrus, out of breath from his long run.</span></p><p class=\"c1\"><span class=\"c0\">\"Ah, not again...\" He managed between breaths.</span></p><p class=\"c1\"><span class=\"c0\">\"Are you okay?\" I asked, concerned.</span></p><p class=\"c1\"><span class=\"c0\">\"Alright, you might not believe me at first, but I'm certain I've gone back in time,\" Cyrus blurted out.</span></p><p class=\"c1\"><span class=\"c0\">\"...\" I stood in silence, trying to process his words.</span></p><p class=\"c1\"><span class=\"c0\">\"I know it sounds unbelievable, but it's true. This isn't even the first time. After our first mission together, I was supposed to return to the present, but somehow I ended up back here, two days ago, today...\" Cyrus struggled to explain.</span></p><p class=\"c1\"><span class=\"c0\">\"Hold on, Cyrus. I think I understand,\" I interrupted.</span></p><p class=\"c1\"><span class=\"c0\">\"You know?\" Cyrus looked at me with wide eyes.</span></p><p class=\"c1\"><span class=\"c0\">\"I believe it happened to me too.\" I replied.</span></p><p class=\"c1\"><span class=\"c0\">\"No way, so we really went back in time.\" Cyrus exclaimed.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes. At first, I thought it was strange that I ended up in a different place this morning and all the events around me seemed familiar, but after your confirmation, I can see what happened now.\" I explained.</span></p><p class=\"c1\"><span class=\"c0\">\"I'm glad that I'm not the only one. Otherwise, I would look like an idiot saying strange things.\" Cyrus chuckled.</span></p><p class=\"c1\"><span class=\"c0\">No wonder why everything that happened today seemed so strange to me. I can see why those guys in the market didn't recognise me. It’s because they had never seen me yet.</span></p><p class=\"c1\"><span class=\"c0\">I didn’t know why this happened or how it was triggered, but honestly, since arriving in this world, is there anything that isn’t abnormal so far?</span></p><p class=\"c1\"><span class=\"c0\">\"Wait, but did you say… again?\" It suddenly dawned on me.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes. It happened to me twice before. Woke up one day, then found myself back a day. I always thought it was just me.\" Cyrus explained.</span></p><p class=\"c1\"><span class=\"c0\">\"And now it's happening to me too. Looks like you're not alone in this anymore.\" I said with a faint smile.</span></p><p class=\"c1\"><span class=\"c0\">\"Hey, Vincas.\"</span></p><p class=\"c1\"><span class=\"c0\">\"Yeah?\"</span></p><p class=\"c1\"><span class=\"c0\">\"You know what we should do now?\"</span></p><p class=\"c1\"><span class=\"c0\">I paused, realising what Cyrus was suggesting.</span></p><p class=\"c1\"><span class=\"c0\">\"Don't tell me you want to return to the village?\"</span></p><p class=\"c1\"><span class=\"c0\">\"Exactly. If our mission won't save those people, why not prioritise their rescue?\" Cyrus proposed.</span></p><p class=\"c1\"><span class=\"c0\">\"Isn't that too risky? Reynold classified a Ravager as a tier two hellspawn. How can we handle it with just the two of us?\" I questioned.</span></p><p class=\"c1\"><span class=\"c0\">\"We can do it. You stopped its regeneration before. We know its weaknesses now. We'll handle it better this time.\" Cyrus assured.</span></p><p class=\"c1\"><span class=\"c0\">\"Okay. And what about the villagers?\"</span></p><p class=\"c1\"><span class=\"c0\">\"We'll explain we're passing travellers lending a hand. If we join forces, they'll fight alongside us.\" </span></p><p class=\"c1\"><span class=\"c0\">\"Wouldn't that put them in danger?\"</span></p><p class=\"c1\"><span class=\"c0\">\"It's their village. They have to defend it too. We are not going to stay there, but if we show them how we fight against the hellspawns, they can learn and be better prepared next time.\"</span></p><p class=\"c1\"><span class=\"c0\">\"I see.\"</span></p><p class=\"c1\"><span class=\"c0\">\"What do you say? Let’s go?\"</span></p><p class=\"c1\"><span class=\"c0\">I nod in agreement, and we waste no time hurrying back to the garrison, knowing my first mission awaited today. Without waiting until morning, we swiftly pack our belongings and set off to aid the village.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus's familiarity with the guards, coupled with our sentinel medallions, expedit our exit from the city without complication. Having travelled to the village previously, we navigate swiftly to our destination.</span></p><p class=\"c1\"><span class=\"c0\">Along the route, I recall an earlier incident on the road and decide to mark a warning sign ahead, alerting an unfortunate family of impending danger.</span></p><p class=\"c1\"><span class=\"c0\">We reach the village to meet the curious stares from its inhabitants, who seem unaccustomed to visitors. Cyrus swiftly steps in, explaining that we are travellers from a neighbouring village en route to join the sentinels at Dawnguard. </span></p><p class=\"c1\"><span class=\"c0\">He then hints at the signs of recent hellspawn activity and the exodus of villagers, prompting our visit to offer assistance.</span></p><p class=\"c1\"><span class=\"c0\">The villagers' expressions shift from wariness to hope as they share their concerns about a looming threat— a large beast that has been gradually encroaching upon their village.</span></p><p class=\"c1\"><span class=\"c0\">The villagers say that they have sent repeated pleas to Dawnguard but there was no response.</span></p><p class=\"c1\"><span class=\"c0\">After some proper preparations, a group of five to six stout men gather, armed with makeshift spears and wearing pots as armour. Despite their modest equipment, their courage is evident, and both Cyrus and I feel proud of their determination.</span></p><p class=\"c1\"><span class=\"c0\">Drawing on my past survival skills in the wilderness, I lead our group in tracking down the Ravager. Its size makes it relatively easy to follow its trail— large footprints and broken branches mark its passage through the forest. </span></p><p class=\"c1\"><span class=\"c0\">Along the way, we encounter a family travelling in a carriage, their faces etched with concern as they stand before the warning sign Cyrus and I had left earlier.</span></p><p class=\"c1\"><span class=\"c0\">We approach the family with the carriage and explain the sighting of a dangerous hellspawn. We urge them to seek safety in the village until the hellspawn is dealt with, in which they agree gratefully, and we continue our pursuit.</span></p><p class=\"c1\"><span class=\"c0\">After an hour of tracking, we finally locate the Ravager near a cave. Approaching cautiously, Cyrus briefs the villagers on the Ravager's typical behaviour and attack patterns, stressing the importance of maintaining a safe distance.</span></p><p class=\"c1\"><span class=\"c0\">Our strategy is straightforward: I will engage the Ravager head-on, drawing its attention with agile manoeuvres, while Cyrus provides support from a distance with his ethereal spears. </span></p><p class=\"c1\"><span class=\"c0\">Once I signal, the villagers will join in, attacking where I have weakened the creature, maximising the damage while my blessing suppresses its regenerative abilities.</span></p><p class=\"c1\"><span class=\"c0\">After each coordinated strike, the villagers will swiftly retreat to safety, ready to repeat the assault until the Ravager is defeated. With the plan in place, we move forward, prepared to execute it flawlessly.</span></p><div><p class=\"c3\"><span class=\"c0\"></span></p></div>"
}]