[{
    "id":5,
    "title":"Nothing Changed",
    "html":"<p class=\"c1\"><span class=\"c0\">The air around the cave entrance is thick with tension as Cyrus and I prepare to face the Ravager. Our resolve is mirrored by the villagers, armed with makeshift spears and armour. </span></p><p class=\"c1\"><span class=\"c0\">I, drawing upon my experience in tracking and survival, stays in the front as we enter the cave. Cyrus addresses the villagers with a calm but authoritative tone, explaining the plan once more.</span></p><p class=\"c1\"><span class=\"c0\">The villagers nod solemnly, their determination matching the gravity of the impending battle. With a final glance between us, I take point, positioning myself where he can draw the Ravager's attention effectively.</span></p><p class=\"c1\"><span class=\"c0\">The Ravager emerges from the shadows of the cave, a hulking mass of sinewy muscle and jagged teeth, its eyes burning with a feral beast.</span></p><p class=\"c1\"><span class=\"c0\">I engage it, my black blade flashing with precision as I dart in and out, landing calculated strikes designed to hinder the creature's regenerative abilities. Each time my blade connects, a surge of black energy ripples across the Ravager's flesh, momentarily disrupting its ability to heal.</span></p><p class=\"c1\"><span class=\"c0\">Meanwhile, Cyrus stays back with the villagers, his ethereal spears manifesting with a flick of his wrist. With precise aim, he launches them at the Ravager from a distance, each spear finding its mark with supernatural accuracy. The villagers watch in awe and trepidation, readying themselves for their moment to strike.</span></p><p class=\"c1\"><span class=\"c0\">After a series of coordinated attacks, I signal the villagers. With a unified shout, they surge forward, jabbing their spears into the weakened spots where I had dealt my blows.</span></p><p class=\"c1\"><span class=\"c0\">Our combined efforts overwhelm the Ravager, causing it to roar in pain and fury. As soon as the villagers land the hits, they immediately retreat, anticipating the Ravager's retaliatory strikes.</span></p><p class=\"c1\"><span class=\"c0\">The battle rages on. I continue to engage the Ravager head-on, drawing its attention away from the villagers as they consistently regroup for another assault. This strategic dance of attack and retreat continues, each cycle bringing the hellspawn closer to exhaustion and defeat.</span></p><p class=\"c1\"><span class=\"c0\">Finally, with one last coordinated effort, the villagers strike true, delivering a decisive blow that brings the Ravager to its knees. As if it no longer has any strength left, the hellspawn lays down, unmoving.</span></p><p class=\"c1\"><span class=\"c0\">Exhausted but triumphant, Cyrus and I share a nod of mutual respect amidst the villagers' victorious cheers. I’m glad that there was no casualty around this time.</span></p><p class=\"c1\"><span class=\"c0\">We have not only protected the village but have also shown its inhabitants the strategic planning against even a tier two hellspawn.</span></p><p class=\"c1\"><span class=\"c0\">The villagers are also ecstatic, their faces alight with pride and relief for standing up against a monstrous beast. </span></p><p class=\"c1\"><span class=\"c0\">Amidst their celebration, they don't seem to notice the dark essence of the hellspawn slowly flowing into me, a detail I’m thankful for not having to explain.</span></p><p class=\"c1\"><span class=\"c0\">As we return to the village, the good news spreads quickly. The entire village rejoices, grateful for the unexpected help. </span></p><p class=\"c1\"><span class=\"c0\">They invite Cyrus and me to stay for dinner, but we politely decline. We need to get back to Dawnguard before dark to avoid any unwanted attention. </span></p><p class=\"c1\"><span class=\"c0\">Besides, we'll be back early tomorrow morning with Reynold and the guards. Due to our cover story earlier, we can easily explain that we have joined the sentinels when we meet the villagers again.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I bid the villagers farewell and head back to Dawnguard.</span></p><p class=\"c1\"><span class=\"c0\">\"Not too shabby, hey?\" Cyrus said, giving my shoulder a light, playful tap with his fist.</span></p><p class=\"c1\"><span class=\"c0\">\"Hah…\" I replied with a light laugh, feeling a sense of accomplishment. </span></p><p class=\"c1\"><span class=\"c0\">It feels good to know we've made the right choice and saved the village from a potential massacre.</span></p><p class=\"c1\"><span class=\"c0\">Upon our return to Dawnguard, we decide to reward ourselves with a hearty meal at a nearby tavern. The food is simple but satisfying, and the atmosphere helps us unwind from the day's events. </span></p><p class=\"c1\"><span class=\"c0\">After our meal, we head back to our quarters, ready to take an early rest and prepare for tomorrow.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next morning]</span></p><p class=\"c1\"><span class=\"c0\">As we approach the gate, we see Reynold waiting with a few guards. It's a familiar scene, having played out twice before. </span></p><p class=\"c1\"><span class=\"c0\">We exchange greetings, and Reynold launches into his usual briefing about the mission details and our target. His words are the same, but for Cyrus and me, this is now the second time we're hearing them.</span></p><p class=\"c1\"><span class=\"c0\">We set off towards the village once more, with a sense of déjà vu hanging over us. Halfway through the journey, we reach the spot where we previously encountered the broken carriage and the unfortunate family’s corpses. To our relief, the carriage and the bodies are no longer there.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I share a discreet fist-pump, quietly celebrating our success in preventing their tragic fate. The small victory energises us, reinforcing the belief that we can make a difference, even in the face of daunting odds.</span></p><p class=\"c1\"><span class=\"c0\">\"Strange.\" Reynold remarked, his brow furrowed.</span></p><p class=\"c1\"><span class=\"c0\">Everyone turns towards him, puzzled.</span></p><p class=\"c1\"><span class=\"c0\">\"We received a report of a Ravager nearby, yet we’re already halfway to the village and haven’t seen any signs of it.\" he said, adding. \"Could the report have been faulty?\"</span></p><p class=\"c1\"><span class=\"c0\">\"Aren’t we glad it’s faulty rather than real?\" Cyrus interjected with a hopeful tone.</span></p><p class=\"c1\"><span class=\"c0\">\"Reporting false information to the kingdom is a crime. Once we return, an investigation will be conducted to determine if punishment is necessary.\" Reynold replied sternly.</span></p><p class=\"c1\"><span class=\"c0\">\"They get punished for reporting false information?\" I asked, incredulous.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes, because it wastes the kingdom’s resources.\" Reynold explained matter-of-factly.</span></p><p class=\"c1\"><span class=\"c0\">\"So… they are punished by the kingdom’s laws if they’ve done wrong, but if they genuinely need help, the kingdom’s protection doesn’t reach them?\" I pressed, frustration evident in my voice.</span></p><p class=\"c1\"><span class=\"c0\">\"What do you mean? Aren’t we on our way to help them?\" Reynold looked genuinely confused by my question.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus gives me a look that clearly says, \"Be quiet,\" as if reminding me not to accidentally reveal what we did yesterday.</span></p><p class=\"c1\"><span class=\"c0\">\"Ah, no, I was just rambling.\" I quickly apologised.</span></p><p class=\"c1\"><span class=\"c0\">\"Hm.\" Reynold grunted, deciding to ignore my comment and move on.</span></p><p class=\"c1\"><span class=\"c0\">We continue our journey, nearly reaching the village when a stranger suddenly appears, running towards us. All the guards become cautious and ready their weapons, while Reynold observes the man carefully.</span></p><p class=\"c1\"><span class=\"c0\">As the man gets closer, he scans the group and locks his eyes on Cyrus and me. He then rushes towards us. The guards prepare to block him, but Reynold raises his arm, signalling them to hold off.</span></p><p class=\"c1\"><span>\"Ah… you two… I’m so glad… to see you again. Please… please help us.\" The man </span><span>panted</span><span class=\"c0\">, clearly exhausted.</span></p><p class=\"c1\"><span class=\"c0\">This familiar figure is one of the brave villagers who had joined us in hunting down the Ravager yesterday.</span></p><p class=\"c1\"><span class=\"c0\">\"What happened?\" I asked urgently.</span></p><p class=\"c1\"><span class=\"c0\">\"The hellspawn... the one we took down. There’s more than one.\" The man gasped. \"Another one is already at the village. Please, hurry.\"</span></p><p class=\"c1\"><span class=\"c0\">\"What?\" Cyrus reacted, his eyes wide.</span></p><p class=\"c1\"><span class=\"c0\">\"There’s another Ravager. It’s already attacking the village. Please, quickly.\" he pleaded.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I exchange glances. \"Let's not delay.\" I said.</span></p><p class=\"c1\"><span class=\"c0\">\"Hold on.\" Reynold interrupted, his voice stern. \"How do you two know each other, and what do you mean— again?\"</span></p><p class=\"c1\"><span class=\"c0\">\"We'll explain later. Let’s save the villagers first.\" Cyrus answered, trying to move past him.</span></p><p class=\"c1\"><span class=\"c0\">\"No. As the leader of this party, I need an explanation now.\" Reynold insisted, not budging.</span></p><p class=\"c1\"><span class=\"c0\">\"Fine.\" I said, sighing. \"When we got the mission, we went ahead yesterday because we thought we could handle it quickly and save Dawnguard's resources. We succeeded, but we didn't realise there would be another Ravager until now.\"</span></p><p class=\"c1\"><span class=\"c0\">“You two went out on your own?! Do you know how dangerous that was? Haven’t you learned the basic rules that sentinels have to follow?” Reynold's voice rose in anger.</span></p><p class=\"c1\"><span class=\"c0\">“We know... but...” Cyrus stammered, struggling to find words.</span></p><p class=\"c1\"><span class=\"c0\">“Sorry, it was my idea.” I interjected, stepping forward.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus looked at me in surprise. “Your idea?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I was overconfident in my abilities and decided to act alone. Cyrus tried to stop me, but I persuaded him into it. I’m sorry, I made a mistake.” I apologised earnestly.</span></p><p class=\"c1\"><span class=\"c0\">Reynold's gaze shifts between us, his expression still stern. </span></p><p class=\"c1\"><span class=\"c0\">“Alright. We'll deal with this later. Let's move out.” He finally said, letting out a frustrated sigh.</span></p><p class=\"c1\"><span class=\"c0\">With that, we all rush toward the village, determined to confront the new threat.</span></p><p class=\"c1\"><span class=\"c0\">We quickly follow the villager, and immediately upon arrival, a bloodbath scene unfolds before us. Cyrus and I are stunned because this... was exactly the same as last time. It just... happened again.</span></p><p class=\"c1\"><span class=\"c0\">Whatever the reason, I need to help them now.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I try to jump in, but once again, Reynold stops us.</span></p><p class=\"c1\"><span class=\"c0\">“What... what are you guys waiting for?” the villager yelled at us, panic evident in his voice.</span></p><p class=\"c1\"><span class=\"c0\">“It could be a trap.” Reynold said, his cautious tone exactly the same as before.</span></p><p class=\"c1\"><span class=\"c0\">The same damn words again. However, this time, I’m not going to just sit still and listen.</span></p><p class=\"c1\"><span class=\"c0\">Ignoring Reynold, I step forward with determination. “We don’t have time for this! We need to act now!”</span></p><p class=\"c1\"><span class=\"c0\">Cyrus nods in agreement, and together, we charge into the fray, determined to save the villagers and end this nightmare once and for all.</span></p><p class=\"c1\"><span class=\"c0\">The Ravager at the village looks more like the one we first encountered, before the time reset incident. Looking back, the one we killed yesterday was slightly smaller, but in the heat of the moment, we failed to notice it. </span></p><p class=\"c1\"><span class=\"c0\">Armed with our prior experience, we immediately implement the same strategy as yesterday. However, the sight of the corpses of the villagers, who were just talking to me yesterday, strikes me hard. </span></p><p class=\"c1\"><span>Their faces, their voices— it's all too much. Distracted by the haunting memories, I </span><span>miscalculate</span><span>&nbsp;the distance and the Ravager </span><span>lands</span><span class=\"c0\">&nbsp;a clean hit on me.</span></p><p class=\"c1\"><span class=\"c0\">Pain explodes through my body, and I stumble, vulnerable. Cyrus sees me in danger and tries to help, but he can’t reach me in time. Instead, a brave villager leaps onto the hellspawn, drawing its attention away from me.</span></p><p class=\"c1\"><span class=\"c0\">It was not part of the plan!</span></p><p class=\"c1\"><span class=\"c0\">The villager was to wait until I inflicted a grievous wound, then Cyrus would immobilise the Ravager, allowing the villager to strike. </span></p><p class=\"c1\"><span class=\"c0\">Chaos erupts when the Ravager, still free in its movements, abruptly shifts its attention to the villager. With a thunderous swipe, the villager is flung away like a ragdoll.</span></p><p class=\"c1\"><span class=\"c0\">Panic surges through me as I rush to retaliate against the Ravager. I manage to land a solid cut on its arm, but it isn’t enough to penetrate its thick hide. </span></p><p class=\"c1\"><span class=\"c0\">In response, the Ravager turns its wrath toward me. With terrifying force, it flings me aside, sending me crashing into the ground with a bone-jarring impact.</span></p><p class=\"c1\"><span class=\"c0\">Gasping for breath, I struggle to get back on my feet. The pain radiates through my body, but I can’t afford to stay down. </span></p><p class=\"c1\"><span class=\"c0\">I glance around frantically, searching for Cyrus and the others. They are regrouping, preparing to mount another attack. We can’t let the Ravager regain its momentum.</span></p><p class=\"c1\"><span class=\"c0\">Grim determination sets in as I push through the pain, ignoring my own injuries.</span></p><p class=\"c1\"><span class=\"c0\">Noticing that I have regained my footing, Cyrus shouts out loud.</span></p><p class=\"c1\"><span class=\"c0\">“Stay focused! We can’t afford any more mistakes.” </span></p><p class=\"c1\"><span class=\"c0\">I nod and resume my position, blade steady in my hand. Then, I finally see the kingdom guards stepping in to assist.</span></p><p class=\"c1\"><span class=\"c0\">As we work together, I push aside the memories of the fallen and concentrate on the task at hand. Every movement, every strike is precise. Slowly but surely, we wear the Ravager down. </span></p><p class=\"c1\"><span class=\"c0\">Then Reynold rushes past me, activating his golden barrier, a sense of déjà vu washes over me. Cyrus and the kingdom guards swiftly pin down the Ravager, immobilising it just as they have done before. </span></p><p class=\"c1\"><span class=\"c0\">Reynold descends upon the creature, his barrier shimmering with power as he prepares to deliver the finishing blow. With a final, decisive strike, Reynold brings an end to the terror. </span></p><p class=\"c1\"><span class=\"c0\">Struggling to my feet, I survey the grim scene unfolding around me. Once again, the villagers lay lifeless, their bodies scatter amidst the wreckage of the village. Once again, the cost— both physically and emotionally— is heavy.</span></p><p class=\"c1\"><span class=\"c0\">My heart sinks as I realise the extent of the devastation. Yet, amidst the carnage, I spot a familiar face— the villager who bravely intervened earlier. </span></p><p class=\"c1\"><span class=\"c0\">Unlike last time, he had narrowly escaped a fatal blow.</span></p><p class=\"c1\"><span class=\"c0\">\"Are you alright?\" Cyrus asked, concern etched in his voice.</span></p><p class=\"c1\"><span class=\"c0\">\"Yeah, I'm fine.\" I replied, despite the bruises on my back and knees.</span></p><p class=\"c1\"><span class=\"c0\">\"You two really messed up this time.\" Reynold approached with a sombre expression. \"There will be consequences once we're back in the capital.\"</span></p><p class=\"c1\"><span class=\"c0\">We stand in silence, too exhausted to argue.</span></p><p class=\"c1\"><span class=\"c0\">Deep down, the disappointment weighs heavily on both of us. We have hoped to save the villagers, but once again, our efforts have ended in tragedy.</span></p><p class=\"c1\"><span class=\"c0\">\"Sir Reynold, what about him?\" One of the guards asked, gesturing toward the wounded man.</span></p><p class=\"c1\"><span class=\"c0\">\"Leave him. Our mission to deal with the hellspawn is finished. He's on his own now.\" Reynold ordered coldly.</span></p><p class=\"c1\"><span class=\"c0\">\"We can't just abandon him like that.\" Cyrus interjected.</span></p><p class=\"c1\"><span class=\"c0\">\"You still dare to speak?\" Reynold shot back, his tone harsh.</span></p><p class=\"c1\"><span class=\"c0\">\"We will take responsibility for what happened, but that does not mean we should ignore a dying man.\" Cyrus insisted.</span></p><p class=\"c1\"><span class=\"c0\">\"It's his choice to be outside the kingdom's protection. Had he chosen to join us, this wouldn't have happened.\" Reynold argued.</span></p><p class=\"c1\"><span class=\"c0\">\"If that's true, why not let him choose now?\" Cyrus pressed. \"Let him join the kingdom. He sought us out for help, which shows he's willing to contribute. He can run and fight, evident from how he reached us and survived out here. He could be valuable for labour or defence.\"</span></p><p class=\"c1\"><span class=\"c0\">\"Hm... running and fighting.\" Reynold mused, considering Cyrus' words.</span></p><p class=\"c1\"><span class=\"c0\">\"Exactly.\" Cyrus continued. \"He has the strength for it. Let's give him a chance to prove himself.\"</span></p><p class=\"c1\"><span class=\"c0\">Reynold thinks for a moment, then nods slowly. </span></p><p class=\"c1\"><span class=\"c0\">\"Very well. We'll take him in and see how he fares. But if he causes trouble, it's on both of you.\"</span></p><p class=\"c1\"><span class=\"c0\">Cyrus nods gratefully, and together we help the wounded man to his feet, offering him a chance to start anew within the kingdom's walls.</span></p><p class=\"c1\"><span class=\"c0\">However, Reynold's quick agreement after Cyrus' plea raises doubts. Does he truly believe in the man's commitment to serve the kingdom? </span></p><p class=\"c1\"><span class=\"c0\">Despite this, we explain the arrangement to the survivor, who reluctantly agrees, seeing no other viable option. </span></p><p class=\"c1\"><span class=\"c0\">As everyone rests, a support party arrives— or rather, a scavenging party.</span></p><p class=\"c1\"><span class=\"c0\">I’m already sick of watching them work, so I hurry Cyrus to wrap things up, making sure all the villagers receive proper burials like before.</span></p><p class=\"c1\"><span>Upon returning to Dawnguard, we promptly </span><span>report</span><span class=\"c0\">&nbsp;to the garrison. Just as expected, we both receive a week-long punishment. </span></p><p class=\"c1\"><span class=\"c0\">I ask the receptionist for updates about the man we bring in. She explains that he will be transferred to a local church for treatment by the priests there.</span></p><p class=\"c1\"><span class=\"c0\">Today, I find out that those blessed with healing abilities often choose to become priests, dedicated solely to saving lives, in contrast to sentinels who hunt hellspawns. </span></p><p class=\"c1\"><span class=\"c0\">Understanding this distinction, I now see why Valoria struck me as a religious kingdom. That explains its architecture and district names in Dawnguard.</span></p><p class=\"c1\"><span>Cyrus and I </span><span>decide</span><span class=\"c0\">&nbsp;to clean up at home before visiting the church. The church remains open day and night, so late-night visits are still possible. I hope the man we saved isn’t asleep yet.</span></p><p class=\"c1\"><span class=\"c0\">Despite the punishment, my accommodation is still arranged for me exactly like before.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[A few hours later]</span></p><p class=\"c1\"><span class=\"c0\">I meet up with Cyrus again and we both head to the nearby church that the receptionist told us about.</span></p><p class=\"c1\"><span class=\"c0\">Once we get there, a priestess comes out and greets us. We inquire about a man who was recently transferred here.</span></p><p class=\"c1\"><span class=\"c0\">The priestess, however, gives a solemn expression after hearing our inquiry.</span></p><p class=\"c1\"><span class=\"c0\">“What’s wrong? Why… do you look so down?” Cyrus asked, noticing something strange.</span></p><p class=\"c1\"><span class=\"c0\">The priestess, after taking in a deep breath, informs us.</span></p><p class=\"c1\"><span class=\"c0\">\"I'm sorry. The man you brought here… shortly after arrival… he hanged himself.\"</span></p><p class=\"c1\"><span class=\"c0\">Cyrus and I exchanged stunned looks.</span></p><p class=\"c1\"><span class=\"c0\">“What… why…?” I asked, feeling a pang of guilt.</span></p><p class=\"c1\"><span class=\"c0\">\"As priests, we can heal physical wounds, but not the inner scars in our patients' hearts. Those who have lost everything often seek the quickest way to reunite with their loved ones.\" The priestess shook her head gently.</span></p><p class=\"c1\"><span>Cyrus</span><span class=\"c0\">&nbsp;places a hand on my shoulder, offering silent support. We thank the priestess for her honesty and turn to leave, the weight of the man's death heavy on our hearts.</span></p><p class=\"c1\"><span class=\"c0\">Feeling powerless, Cyrus and I quietly part ways and head home for much-needed rest. It seems like we both are still absorbed in processing the events of the past two days— or I should say, a total of four days for us.</span></p><p class=\"c1\"><span class=\"c0\">Upon reaching my new accommodation, I immediately succumb to a deep slumber, finally resting after all the turmoil and challenges.</span></p><p class=\"c1\"><span class=\"c0\">—</span></p><p class=\"c1\"><span class=\"c0\">[Next morning]</span></p><p class=\"c1\"><span class=\"c0\">Waking up, I still feel the ache in my heart from recent events. Yet, with a whole week ahead of me, I know I must find a way to move forward.</span></p><p class=\"c1\"><span class=\"c0\">But I can't shake my fear. If this continues, if I remain powerless and forced to accept these losses, I worry I'll grow accustomed to it— seeing death and moving on as if it's routine.</span></p><p class=\"c1\"><span class=\"c0\">Lost in thought, I ready myself and head outside for breakfast. Once again, I make my way down to the market, deliberately stopping at the same fried chicken stall to reassure myself that I haven't slipped back into the same day again.</span></p><p class=\"c1\"><span class=\"c0\">However, this time, I managed to savour my first bite of the chicken without the two troublesome men causing a scene.</span></p><p class=\"c1\"><span class=\"c0\">Cyrus isn't joining me today either. I imagine he needs some time to process everything.</span></p><p class=\"c1\"><span class=\"c0\">After finishing my meal, I decided to head back to my accommodation for some more rest.</span></p><p class=\"c1\"><span class=\"c0\">But as I approach, I notice a crowd gathered outside the entrance. It's a struggle to get through, but eventually, I make my way inside. To no surprise, the lobby is bustling with even more people.</span></p><p class=\"c1\"><span class=\"c0\">Why is it… so busy today? Was yesterday just unusually quiet, or is something significant happening now?</span></p><p class=\"c1\"><span class=\"c0\">Weird.</span></p><p class=\"c1\"><span class=\"c0\">Walking up the stairs, I notice a group of sturdy men who appear to be bodyguards, blocking the passage. </span></p><p class=\"c1\"><span class=\"c0\">What's happening here? It couldn’t &nbsp;have been a murder, right?... or some kind of crime scene?</span></p><p class=\"c1\"><span class=\"c0\">I attempt to proceed upstairs but am promptly halted by one of the men.</span></p><p class=\"c1\"><span class=\"c0\">“Hey, stop [][][][][] there. Who are you, and what [][][] you [][][][][][] [][] do?”</span></p><p class=\"c1\"><span class=\"c0\">Shoosh… without Cyrus here, my communication skill is back to the rock bottom again.</span></p><p class=\"c1\"><span class=\"c0\">“Eh… I - live - here. I - go - in - yesterday. My - room - is…” I said while pointing up the stairs.</span></p><p class=\"c1\"><span class=\"c0\">The man then speaks to his colleague, who in response, hands over a piece of paper. Holding onto the paper, he briefly scans through it while looking back at me a few times in between.</span></p><p class=\"c1\"><span class=\"c0\">“What [][] your name?” He calmly asked.</span></p><p class=\"c1\"><span class=\"c0\">“Vincas… I - am - not - trouble?” I answered with an awkward smile.</span></p><p class=\"c1\"><span class=\"c0\">“No, [][][], you [][][] not. We [][][][] [][][][] waiting [][][] you. Please [][][][] this way.” He politely guided me.</span></p><p class=\"c1\"><span class=\"c0\">What… is going on here…</span></p><p class=\"c1\"><span class=\"c0\">I'm guided to the third floor where my room is located, and as I walk down the hallway, I notice two figures standing outside my door. </span></p><p class=\"c1\"><span class=\"c0\">To my surprise, one of them is someone I encountered a few days ago. Now I understand why there's such a commotion downstairs. It's reminiscent of the arena all over again.</span></p><p class=\"c1\"><span class=\"c0\">The person standing there is Eris Flameheart.</span></p><p class=\"c1\"><span class=\"c0\">The man escorts me directly to her, standing beside another middle-aged woman in neat and professional attire.</span></p><p class=\"c1\"><span class=\"c0\">Standing awkwardly before Eris, I'm at a loss for what to do. Not only is my Valorish lacking, but I'm also facing someone who's revered by everyone out there. Oh god… Cyrus… Why didn’t you visit me today? You'd handle this so much better.</span></p><p class=\"c1\"><span class=\"c0\">\"Hey.\" Eris broke the silence.</span></p><p class=\"c1\"><span class=\"c0\">\"Hey.\" I replied, unsure of what to say next. </span></p><p class=\"c1\"><span class=\"c0\">She continues to give me a scrutinising look, but on closer inspection, it's actually more on the side of curiosity than anything.</span></p><p class=\"c1\"><span class=\"c0\">In a moment of sheer awkwardness, and with no experience whatsoever in handling such situations with women, I awkwardly reach for the doorknob and open my room door. </span></p><p class=\"c1\"><span class=\"c0\">It's a dumb move, I know, but I can't bear the tension and just want an escape.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Eris slams her hand against the door, shutting it firmly.</span></p><p class=\"c1\"><span class=\"c0\">\"...\" I swallowed nervously. </span></p><p class=\"c1\"><span class=\"c0\">Okay then...</span></p><p class=\"c1\"><span class=\"c0\">\"I... am... Eris... Flameheart.\" She said slowly.</span></p><p class=\"c1\"><span class=\"c0\">\"Huh...?\" I gave her a surprised and confused look. </span></p><p class=\"c1\"><span class=\"c0\">Why is she speaking to me like this? Wait, does she know I can't speak Valorish properly? </span></p><p class=\"c1\"><span class=\"c0\">It can't be, right? She must be mocking me, right? There's no way she's speaking slowly for my benefit, right?</span></p><p class=\"c1\"><span class=\"c0\">“[][] [][][][] [][]!! [][][] [][][][] [][][] [][][][][] [][][][][][][] [][]?!!!” Suddenly, she spoke so fast and turned away somewhere else as if she was scolding someone else. </span></p><p class=\"c1\"><span class=\"c0\">I still look at her, confused. She then turns back to me, releasing a deep sigh.</span></p><p class=\"c1\"><span class=\"c0\">\"Do you... speak... Valorish?\" She asked slowly, emphasising each word.</span></p><p class=\"c1\"><span class=\"c0\">\"...\" I hesitated, unsure how to respond.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes... No???\" She sped up, her patience wearing thin.</span></p><p class=\"c1\"><span class=\"c0\">\"No... no... no.\" I panicked, repeating myself.</span></p><p class=\"c1\"><span class=\"c0\">\"No?\" she double-confirmed.</span></p><p class=\"c1\"><span class=\"c0\">\"Yes... No...\" I took a deep breath, calming myself. \"I - not - speak - Valorish - good.\" </span></p><p class=\"c1\"><span class=\"c0\">This time, a clearer answer.</span></p><p class=\"c1\"><span class=\"c0\">\"Okay.\" she nodded.</span></p><p class=\"c1\"><span class=\"c0\">Then, the lady beside her steps forward.</span></p><p class=\"c1\"><span class=\"c0\">\"I can help you.\" she offered.</span></p><p class=\"c1\"><span class=\"c0\">Huh… What… </span></p><p class=\"c1\"><span class=\"c0\">“I can understand you?” I replied, surprised.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. I used to be a sentinel but have now retired. My blessing allows me to communicate with anyone no matter the language.”</span></p><p class=\"c1\"><span class=\"c0\">“I… see.”</span></p><p class=\"c1\"><span class=\"c0\">And I thought that Cyrus was the unique one… turns out that other people can have similar abilities. Regardless, it’s still quite unfair that this lady’s ability is just one of Cyrus’s… unlimited possibilities.</span></p><p class=\"c1\"><span class=\"c0\">“Lady Eris has arranged for me to assist you in learning Valorish. From now on, if you may allow, I will be your personal tutor to ensure that you will pick up the language in just three months' time.”</span></p><p class=\"c1\"><span class=\"c0\">“Three months?” I gasped.</span></p><p class=\"c1\"><span class=\"c0\">“Yes. Thanks to my experience in communication and being a professor from one of the best academies in Valoria myself, I am confident that I can help you learn the language in just three months.”</span></p><p class=\"c1\"><span class=\"c0\">“Wow… I… don’t know what to say. Thanks… but, why? Do I have to… you know, repay the tuition fees?”</span></p><p class=\"c1\"><span class=\"c0\">“No. Lady Eris has provided the funds needed for my time. You will not need to spend a single coin.”</span></p><p class=\"c1\"><span class=\"c0\">Shocked, I turn back to Eris, who holds her head high with a slight smirk, as if she expects some gratitude from me.</span></p><p class=\"c1\"><span>“Thank - you.” I said to </span><span>her.</span></p><p class=\"c1\"><span class=\"c0\">“You [][][] [][][][][][][].” She proudly replied.</span></p><p class=\"c1\"><span class=\"c0\">I still don’t understand, but I guess she probably said I am welcome.</span></p><p class=\"c1\"><span class=\"c0\">Eris then speaks to my new tutor, and after a while, the tutor turns back to me to convey the message.</span></p><p class=\"c1\"><span class=\"c0\">\"Lady Eris said that your actions yesterday, despite the incident that led to your punishment, impressed someone. Upon learning about your difficulty with Valorish, this person, a close friend of Lady Eris, requested her assistance in arranging a tutor for you.\"</span></p><p class=\"c1\"><span class=\"c0\">I hadn’t realised there was so much happening behind the scenes. Also, I didn’t expect my disobedience yesterday to become widely known. I wonder if Cyrus is facing similar issues right now.</span></p><p class=\"c1\"><span class=\"c0\">\"Thank you. May I ask who this person is?\"</span></p><p class=\"c1\"><span class=\"c0\">\"I’m sorry, but Lady Eris told me that this person prefers to remain anonymous.\"</span></p><p class=\"c1\"><span class=\"c0\">“Alright then. Please tell Lady Eris that I really appreciate her and the anonymous friend’s kindness. I’ll do my best to repay this debt one day.”</span></p><p class=\"c1\"><span class=\"c0\">The tutor conveys my message to Eris, then relays Eris’s message back to me again.</span></p><p class=\"c1\"><span class=\"c0\">“Lady Eris said not to worry, as the chance to repay this debt will come soon.”</span></p><p class=\"c1\"><span class=\"c0\">“Oh, I see.”</span></p><p class=\"c1\"><span class=\"c0\">Of course there would be some ulterior motive behind all this help. Someone out there must have a use for me then.</span></p><p class=\"c1\"><span class=\"c0\">Anyway, I'll just focus on improving my Valorish if I want to continue living here.</span></p><p class=\"c1\"><span class=\"c0\">Once everything is arranged for the next lesson, Eris and my tutor take their leave. I can already sense the uproar downstairs. </span></p><p class=\"c1\"><span class=\"c0\">Wait… if she’s this famous, and her bodyguards just let me pass in front of that crowd, won’t I be in trouble with her fans?</span></p><p class=\"c1\"><span class=\"c0\">Ah… I should probably lay low for the next one week until this all blows over. If anyone asks, I’ll just say the bodyguards were letting me back to my room, and I had nothing to do with Eris.</span></p><p class=\"c1\"><span class=\"c0\">[Yesterday morning]</span></p><p class=\"c1\"><span class=\"c0\">[Xenon’s perspective]</span></p><p class=\"c1\"><span class=\"c0\">I wonder how Vincas fared with the sentinel trial. It’s a shame that I received a mission yesterday morning, then spent the entire night tending to my mother. </span></p><p class=\"c1\"><span class=\"c0\">Anyway, I’ve asked Cyrus to guide Vincas and help him out. Despite his carefree and easygoing nature, when it comes to important matters, he always gets it done. After all, he’s a direct heir of one of the five great houses in Valoria— a pureblood noble… unlike me.</span></p><p class=\"c1\"><span class=\"c0\">I might have noble blood through my father, but my mother… She was just an escort my father shared a fleeting passion with. That’s all.</span></p><p class=\"c1\"><span class=\"c0\">But I can’t really complain; at least, I’m still fortunate in some ways. My father did take responsibility and married my mother. I suppose he couldn’t bear the thought of having a bastard on the streets, a stain on his reputation.</span></p><p class=\"c1\"><span class=\"c0\">Imagine— the eldest son of the Skyforge family caught in an affair with a commoner escort, and even fathering a child. Such a disgrace would have cost him his position as head of the house.</span></p><p class=\"c1\"><span class=\"c0\">My mother, tucked away in the remote house he provided for us, never stops singing his praises. Yet, from the day I was born until now, he hasn’t visited us once.</span></p><p class=\"c1\"><span class=\"c0\">Yes, not even once in over a decade.</span></p><p class=\"c1\"><span class=\"c0\">What kind of father does that?</span></p><p class=\"c1\"><span class=\"c0\">And my mother… so desperate, so lonely. Day after day, she’s been trying to force her ideal life with him onto me, pushing me to be the perfect son who’d finally get his attention back on her…</span></p><p class=\"c1\"><span class=\"c0\">She’s just so—</span></p><p class=\"c1\"><span class=\"c0\">“Xenon Skyforge.” A voice pulls me back to the present. “Are you still with us?”</span></p><p class=\"c1\"><span class=\"c0\">Standing before me is a man with blonde hair and piercing green eyes, clad in silver armour with a beautifully crafted eagle on the chest piece.</span></p><p class=\"c1\"><span class=\"c0\">He’s Cedric Windrider, the leader of our mission today. A silver-rank sentinel with over years of field experience.</span></p><p class=\"c1\"><span class=\"c0\">“Yes, sir. The mission today is straightforward— investigate and explore the sudden appearance of a sinkhole on the western outskirts of Dawnguard. If we encounter any hellspawn, our task is to observe, take note of their types, features, and characteristics, and then report back to the higher-ups for further action.”</span></p><p class=\"c1\"><span class=\"c0\">Cedric nodded thoughtfully. “Exactly. As Xenon just said, our primary objective isn't to eliminate any hellspawn we come across, but to identify potential threats emerging from that mysterious sinkhole.”</span></p><p class=\"c1\"><span class=\"c0\">Alongside Cedric and me, four kingdom guards have been assigned to assist. Typically, a pair of sentinels is sufficient for most hellspawn-related missions. Stronger hellspawn requires higher-ranking sentinels, but the rule of working in pairs has almost always remained consistent.</span></p><p class=\"c1\"><span class=\"c0\">This pairing strategy allows the kingdom to allocate resources efficiently across all fronts in Dawnguard. Sending just one sentinel would be too risky— a single moment of carelessness could lead to a fatal mistake, especially when dealing with higher-tier hellspawn that often work together. On the other hand, deploying three or more sentinels at a time would quickly deplete the kingdom's resources, especially with the constant influx of requests from all corners of the kingdom to the capital, Dawnguard.</span></p><p class=\"c1\"><span class=\"c0\">Two sentinels strike the perfect balance, a decision the kingdom’s leadership unanimously supports. However, there is one notable exception to this rule.</span></p><p class=\"c1\"><span class=\"c0\">\"Today, another sentinel will be joining us. This will be her first mission, so please assist her. Although it’s primarily my responsibility to guide her, your support would greatly benefit her growth.\" Cedric announced.</span></p><p class=\"c1\"><span class=\"c0\">The rule of pairing applies strictly to sentinels with at least a year of experience. When a new sentinel emerges, the kingdom usually assigns a more seasoned sentinel and a veteran to guide them. The veteran doesn't just teach the newcomer the rules and basic skills for dealing with hellspawn— they also reinforce these lessons for the more experienced sentinel, ensuring they remain vigilant and avoid arrogance.</span></p><p class=\"c1\"><span class=\"c0\">The less experienced sentinel also plays a crucial role, helping to guide the newcomer while honing their own leadership skills. After all, one day, they might be the ones leading the kingdom.</span></p><p class=\"c1\"><span class=\"c0\">“Hello.” a sharp yet sweet voice called out from behind us.</span></p><p class=\"c1\"><span class=\"c0\">“Eris Flameheart.” Cedric greeted her, confirming the identity of our new sentinel.</span></p><p class=\"c1\"><span>Flameheart? Could she really be </span><span class=\"c2\">that</span><span class=\"c0\">&nbsp;Eris Flameheart?</span></p><p class=\"c1\"><span class=\"c0\">The girl who steps forward is young, with pale, smooth skin and fiery red twin tails. Her face radiates energy, and her smile brims with confidence. I glance at the other guards, and from their stunned expressions, I can tell they’re thinking the same thing.</span></p><p class=\"c1\"><span>The Flameheart family is renowned for being the only fire-wielding sentinels in all of Valoria. Among the five great houses, the </span><span>Flamehearts</span><span class=\"c0\">&nbsp;have long been the closest aides to the throne, with each generation serving as the hand of the crown.</span></p><p class=\"c1\"><span class=\"c0\">However, what sets Eris Flameheart apart is her extraordinary achievement: she is the youngest person ever recorded in Valoria to awaken her blessing. She first manifested her fire-wielding ability at just two years old. Yes, before she could even speak properly, she was already conjuring flames.</span></p><p class=\"c1\"><span class=\"c0\">As the prodigy of the Flameheart house and the sole daughter of its current head, she’s in a league of her own compared to her already exceptional cousins. Her talent and potential are unparalleled. On top of that, she’s rumoured to be a great beauty.</span></p><p class=\"c1\"><span class=\"c0\">“Hello.” Eris Flameheart announced in a confident tone. “As Sir Cedric has introduced, I’m Eris Flameheart, and I’ll be joining you all on this mission today.”</span></p><p class=\"c1\"><span class=\"c0\">Her bold demeanour catches me off guard, but I step forward to introduce myself. “I’m Xenon Skyforge. Pleased to make your acquaintance.”</span></p><p class=\"c1\"><span>“Hm…? What’s a Skyforge doing here? Aren’t you all staying at Tempeste and rarely visit the </span><span>capital</span><span class=\"c0\">?”</span></p><p class=\"c1\"><span class=\"c0\">Her tone strikes me as unusually curt. </span></p><p class=\"c1\"><span class=\"c0\">“I’m working in Dawnguard to gain more experience as a sentinel.” I replied.</span></p><p class=\"c1\"><span class=\"c0\">“Really?” She looks at me with a puzzled expression. </span></p><p class=\"c1\"><span class=\"c0\">“What?” I smile awkwardly.</span></p><p class=\"c1\"><span class=\"c0\">“Did you say your name is Xenon?”</span></p><p class=\"c1\"><span class=\"c0\">“Yes?”</span></p><p class=\"c1\"><span class=\"c0\">“I’ve never heard of you before, and I thought I had memorised all the current generation’s names.” she said, pausing before suddenly gasping. “Ah! You must be that poor kid who got kicked out of—” She stops abruptly, then adds, “...you know what? Never mind.”</span></p><p class=\"c1\"><span class=\"c0\">“...”</span></p><p class=\"c1\"><span class=\"c0\">The way she speaks... so she’s just another noble brat, isn’t she?</span></p><p class=\"c1\"><span class=\"c0\">“Ah, hmm…” Cedric interrupted, ending our conversation. “Anyway, since Eris has just arrived, I’ll summarise the mission details again.”</span></p><p class=\"c1\"><span class=\"c0\">“Sir Cedric.” I raised my hand.</span></p><p class=\"c1\"><span class=\"c0\">Cedric pauses and turns to face me. “Yes?”</span></p><p class=\"c1\"><span class=\"c0\">“Eris arrived late to the meeting point. According to the sentinel rules, shouldn’t she receive a warning for her improper behaviour?” I suggested.</span></p><p class=\"c1\"><span class=\"c0\">I’m not going to sit back and let a spoiled brat get away with it.</span></p><p class=\"c1\"><span class=\"c0\">“Huh?” Eris looked at me with an irritated expression, her eyebrows raised.</span></p><p class=\"c1\"><span class=\"c0\">“Well, Xenon…” Cedric responded, “...to be honest, we were just getting started, so it wasn’t that big of a deal…”</span></p><p class=\"c1\"><span class=\"c0\">“No. You’re the leader. You need to set a good example, especially for a newcomer like her, so she remembers the rules.” I insisted firmly.</span></p><p class=\"c1\"><span class=\"c0\">“Hey, Skyforge, what’s the deal with you picking on me?” Eris snapped, frustration clear in her tone.</span></p><p class=\"c1\"><span class=\"c0\">“I’m not picking on you. I’m just helping you learn the basics of being a sentinel, and one of those is to be punctual.”</span></p><p class=\"c1\"><span class=\"c0\">“Oh... you wouldn’t dare...”</span></p><p class=\"c1\"><span class=\"c0\">With a flick of her fingers, a small spark of flame appears at her fingertip.</span></p><p class=\"c1\"><span class=\"c0\">“Hey, hey... stop, both of you!” Cedric interjected, his voice stern. He then releases a deep sigh.</span></p><p class=\"c1\"><span class=\"c0\">“Alright, Lady Flameheart, please make sure to be on time at the meeting point for the next mission. Punctuality is crucial for sentinels. It allows the leader to quickly brief the team and head out as soon as possible. Time is essential— it can sometimes mean the difference between saving a life or not.” Cedric explained professionally.</span></p><p class=\"c1\"><span class=\"c0\">Eris gives me one last glare, her annoyance evident. “Fine. I won’t do it again next time.” she said, crossing her arms.</span></p><p class=\"c1\"><span class=\"c0\">Good. Hopefully, she’ll take the lesson to heart.</span></p><p class=\"c1\"><span class=\"c0\">After Cedric briefs us on the mission once more, we finally set off toward our destination. The sinkhole is located in the Clovercroft Woodland, a vast expanse to the west of Dawnguard, just before the mountains. It’s relatively close to the forest entrance on our side, so we should reach it by afternoon.</span></p><p class=\"c1\"><span class=\"c0\">Once we arrive, we’ll set up camp and begin our investigation early the next morning. To ensure we make good use of our time, we’re all equipped with horses for faster travelling.</span></p><p class=\"c1\"><span class=\"c0\">!!!</span></p><p class=\"c1\"><span class=\"c0\">Suddenly, a loud scream pierces the air. I turn around to see Eris struggling to control her horse. Meanwhile, my own steed is already saddled and waiting for me.</span></p><p class=\"c1\"><span class=\"c0\">\"First time?\" I teased, unable to resist a jab.</span></p><p class=\"c1\"><span class=\"c0\">Eris shoots me a quick, silent glance but doesn't respond.</span></p><p class=\"c1\"><span class=\"c0\">“Ah!” </span></p><p class=\"c1\"><span class=\"c0\">Without warning, the horse bucks wildly, yanking Eris along and causing her to lose her balance.</span></p><p class=\"c1\"><span class=\"c0\">“Watch out!” I shouted, rushing over. </span></p><p class=\"c1\"><span class=\"c0\">I catch her around the waist just before she hits the ground, pulling her back to safety.</span></p><p class=\"c1\"><span class=\"c0\">The horse, now agitated, continues to rear and try to bolt. The other guards quickly intervene, corralling the animal and calming it down.</span></p><p class=\"c1\"><span class=\"c0\">“Are you okay?” I asked, my arms still around her.</span></p><p class=\"c1\"><span class=\"c0\">Hmm… her waist feels surprisingly soft, and— wait a minute— when I realise, my hand is awkwardly pressed against her chest.</span></p><p class=\"c1\"><span class=\"c0\">“Hands… off… me!!!” Eris snapped, her face flushing with anger and embarrassment.</span></p><p class=\"c1\"><span class=\"c0\">Eris swings her fist, catching me off guard and sending me flying. The raw power of an awaken is no joke. </span></p><p class=\"c1\"><span class=\"c0\">Before I can even regain my footing, a fireball hurtles toward me. I narrowly dodge it, my heart racing. Is she actually trying to kill me? </span></p><p class=\"c1\"><span class=\"c0\">“How dare you…” Eris seethed, her face a mix of fury and humiliation. </span></p><p class=\"c1\"><span class=\"c0\">She conjures two more fireballs in her hands, their heat radiating toward me. </span></p><p class=\"c1\"><span class=\"c0\">“Hey, I was just trying to help,” I protested, preparing my portals to escape if needed. </span></p><p class=\"c1\"><span class=\"c0\">“Help or grope, you creep?!” she snapped, her anger palpable. “You think you can just touch me like that?” </span></p><p class=\"c1\"><span class=\"c0\">“I didn’t mean to.” I said quickly, backing away. </span></p><p class=\"c1\"><span class=\"c0\">“Intentional or not, you did it— damn pervert!” she shouted, hurling another fireball in my direction.</span></p><p class=\"c1\"><span class=\"c0\">I manage to set up a portal, redirecting Eris's fireball back at her. She’s momentarily stunned, quickly throwing her remaining fireball to cancel out the attack. As she readies another spell, a gust of powerful wind snuffs out the flames.</span></p><p class=\"c1\"><span class=\"c0\">“What are you two doing?!” Cedric’s voice rang out, filled with anger. “Fighting among sentinels during a mission is strictly prohibited!”</span></p><p class=\"c1\"><span class=\"c0\">I stay silent, letting Eris explain herself. After all, she’s the one who started this.</span></p><p class=\"c1\"><span class=\"c0\">“He harassed me.” she replied bluntly, her tone icy.</span></p><p class=\"c1\"><span class=\"c0\">“Wait, that’s not—” I started to explain, but Cedric cut me off with a sharp glare.</span></p><p class=\"c1\"><span class=\"c0\">“Xenon…” Cedric’s gaze is stern, but I can’t tell if it’s anger over my disobedience or something else. The other guards are casting similar looks my way, their expressions unreadable.</span></p><p class=\"c1\"><span class=\"c0\">I let out a heavy sigh, feeling the weight of their disapproval.</span></p><p class=\"c1\"><span class=\"c0\">“The horse was running off, and she was about to fall. I just acted on instinct.” I quickly explained, hoping we can move on instead of wasting time with this.</span></p><p class=\"c1\"><span class=\"c0\">The guards finally manage to calm the horse down, but now there’s uncertainty in the air. Eris doesn’t seem to have much experience with riding, and it’s clear she might not be able to follow us on her own. In the end, she decides to ride with Cedric.</span></p><p class=\"c1\"><span class=\"c0\">With that settled, we continue our journey in awkward silence, all of us on horseback. After half a day of travelling, we finally reached Clovercroft Woodland.</span></p><p class=\"c1\"><span class=\"c0\">“We’re here.” Cedric announced, breaking the tension.</span></p><p class=\"c1\"><span class=\"c0\">Before us lies the massive sinkhole, its vast expanse visible right at the forest’s entrance. The size of it is staggering, roughly equivalent to that of a small village. </span></p><p class=\"c1\"><span class=\"c0\">Though its enormity is alarming, there’s some relief in the fact that we can see the bottom from where we stand. If the sinkhole were so deep that we couldn’t measure it, we’d have a serious problem on our hands, as it could potentially indicate the presence of a hellsgate.</span></p><p class=\"c1\"><span class=\"c0\">Yes, the hellsgate— the place where a stone pillar rises from the earth and floats into the sky, leaving behind a vast, bottomless sinkhole. That’s where the hellspawns emerge, hence the name \"hellsgate\".</span></p><p class=\"c1\"><span class=\"c0\">However, the sinkholes formed by a hellsgate are usually much larger, often three or four times the size of this one. Still, this is a significant concern. A sinkhole of this magnitude could indicate that a similarly massive hellspawn caused it, possibly by stepping on this very spot or by engaging in a large-scale battle that went unnoticed.</span></p><p class=\"c1\"><span class=\"c0\">If a hellspawn of such size exists, it could be a tier three or even a tier four. In that case, we would need to retreat immediately to prepare better. Alternatively, if a large battle did take place here without the kingdom’s knowledge, it points to a serious lapse in security.</span></p><p class=\"c1\"><span class=\"c0\">Based on our earlier plan, we divide into two groups. One group will set up camp for the night, while the other will patrol the surrounding area to identify any potential threats.</span></p><p class=\"c1\"><span class=\"c0\">“Isn’t it dangerous to camp out here, especially since this area is still considered hellspawn-infested?” Eris asked, her voice tinged with concern.</span></p><p class=\"c1\"><span class=\"c0\">“That’s a good question.” Cedric replied with a reassuring smile. “Since this is your first mission, you probably haven’t seen how we handle situations like this.” He paused, gauging her reaction. “It is dangerous to stay overnight in a hellspawn-infected area, especially in an open space. But...”</span></p><p class=\"c1\"><span class=\"c0\">Cedric’s smile widens, and as if on cue, one of the nearby guards steps forward, carrying a large bag in his hands. The guard seems to know exactly what Cedric intends to demonstrate.</span></p><p class=\"c1\"><span class=\"c0\">“Thanks to our genius inventor, Emilia Lightbearer, our kingdom has developed a special type of tent. This tent generates a mana field that acts both as a sensor to detect nearby hellspawns and as a shield to protect us. It’s not the strongest defence out there, but it’s enough to withstand a tier three hellspawn’s attack at least once. That should give us enough time to wake up and prepare.”</span></p><p class=\"c1\"><span class=\"c0\">“And what about a tier four hellspawn?” Eris asked, her tone curious but slightly anxious.</span></p><p class=\"c1\"><span class=\"c0\">“Ah, Lady Flameheart, please don’t jinx us.” Cedric responded with a chuckle.</span></p><p class=\"c1\"><span class=\"c0\">“But I just want to be sure…” she mumbled, her concern genuine.</span></p><p class=\"c1\"><span class=\"c0\">“We’ve been monitoring the western area of Valoria for decades.” I interjected, trying to ease her worries. “The worst we’ve ever encountered here were tier one or tier two hellspawns. For a tier four to show up... well, we’d have to be extraordinarily unlucky.”</span></p><p class=\"c1\"><span class=\"c0\">“Hm…” Eris muttered, brushing off my words.</span></p><p class=\"c1\"><span class=\"c0\">Is she still mad about the earlier incident? Seriously?</span></p><p class=\"c1\"><span class=\"c0\">Anyway, I’m on the scouting team, so it’s time to move on. Cedric will stay back to guide Eris, and since I’ve faced hellspawns before, I’ll take two guards with me to patrol the area. There’s not much daylight left, so I need to hurry and cover as much ground as possible before nightfall.</span></p><div><p class=\"c4\"><span class=\"c0\"></span></p></div>"
}]