[{
    "id":6,
    "title":"Not The End",
    "html":"<p class=\"c0\"><span class=\"c1\">[An hour later]</span></p><p class=\"c0\"><span class=\"c1\">Dusk is settling in. Using my portals, I quickly traverse the area, reaching the higher branches of trees for a better vantage point. </span></p><p class=\"c0\"><span class=\"c1\">I’ve scouted the surrounding area near our camp, covering a radius of a few hundred yards. </span></p><p class=\"c0\"><span class=\"c1\">It seems secure enough, especially with the protective tent and the guards taking turns on watch throughout the night.</span></p><p class=\"c0\"><span class=\"c1\">As I return to the campsite, a sense of unease creeps in. The tents are halfway set up, but the protective barrier is still missing.</span></p><p class=\"c0\"><span class=\"c1\">Odd.</span></p><p class=\"c0\"><span class=\"c1\">I look around, but the clearing is eerily empty. Where is everyone?</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">It can't be… An ambush?</span></p><p class=\"c0\"><span class=\"c1\">The thought grips me as I quickly signal the guards to take cover behind the trees. We need to assess the situation before making any moves. This doesn’t add up— there were no signs of life during my patrol, so how could an ambush be waiting here?</span></p><p class=\"c0\"><span class=\"c1\">The guards remain still, eyes on me, awaiting my command. As the sentinel in charge, it’s up to me to figure this out.</span></p><p class=\"c0\"><span class=\"c1\">I focus, channelling my mana to create several small portals, each linked to a different corner of the campsite. Watching through the portals, I scan the area for any hidden threats.</span></p><p class=\"c0\"><span class=\"c1\">Nothing. The campsite seems clear.</span></p><p class=\"c0\"><span class=\"c1\">I signal the guards to move in with me. Summoning three portals, I position them directly in front of us. On my command, we leap through, arriving near the tents in an instant.</span></p><p class=\"c0\"><span class=\"c1\">We quickly fan out, scanning the area once more. Still, there's no sign of enemies— or any of our allies.</span></p><p class=\"c0\"><span class=\"c1\">What in the world is going on here?</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">As the faint sound of footsteps draws nearer, we instinctively slip into the tents, holding our breaths. The tension is palpable, each beat of silence amplifying the unknown threat lurking just outside.</span></p><p class=\"c0\"><span class=\"c1\">The footsteps indicate multiple figures, moving with an unsettling precision. No voices, no growls— nothing that suggests human or hellspawn. Could they be creatures with camouflage abilities, slipping past my earlier patrol unnoticed?</span></p><p class=\"c0\"><span class=\"c1\">The steps split, with one of them headed directly toward my tent.</span></p><p class=\"c0\"><span class=\"c1\">My heart pounds in my chest. As a support-type sentinel, I’m not equipped for direct combat. My strengths lie in assisting others, scouting, and, when necessary, providing an escape route. Right now, that escape is all I’m focused on.</span></p><p class=\"c0\"><span class=\"c1\">My hands are already poised, ready to summon a portal behind me at the slightest sign of danger. If this goes south, I’ll retreat and regroup— no heroics, just survival.</span></p><p class=\"c0\"><span class=\"c1\">I steady my breathing, every muscle tensed for the moment I might need to flee.</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">As the tent flap opens, my heart races. I brace myself for an attack, but instead of a monstrous claw or shadowy figure, I see a human hand— small, delicate.</span></p><p class=\"c0\"><span class=\"c1\">\"…\"</span></p><p class=\"c0\"><span class=\"c1\">Suddenly, an ear-splitting scream erupts, nearly deafening me. Before me stands Eris, her red hair blazing in the dim light, her expression one of pure shock and fury.</span></p><p class=\"c0\"><span class=\"c1\">\"Fire!\" </span></p><p class=\"c0\"><span class=\"c1\">The word barely leaves my lips as I instinctively create a portal and dive through, landing outside the tent just in time to avoid a fiery explosion.</span></p><p class=\"c0\"><span class=\"c1\">\"You… you!!!\" Eris's voice rang out, filled with rage. \"You damn pervert!!!\"</span></p><p class=\"c0\"><span class=\"c1\">I barely have time to regain my balance before her accusations fly at me like daggers. </span></p><p class=\"c0\"><span class=\"c1\">\"Hold on. I don’t understand what is going on here!\" I pleaded, trying to make sense of the chaos.</span></p><p class=\"c0\"><span class=\"c1\">\"What is going on here?!\" she hissed, her eyes blazing with anger. \"You sneak into my tent just as night falls, without my permission, and you ask me what is going on?!\"</span></p><p class=\"c0\"><span>Without warning, she hurls a fireball in my direction. I barely manage to duck, the heat </span><span>singeing</span><span class=\"c1\">&nbsp;the air around me.</span></p><p class=\"c0\"><span class=\"c1\">“Wait! It’s not what you think!” I shouted, dodging another flame. But she’s not listening— her fury is too great, and I’m beginning to wonder how on earth I’m going to survive this.</span></p><p class=\"c0\"><span class=\"c1\">With a final desperate effort, I create another portal, redirecting the fireball into the sky where it harmlessly dissipates into the darkening clouds.</span></p><p class=\"c0\"><span class=\"c1\">“It… It was a mistake.” I stammered, trying to catch my breath.</span></p><p class=\"c0\"><span class=\"c1\">“Mistake? What mistake?!” Eris screamed, her anger intensifying as she flung more fireballs at me. </span></p><p class=\"c0\"><span class=\"c1\">I frantically open portals, sending each one harmlessly into the sky, but it’s taking everything I’ve got to keep up.</span></p><p class=\"c0\"><span class=\"c1\">“I came back, and nobody was here! I thought there were enemies, and when I heard footsteps behind me, I had to hide in the nearest tent! I didn’t know it was you!” I shouted, my words tumbling out in a frantic rush, hoping something will get through to her. </span></p><p class=\"c0\"><span class=\"c1\">But Eris is relentless, her rage blinding her to any explanation.</span></p><p class=\"c0\"><span class=\"c1\">Just as I think I’m about to be roasted alive, a powerful gust of wind sweeps over us, forcing both of us back toward the tent. The sudden force knocks the fireballs off course, and we both stumble slightly as the wind dies down.</span></p><p class=\"c0\"><span class=\"c1\">“Enough!” Cedric’s voice boomed through the air as he stepped forward, his presence commanding immediate attention. </span></p><p class=\"c0\"><span class=\"c1\">His eyes flick between us, his expression a mix of frustration and authority. “What in the world is going on here?”</span></p><p class=\"c0\"><span class=\"c1\">“She—” I started to explain, but Eris cut me off.</span></p><p class=\"c0\"><span class=\"c1\">“He was in my tent without permission!” she accused, her tone still heated.</span></p><p class=\"c0\"><span class=\"c1\">“I thought there was an ambush.” I countered, still catching my breath. “I didn’t know it was your tent.”</span></p><p class=\"c0\"><span class=\"c1\">Cedric raised a hand, silencing both of us. </span></p><p class=\"c0\"><span class=\"c1\">“This is unacceptable behaviour from both of you.” He said sternly. “Fighting amongst ourselves is not only reckless but dangerous. We are in a hellspawn-infested area. You both need to remember that.”</span></p><p class=\"c0\"><span class=\"c1\">Eris huffs, crossing her arms but saying nothing more. I just nod, glad the situation didn’t escalate further, but still feeling the tension hanging thick in the air.</span></p><p class=\"c0\"><span class=\"c1\">“From now on,” Cedric continued, “no more of this nonsense. We have a mission to complete, and it requires all of us working together. Is that understood?”</span></p><p class=\"c0\"><span class=\"c1\">“Yes, sir.” I replied, and Eris, after a moment of hesitation, muttered the same.</span></p><p class=\"c0\"><span class=\"c1\">Then, all of the sudden, Cedric pushes both of us to crouch down beside the tent. Seeing the sudden behaviour from Cedric, the guards instantly recognise the danger and find a hiding place too.</span></p><p class=\"c0\"><span class=\"c1\">The air grows heavy with tension as a creature emerges, its hulking form looming over the camp. Its shield-like arm scrapes against the ground, creating a harsh, grating sound that echoes through the forest. Its blade-like appendage gleams in the fading light, sharp and deadly, as it slowly swings back and forth, as if testing the air.</span></p><p class=\"c0\"><span class=\"c1\">Cedric signals us to remain silent, his eyes narrowing as he studies the creature. I can feel the energy crackling in the air as Eris prepares herself, her anger momentarily forgotten in the face of this new threat. My own heart races as I carefully consider our options.</span></p><p class=\"c0\"><span class=\"c1\">“A Crusader,” Cedric informed us.</span></p><p class=\"c0\"><span class=\"c1\">Crusaders are the highest rank among tier-two hellspawns. They possess impressive combat skills and have weapon-like features integrated into their bodies.</span></p><p class=\"c0\"><span class=\"c1\">Though individually classified as tier two, Crusaders are particularly dangerous because they always operate in squads of three. The synergy between these Crusaders makes their combined strength comparable to a tier three hellspawn, as they cover each other’s blind spots and fight with exceptional coordination.</span></p><p class=\"c0\"><span class=\"c1\">The creature's footsteps draw closer, the sound of its blade arm dragged behind it becoming clearer. It’s moving with a slow, deliberate pace, as if it’s searching for something— us, most likely.</span></p><p class=\"c0\"><span class=\"c1\">I glance at Cedric, waiting for his command. He's the leader, and in this situation, his experience and judgement are crucial. We need to decide quickly whether to engage or retreat.</span></p><p class=\"c0\"><span class=\"c1\">“Xenon,” Cedric called.</span></p><p class=\"c0\"><span class=\"c1\">I turn to him, ready for his command.</span></p><p class=\"c0\"><span class=\"c1\">“You and him—” Cedric pointed at me and one of the guards— “will handle the second Crusader when it arrives. Eris and the others will deal with this one.” He gestured toward the Crusader currently in sight. “I’ll take on the third one when it appears.”</span></p><p class=\"c0\"><span class=\"c1\">Everyone nodded in agreement, understanding the plan without needing further explanation. Eris, visibly nervous with one hand slightly trembling, quickly steadied herself with the other hand. Cedric, noticing her unease, placed a reassuring hand on her shoulder.</span></p><p class=\"c0\"><span class=\"c1\">“Start with a fireball, like the ones you threw at Xenon…” Cedric advised. “... but aim for the Crusader’s head.”</span></p><p class=\"c0\"><span class=\"c1\">Eris takes a deep breath, focusing on her task as Cedric’s words helped steady her resolve.</span></p><p class=\"c0\"><span class=\"c1\">Cedric then turns to the other three guards. “You three will surround the Crusader and attack when it’s vulnerable. Use the openings wisely.” He instructed.</span></p><p class=\"c0\"><span class=\"c1\">He faces Eris once more. “Don’t worry. If any threat arises, I’ll step in immediately, and Xenon will use his portals to get you out if needed.”</span></p><p class=\"c0\"><span class=\"c1\">Eris gives me a doubtful look, her eyebrows furrow.</span></p><p class=\"c0\"><span class=\"c1\">With a sigh, I reassure her. “I’ll make sure you’re safe and no harm comes to you… with my honour as a sentinel, and as a Skyforge. Now, go out there and set that monster on fire.”</span></p><p class=\"c0\"><span class=\"c1\">Eris, finally pushing aside her doubts about my ability to protect her, gives me a smile before pointing her finger directly at the Crusader. </span></p><p class=\"c0\"><span class=\"c1\">A small fireball forms at her fingertip, resembling a bullet from my old world. With a swift motion, she launches the flame at high speed, aiming straight for the Crusader’s head.</span></p><p class=\"c0\"><span class=\"c1\">Despite the precision of her attack, the Crusader reacts instinctively, tilting its head just enough to narrowly avoid a direct hit. The fireball, though, still scorches a third of its face, leaving a blackened burn.</span></p><p class=\"c0\"><span class=\"c1\">The three guards, following their orders, rush forward with their spears raised. They aim at the Crusader, but it raises its shield-like arm, blocking all three attacks effortlessly. The Crusader's shield proves impenetrable to their weapons, which lack the power to pierce through.</span></p><p class=\"c0\"><span class=\"c1\">With its other arm poised, the Crusader prepares to deliver a powerful downward slash at one of the guards.</span></p><p class=\"c0\"><span class=\"c1\">“Move!” Eris shouted.</span></p><p class=\"c0\"><span class=\"c1\">The three guards, having their spears stuck against the Crusader’s shield, quickly retreat, clearing the way for Eris. </span></p><p class=\"c0\"><span class=\"c1\">She channels all her focus into a giant fireball, which grows in intensity as she prepares to unleash it. </span></p><p class=\"c0\"><span class=\"c1\">With the path clear, Eris hurls the massive fireball toward the Crusader. </span></p><p class=\"c0\"><span class=\"c1\">The hellspawn raises its shield, but even with its imposing size, it is dwarfed by the sheer volume of the fireball. The flames envelop the Crusader completely, erupting in a powerful blast.</span></p><p class=\"c0\"><span class=\"c1\">As the fire and smoke dissipate, the Crusader remains, though now it is on one knee, clearly weakened by the intense attack.</span></p><p class=\"c0\"><span class=\"c1\">Before we can even react, a second Crusader has appeared beside the first, using its shield to snuff out the remaining flames from Eris's previous attack.</span></p><p class=\"c0\"><span class=\"c1\">I quickly summon three portals next to the guards, allowing them to retreat safely. According to our plan, one of the guards will join me to confront the new Crusader.</span></p><p class=\"c0\"><span class=\"c1\">Eris, determined and focused, continues to channel her fire, readying for the next attack. I give her a nod of acknowledgment.</span></p><p class=\"c0\"><span class=\"c1\">With the three guards having lost their spears, they are relegated to support roles, assisting Cedric when the third Crusader arrives.</span></p><p class=\"c0\"><span class=\"c1\">The second Crusader, growing impatient, charges at us with its shield raised.</span></p><p class=\"c0\"><span class=\"c1\">Eris fires several fireballs at it, but the Crusader's shield blocks each one.</span></p><p class=\"c0\"><span class=\"c1\">“Huh?” Eris opened her mouth in surprise.</span></p><p class=\"c0\"><span class=\"c1\">It’s because two of her fireballs suddenly vanish from view.</span></p><p class=\"c0\"><span class=\"c1\">They have been redirected by my portals and reappear on the sides of the Crusader’s head.</span></p><p class=\"c0\"><span class=\"c1\">The fireballs strike with precision, blasting the Crusader from both sides and causing it to stumble, halting its advance.</span></p><p class=\"c0\"><span class=\"c1\">As the guard leaps through the portal, he lands behind the Crusader and thrusts his spear with precise force into the hellspawn's back. The spear pierces through to the front of its abdomen, exploiting the Crusader’s weaker body armour.</span></p><p class=\"c0\"><span class=\"c1\">Just then, the first Crusader, seeing its comrade in trouble, leaps toward the isolated guard. I quickly react by summoning a portal beneath both the first Crusader and the guard. One portal pulls the guard back to safety, while the other transports the first Crusader right in front of the second Crusader.</span></p><p class=\"c0\"><span class=\"c1\">The second Crusader, momentarily distracted by the sudden appearance of its ally, barely has time to react before watching its ally hit by a massive fireball from Eris.</span></p><p class=\"c0\"><span class=\"c1\">The fireball engulfs the first Crusader, blasting it with intense flames and dealing a devastating blow. The first Crusader, now severely injured, struggles to regain its footing as the second Crusader prepares to defend its position.</span></p><p class=\"c0\"><span class=\"c1\">However, Cedric immediately uses his wind blessing to intensify the flames, causing the first Crusader to be overwhelmed and burns to a crisp.</span></p><p class=\"c0\"><span class=\"c1\">Now, only the severely wounded second Crusader remains, and the third Crusader has appeared beside it. Eris, visibly exhausted from her continuous use of fire blessings, struggles to keep her strength up.</span></p><p class=\"c0\"><span class=\"c1\">I prepare to support the team further, knowing that the third Crusader will be our next challenge. With the flames still burning strongly, I focus on maintaining control and providing openings for our attacks.</span></p><p class=\"c0\"><span class=\"c1\">The third Crusader, now fully engaged, brings with it another level of threat. Its presence signals a critical moment in the battle, and we must act quickly. The remaining guards and I must coordinate our attacks carefully to ensure that we can handle both the remaining Crusader and any potential hidden threats.</span></p><p class=\"c0\"><span class=\"c1\">The fight is far from over, but with a solid strategy and our combined efforts, we stand a strong chance of overcoming this challenge.</span></p><p class=\"c0\"><span class=\"c1\">“You all have done well. Leave the rest to me.” Cedric said, walking into the field.</span></p><p class=\"c0\"><span class=\"c1\">Cedric’s control over the wind forms a powerful fire tornado, encircling both remaining Crusaders. The tornado’s intense heat and swirling force leave them no room to escape. The fire's fury is relentless, and as the tornado tightens, the Crusaders are consumed by the searing flames.</span></p><p class=\"c0\"><span class=\"c1\">With this final display of Cedric’s strength, it becomes clear that the battle is over. The tornado continues to rage for a few more moments before Cedric dismisses it, letting the fire die down naturally.</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">A powerful shockwave erupts from within the tornado, dispersing it and extinguishing the flames entirely. Before the impact of the shockwave reaches us, Cedric uses his wind power to redirect the pressure upwards, neutralising its force.</span></p><p class=\"c0\"><span class=\"c1\">As the fire clears, we see the second Crusader still on its knee, battered but not defeated. Aside from the unscratched third Crusader, a new hellspawn emerges from the haze, marking a significant change from the previous threats.</span></p><p class=\"c0\"><span class=\"c1\">This new hellspawn is slightly shorter than the Crusaders and lacks their distinctive blade and shield. Instead, it features a long, flame-like mane in an ashen grey colour, floating above its head. Its body is marked with several V-shaped lines glowing in a dim grey light, extending from its chest down to its abdomen. The rest of its form is draped in a long, dreadfully dark cape, ending in a mysterious black mist that wraps around its feet.</span></p><p class=\"c0\"><span class=\"c1\">“We need to fall back.” Cedric said, sweat clearly visible on his blue face. “This hellspawn… is dangerous.”</span></p><p class=\"c0\"><span class=\"c1\">His urgent command immediately heightens our alertness, preparing us for the imminent danger.</span></p><p class=\"c0\"><span class=\"c1\">“Where did it go?” One of the guards said in a panic.</span></p><p class=\"c0\"><span class=\"c1\">As I scan the area, I notice the mysterious hellspawn has vanished from sight. Then, without warning, it appears directly in front of Cedric.</span></p><p class=\"c0\"><span class=\"c1\">Taken by surprise, Cedric musters all his remaining strength and unleashes a powerful aeroblast aimed straight at the hellspawn. Yet, once again, a shockwave emanates from the creature, dispersing the wind and nullifying the attack.</span></p><p class=\"c0\"><span class=\"c1\">But this time, it’s not just the wind that is dispersed. Right before our eyes, Cedric shatters into pieces, as if he were made of fragile glass.</span></p><p class=\"c0\"><span class=\"c1\">“Hah… What… is this…” I muttered, stunned and horrified.</span></p><p class=\"c0\"><span class=\"c1\">“Agghhh!!!” The guard’s scream pierced through the shock and confusion, adding to the chaos of the moment.</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">One of the guards, either paralysed by shock or overcome with fear, suddenly bolts, attempting to flee. He only manages two steps before meeting the same fate as Cedric, exploding and shattering into pieces like fragile glass.</span></p><p class=\"c0\"><span class=\"c1\">I quickly glance at the rest of my team. The remaining guards wear expressions of terror, clearly struggling to comprehend the horror unfolding before them. Eris, equally stunned, is trembling uncontrollably, her knees giving way beneath her.</span></p><p class=\"c0\"><span class=\"c1\">What am I doing?! I can't afford to be frozen by fear.</span></p><p class=\"c0\"><span class=\"c1\">In a rush, I channel my energy and summon portals beneath all of us, desperate to teleport us out of harm's way.</span></p><p class=\"c0\"><span class=\"c1\">My head is pounding, and my vision blurs, but I have no choice— I need to keep going. My portals are limited by range, only able to transport us to places I can see, and I've pushed myself to my absolute limit. The strain of teleporting five people at once is tearing my body apart, but we have to escape.</span></p><p class=\"c0\"><span class=\"c1\">We land at the very edge of the sinkhole, just behind the second Crusader, as it’s the furthest distance I can manage. But in almost an instant, I see the mysterious hellspawn vanish from its position, reappearing closer to us.</span></p><p class=\"c0\"><span class=\"c1\">It’s coming.</span></p><p class=\"c0\"><span class=\"c1\">Without wasting a second, I summon the portals again, teleporting us further away, across to the other side of the sinkhole, deeper into the forest. My body screams in pain. When we land, I feel a surge of agony rip through me. I collapse to my knees, blood pouring from my mouth. I’ve overused my power, and it’s tearing me apart from the inside.</span></p><p class=\"c0\"><span class=\"c1\">I fight to stay calm and regain my breath, but when I glance at the rest of my team, my heart sinks.</span></p><p class=\"c0\"><span class=\"c1\">Of the three guards, one is missing his head, and the other has been sliced cleanly in half, his torso severed. I whip around, my breath catching in my throat.</span></p><p class=\"c0\"><span class=\"c1\">There, just a few paces from where we had been standing, the mysterious hellspawn looms, one hand clutching the missing head and the other gripping the severed torso. </span></p><p class=\"c0\"><span class=\"c1\">My blood runs cold.</span></p><p class=\"c0\"><span class=\"c1\">Almost instinctively, I sense another shockwave building up, radiating from the hellspawn. I know I only have a moment.</span></p><p class=\"c0\"><span class=\"c1\">I force myself up, ignoring the sharp pain tearing through my muscles, and summon yet another set of portals. It takes every ounce of my strength to open them. Eris is still frozen in place, paralysed by fear. Without thinking, I grab her with everything I have and leap into the portal, dragging her with me.</span></p><p class=\"c0\"><span class=\"c1\">The last guard is reaching for the portal too, desperation written all over his face, but he’s just a second too late. The shockwave slams into him, and he shatters like the others— breaking into pieces as if he were made of glass.</span></p><p class=\"c0\"><span class=\"c1\">The portal spits us out deep within the forest, but I know this isn't enough. My insides feel like they’re tearing apart, but I force the bile and blood back down and summon another portal, teleporting us again and again, blindly leaping through the void, as far away from that monstrosity as possible.</span></p><p class=\"c0\"><span class=\"c1\">Each jump feels like it's ripping me apart. My vision blurs, my limbs shake uncontrollably, but I push on, the burning pain spreading through every muscle, every bone. I lose track of how many times I’ve teleported— three, maybe four? I don't know. All I know is that when my strength finally gives out, we’re at the edge of a forest, standing at the precipice of a sheer cliff.</span></p><p class=\"c0\"><span class=\"c1\">My body fails me completely, and I collapse, still gripping Eris tightly. The ground vanishes beneath us, and suddenly, we’re falling, plummeting down the cliffside. The wind roars past us, and I cling to Eris, knowing that if I lose my grip, neither of us will survive.</span></p><p class=\"c0\"><span class=\"c1\">“Eris!” I shouted as we fell, trying to get her attention.</span></p><p class=\"c0\"><span class=\"c1\">Startled, she quickly grasps the situation. With an instinctive movement, she conjures a large fireball directed downward. The returning force from the fire upon impact with the ground creates strong enough wind current to slow our descent.</span></p><p class=\"c0\"><span class=\"c1\">We land heavily, but the impact is less severe than it would have been without her intervention.</span></p><p class=\"c0\"><span class=\"c1\">Both of us tumble across the ground, the jarring force making me feel like my bones are cracking. I can feel one of my legs is definitely broken. </span></p><p class=\"c0\"><span class=\"c1\">Eris, after some erratic rolling, manages to sit up, wincing in pain as she cradles her left arm, which is also clearly injured.</span></p><p class=\"c0\"><span class=\"c1\">Gritting my teeth, I scan the surroundings and spot a small cave entrance nearby. My vision blurs with pain, but I manage to muster the strength to crawl toward Eris. </span></p><p class=\"c0\"><span class=\"c1\">“Eris, that cave there… we need to get inside and hide.” I urged, my voice strained.</span></p><p class=\"c0\"><span class=\"c1\">Eris, though clearly in distress, nods and begins moving toward the cave. </span></p><p class=\"c0\"><span class=\"c1\">We stumble toward the cave, each step agonising. I feel every jolt of pain shoot up my broken leg, but I bite down, pushing through the pain. </span></p><p class=\"c0\"><span class=\"c1\">Eris is in no better shape, clutching her broken arm tightly to her chest, her face pale and lifeless. </span></p><p class=\"c0\"><span class=\"c1\">I can't let us collapse here; not when that thing could still be following us.</span></p><p class=\"c0\"><span class=\"c1\">As we near the cave entrance, the shadows seem to swallow us whole. It's dark inside, but it's still a shelter. </span></p><p class=\"c0\"><span class=\"c1\">The air is cold, and the smell of damp earth fills my lungs as we limp deeper into the cave, moving away from the entrance, hoping the darkness will hide us from that monster.</span></p><p class=\"c0\"><span class=\"c1\">Eris, leaning against the wall, tries to control her breathing, wincing with every inhalation. </span></p><p class=\"c0\"><span class=\"c1\">I reach out, pulling her to a stop. \"Hold on…\" I whispered, my voice strained. \"We need to find a place to rest… somewhere deeper, where it can't see us from the outside.\"</span></p><p class=\"c0\"><span class=\"c1\">She nods, and we press on. Every step echoes, the sound bouncing off the cave walls, reminding us of how exposed we still are. After what feels like an eternity, we find a small nook, hidden behind a jagged outcrop of rock.</span></p><p class=\"c0\"><span class=\"c1\">\"We'll stay here…\" I said, lowering myself down carefully, trying not to jostle my leg. \"At least… at least for a moment.\"</span></p><p class=\"c0\"><span class=\"c1\">Eris sits beside me, her eyes wide and unfocused. I can see the fear in them— the same fear that's pounding in my chest. But I have to keep it together. We have to survive this. I lean my head back against the cold stone and close my eyes, just for a moment, trying to catch my breath and steady my thoughts.</span></p><p class=\"c0\"><span class=\"c1\">It feels like a long time has passed, but the hellspawn still hasn’t appeared. Maybe… it didn’t follow us?</span></p><p class=\"c0\"><span class=\"c1\">No, I can’t cling to wishful thinking. It will come, and it will kill us.</span></p><p class=\"c0\"><span class=\"c1\">Outside the cave, the sun has fully set, and night has fallen. Eris and I haven't exchanged a word since we got here. The silence is thick, almost unbearable.</span></p><p class=\"c0\"><span class=\"c1\">“I… I’m scared.” Eris finally whispered. </span></p><p class=\"c0\"><span class=\"c1\">I turn to look at her, seeing how her entire body is trembling.</span></p><p class=\"c0\"><span class=\"c1\">“I… don’t want to… die.” She continued, her eyes shut tightly as if trying to block out her fear.</span></p><p class=\"c0\"><span class=\"c1\">“Eris…” I started, but words failed me. </span></p><p class=\"c0\"><span class=\"c1\">I don’t know what to say.</span></p><p class=\"c0\"><span class=\"c1\">The silence returns, heavy and cold.</span></p><p class=\"c0\"><span class=\"c1\">\"You know… I was wrong about you.\" I began, breaking the silence.</span></p><p class=\"c0\"><span class=\"c1\">Eris turns to me, a bit surprised and a mix of curiosity in her eyes, waiting for what I’ll say next.</span></p><p class=\"c0\"><span class=\"c1\">\"I initially thought you were a spoiled noble brat, acting all cocky and arrogant…\"</span></p><p class=\"c0\"><span class=\"c1\">\"Hey…\" She cut me off, clearly irritated by the insult.</span></p><p class=\"c0\"><span class=\"c1\">\"...but I was wrong.\"</span></p><p class=\"c0\"><span class=\"c1\">Her expression softens, caught off guard by the admission.</span></p><p class=\"c0\"><span class=\"c1\">\"I mean… you’re still sort of the same, but…\" I saw her eyebrows rising in anger, and quickly added, \"No… Hear me out.\"</span></p><p class=\"c0\"><span class=\"c1\">She calms down a bit, so I continue. \"You’re just like anyone else. You get scared. You feel fear.\"</span></p><p class=\"c0\"><span class=\"c1\">Eris is fully focused on me now, listening closely.</span></p><p class=\"c0\"><span class=\"c1\">\"And yet you tried. When we were falling, even in shock, you fought to survive. That act saved both of us.\" I smiled. \"You didn’t just give up, and I think that’s pretty cool.\"</span></p><p class=\"c0\"><span class=\"c1\">She pauses for a moment, then gives a small smile. \"...You're pretty cool too.\"</span></p><p class=\"c0\"><span class=\"c1\">Did… she really just compliment me? I stay quiet, waiting to hear if she’ll say anything more.</span></p><p class=\"c0\"><span class=\"c1\">“When that monster killed Cedric, we were all too shocked to do anything. We froze up. But you… you kept a cool head and tried to get us out of there.” She said softly.</span></p><p class=\"c0\"><span class=\"c1\">“Hah… I didn’t succeed, though. The others died because of me…”</span></p><p class=\"c0\"><span class=\"c1\">“Not because of you— because of that damn hellspawn…” Eris cut in, her voice rising in frustration at our helplessness. “...and what do you mean by not succeeding? I’m still alive, thanks to you… for now…” </span></p><p class=\"c0\"><span class=\"c1\">Her voice trails off, and I can hear the sadness creeping back in.</span></p><p class=\"c0\"><span class=\"c1\">I simply smile, appreciating her words, even if they’re laced with doubt.</span></p><p class=\"c0\"><span class=\"c1\">“Hey, Eris.” I said, breaking the silence again.</span></p><p class=\"c0\"><span class=\"c1\">“What?” She replied, her tone a mix of curiosity and wariness.</span></p><p class=\"c0\"><span class=\"c1\">“If we get out of here alive, I think we should celebrate in a pub somewhere.” I suggested with a grin.</span></p><p class=\"c0\"><span class=\"c1\">“Huh...? Are you asking me out on a date?” She looked at me, her face twisted in confusion.</span></p><p class=\"c0\"><span class=\"c1\">“No.” I chuckled. “I’ll also introduce you to two of my friends in Dawnguard. They’re pretty cool. Both are sentinels, and I have high hopes for them. We can tell them all about our crazy tale of survival.”</span></p><p class=\"c0\"><span class=\"c1\">“I’ve got a friend who’d love to join just to hear this story.” She added with a laugh.</span></p><p class=\"c0\"><span class=\"c1\">“It’s settled then. We’re surviving this together, right, Eris?” I said, smiling.</span></p><p class=\"c0\"><span class=\"c1\">“Hm.” She nodded, returning the smile.</span></p><p class=\"c0\"><span class=\"c1\">I’m relieved to see her spirits lift, even if just a little. I can’t blame her for being scared. Anyone would be in this situation… except maybe someone who isn’t afraid of death— like me.</span></p><p class=\"c0\"><span class=\"c1\">Not that I don’t fear dying, but for me, death isn’t the end. In fact, it has already happened… twice.</span></p><p class=\"c0\"><span class=\"c1\">When I first arrived in this world, I didn't know much about the Skyforge family dynamics. But when I learned about my mother's fate, my reaction was impulsive, driven by a sense of justice. I decided to confront my father directly. The confrontation quickly escalated, and I lost control, lunging at him.</span></p><p class=\"c0\"><span class=\"c1\">I was young and hot-headed back then, and I didn't understand the consequences of attacking the head of House Skyforge. I was put down… accidentally. At that moment, I thought it was just a dream, and that when the light faded, I would wake up in the real world. But when I opened my eyes, I found myself back at my mother's house, listening to her tell me the same story again.</span></p><p class=\"c0\"><span class=\"c1\">At first, I didn't understand what had happened. It took me some time to realise I had gone back in time. When I confirmed it, I chose not to confront my father recklessly again.</span></p><p class=\"c0\"><span class=\"c1\">Later, I received my blessing and became a sentinel. On my very first mission, I faced a tier two hellspawn, thinking I was some big-shot or the protagonist of this world. I charged head-on and got killed almost instantly, before the team leader could even help.</span></p><p class=\"c0\"><span class=\"c1\">When I opened my eyes, I was back at the bastion, about to accept my first mission. That was when I truly understood— whenever I died, I would be brought back in time, just before my death.</span></p><p class=\"c0\"><span class=\"c1\">Fortunately, or perhaps unfortunately— I'm not sure yet— the time I'm brought back isn't fixed. The first time, I returned to my mother's house about two weeks before my death. The second time, it was around thirteen and a half days before. I don't know if this time window will continue to shorten, but at least I know this \"cheat\" can help me a lot in my career.</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">Suddenly, a terrifying aura fills the cave, chilling me to my core.</span></p><p class=\"c0\"><span class=\"c1\">We both know immediately what it means. It's here.</span></p><p class=\"c0\"><span class=\"c1\">I'm too drained to run, and I can't summon another portal. But I haven't given up. My ability to cheat death means I should always fight until the very end, gathering every scrap of knowledge for the next round.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn stands menacingly at the cave entrance, its dark, dreadful cloak swaying with its steps as it slowly approaches.</span></p><p class=\"c0\"><span class=\"c1\">“Eris, get back!” I shouted.</span></p><p class=\"c0\"><span class=\"c1\">But I'd rather risk everything and die fighting than watch others get brutally killed in front of me.</span></p><p class=\"c0\"><span class=\"c1\">With all my remaining strength, I push myself up, struggling to balance on my one good leg. Still, I raise my fists, ready to face this monster head-on.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn, almost as if taken aback by my resolve, vanishes and reappears right in front of me with terrifying speed. It stares into my eyes, like it's peering straight into my soul.</span></p><p class=\"c0\"><span class=\"c1\">I swing my fist at its face.</span></p><p class=\"c0\"><span class=\"c1\">To my shock, it connects— yet there's no impact. Nothing.</span></p><p class=\"c0\"><span class=\"c1\">Without even a twitch, the hellspawn exerts a strange force, flinging me across the cave. I crash hard against the cave wall, the impact jarring every bone and nearly crushing my insides. I cough up blood, my vision blurring from the pain.</span></p><p class=\"c0\"><span class=\"c1\">Suddenly, a fireball crashes into the hellspawn's face, but, once again, it has no effect. I turn to see Eris— despite her broken arm and the fear making her legs tremble— standing tall, another fireball forming in her hand.</span></p><p class=\"c0\"><span class=\"c1\">\"Screw that, Xenon. If I'm going to die here, I'll go out with a bang.\" She shouted defiantly, then shifted to a mocking tone. \"I ain’t going to let a Skyforge bastard get ahead of me!\"</span></p><p class=\"c0\"><span class=\"c1\">She hurls another fireball, but a shockwave emanates from the hellspawn, instantly snuffing out the flames and pushing Eris backward. Unlike before, it doesn't shatter her like it did to the guards. Instead, it just leaves her momentarily paralyzed.</span></p><p class=\"c0\"><span class=\"c1\">Why is it doing this? Why is it not killing us instantly like it did to the others?</span></p><p class=\"c0\"><span class=\"c1\">Eris struggles, trying to push herself back up. I can see the pain etched on her face, her good arm clutching her side— her ribs must be broken.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn turns its attention to her and begins to advance.</span></p><p class=\"c0\"><span class=\"c1\">\"No!\" I yelled, scrambling forward and grabbing onto its leg.</span></p><p class=\"c0\"><span class=\"c1\">Another shockwave ripples out, slamming me back against the cave wall. The impact is brutal, and I feel something tear inside— my organs screaming in agony.</span></p><p class=\"c0\"><span class=\"c1\">I... I don't think I can make it out of this.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn moves past me, closing in on Eris. I try to turn my head toward her, blood dripping from my mouth. Eris, barely holding herself up, manages a weak smile.</span></p><p class=\"c0\"><span class=\"c1\">\"You… were so damn cool just then… when you punched it.\" she whispered, coughing up blood. \"Maybe… in the next life… I'd actually… go on that date… with you…\"</span></p><p class=\"c0\"><span class=\"c1\">Before she can finish, the hellspawn releases another shockwave, cutting her off forever. I watch in horror as Eris shatters, her body breaking like fragile glass.</span></p><p class=\"c0\"><span class=\"c1\">Hah… So this is it… This is as far as I go in this loop.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn turns to face me now, its gaze piercing through me like a blade.</span></p><p class=\"c0\"><span class=\"c1\">\"You...\" It spoke.</span></p><p class=\"c0\"><span class=\"c1\">What… Did it just talk?</span></p><p class=\"c0\"><span class=\"c1\">\"...are not afraid of death?\" It continued, its voice like a low growl.</span></p><p class=\"c0\"><span class=\"c1\">How… How is this possible? No hellspawn has ever spoken before.</span></p><p class=\"c0\"><span class=\"c1\">No… it can’t be…</span></p><p class=\"c0\"><span class=\"c1\">I realise, with a sickening dread, that this is no ordinary creature. It must be… one of the infamous tier-five hellspawn.</span></p><p class=\"c0\"><span class=\"c1\">But why is it here? Why now?</span></p><p class=\"c0\"><span class=\"c1\">There are so many questions racing through my mind, but my body is too broken, too battered to utter a single word.</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn approaches me, bending down to meet my gaze. Its eyes seem to pierce into my very soul.</span></p><p class=\"c0\"><span class=\"c1\">\"Could it be that death is not the end for you?\" It asked.</span></p><p class=\"c0\"><span class=\"c1\">I swallow hard, trying to keep the blood from spilling out. This monster knows— about my ability.</span></p><p class=\"c0\"><span class=\"c1\">As if reading my thoughts, it continues. \"So I was right. Interesting.\"</span></p><p class=\"c0\"><span class=\"c1\">The hellspawn stands upright, its curiosity apparently satisfied. Without another word, it turns and begins to leave.</span></p><p class=\"c0\"><span class=\"c1\">Of course. It understands that I’m on the brink of death and assumes that I might somehow resurrect. There’s no further value in spending time with me. It was merely probing for answers through my reactions.</span></p><p class=\"c0\"><span class=\"c1\">Damn it... I’ve lost. I’ve failed to save anyone and couldn’t even save myself.</span></p><p class=\"c0\"><span class=\"c1\">But... at least I now know that this monstrous entity is close to Dawnguard. Next time... I’ll have to warn the higher-ups.</span></p><p class=\"c0\"><span class=\"c1\">As my consciousness begins to fade, the light of my life slowly dims, and I slip away.</span></p><p class=\"c0\"><span class=\"c1\">!!!</span></p><p class=\"c0\"><span class=\"c1\">“Arghh!!... Hah… Hah…”</span></p><p class=\"c0\"><span class=\"c1\">I’m… back.</span></p><p class=\"c0\"><span class=\"c1\">Just like the last two times, I’ve returned to the past upon death.</span></p><p class=\"c0\"><span class=\"c1\">\"Urgh...\"</span></p><p class=\"c0\"><span class=\"c1\">The physical injuries are gone, but the mental scars remain. I can still feel the invisible pain and the trauma of crossing over to the other side. </span></p><p class=\"c0\"><span class=\"c1\">I need to figure out when I am. First things first—I need to confirm the date and time.</span></p><p class=\"c0\"><span class=\"c1\">“Xenon Skyforge. Are you still with us?” A familiar voice interrupted my thoughts.</span></p><p class=\"c0\"><span class=\"c1\">I look up to find myself standing at the western gate, surrounded by the same group of guards, led by Cedric.</span></p><p class=\"c0\"><span class=\"c1\">What... I’ve come back in less than a day?!</span></p><p class=\"c0\"><span class=\"c1\">The last two times, it was over a week apart. How could it be less than twenty-four hours this time? Why is the time shortening so quickly?</span></p><p class=\"c0\"><span class=\"c1\">What if it keeps shortening... to the point where I can no longer return?</span></p><p class=\"c0\"><span class=\"c1\">“Xenon… You’re looking pale. Are you alright?” Cedric asked, concern etched across his face.</span></p><p class=\"c0\"><span class=\"c1\">“I’m… alright. Thanks.” I replied, trying to steady myself.</span></p><p class=\"c0\"><span class=\"c1\">“Did you manage to hear my briefing of today’s mission? Would you like me to go over it again?”</span></p><p class=\"c0\"><span class=\"c1\">“No, sir.” I quickly responded.</span></p><p class=\"c0\"><span class=\"c1\">Cedric, still looking slightly concerned, decides to let it go and continues. </span></p><p class=\"c0\"><span class=\"c1\">“Today, another sentinel will be joining us. This will be her first mission, so please assist her. Although it’s primarily my responsibility to guide her, your support would greatly benefit her growth.”</span></p><p class=\"c0\"><span class=\"c1\">“Eris…” I muttered, almost involuntarily.</span></p><p class=\"c0\"><span class=\"c1\">Cedric's eyebrows raise slightly. “Oh, you know?”</span></p><p class=\"c0\"><span class=\"c1\">Wait… I shouldn’t have known that. </span></p><p class=\"c0\"><span class=\"c1\">I nod, trying not to draw more attention. </span></p><p class=\"c0\"><span class=\"c1\">But there's no time to dwell on it. I need to focus. I take a deep breath and seize the moment.</span></p><p class=\"c0\"><span class=\"c1\">“Sir Cedric, I have a very important matter to discuss with you.” I said, my tone firm and serious.</span></p><p class=\"c0\"><span class=\"c1\">“What’s wrong, Xenon?” Cedric asked, concern deepening in his voice. “If you’re not feeling well, it’s okay to exempt yourself for today.”</span></p><p class=\"c0\"><span class=\"c1\">“No, I’m fine.”</span></p><p class=\"c0\"><span class=\"c1\">“Then what’s the matter?”</span></p><p class=\"c0\"><span class=\"c1\">“I’d like to request today’s mission to be cancelled, and that a further investigation be conducted first.” I replied, my tone steady.</span></p><p class=\"c0\"><span class=\"c1\">Cedric’s expression shifts slightly, his brow furrowing. </span></p><p class=\"c0\"><span class=\"c1\">He knows as well as I do that sentinels can file for a mission postponement if they believe the kingdom had underestimated the mission’s danger level. Such a request isn’t to be taken lightly. </span></p><p class=\"c0\"><span class=\"c1\">The kingdom reviews these petitions carefully, knowing that missions misjudged can lead to sentinel deaths and serious consequences.</span></p><p class=\"c0\"><span class=\"c1\">If the kingdom approves the request, they will send a separate party of higher-ranking sentinels to investigate. These sentinels won’t necessarily complete the mission; they will evaluate its true danger level and report back instead. </span></p><p class=\"c0\"><span class=\"c1\">Only if the threat level is deemed critical will they handle the situation themselves.</span></p><p class=\"c0\"><span class=\"c1\">After all, the kingdom views its sentinels as precious assets. Sending them on missions they aren’t prepared for or where the risk is too high can mean unnecessary loss of life. </span></p><p class=\"c0\"><span class=\"c1\">The system exists to safeguard sentinels, ensuring they are ready for the tasks at hand.</span></p><p class=\"c0\"><span class=\"c1\">Cedric considers my request, his eyes narrowing slightly as he weighs the gravity of my words.</span></p><p class=\"c0\"><span class=\"c1\">“What exactly are you concerned about, Xenon?” He finally asked, his tone a mix of curiosity and caution.</span></p><p class=\"c0\"><span class=\"c1\">“Hello.” a familiar high-pitch voice came up from behind us.</span></p><p class=\"c0\"><span class=\"c1\">“Eris Flameheart.” Cedric greeted Eris.</span></p><p class=\"c0\"><span class=\"c1\">Sensing the tense mood, Eris asked. “What’s happening?”</span></p><p class=\"c0\"><span class=\"c1\">“I’ll introduce you to the team later.” Cedric replied. “Right now, Xenon, from House Skyforge, has requested that today’s mission be further investigated. I’m still discussing his reasoning.”</span></p><p class=\"c0\"><span class=\"c1\">Cedric turns back to me, his expression serious. “Go on, Xenon.”</span></p><p class=\"c0\"><span class=\"c1\">I take a deep breath before speaking.</span></p><p class=\"c0\"><span class=\"c1\">“When I first received the mission and heard that we would be guiding a new sentinel today, I decided to scout the nearby area beforehand since I was already close by. </span></p><p class=\"c0\"><span class=\"c1\">During my reconnaissance, I discovered a large, mysterious sinkhole near Clovercroft Woodland. There were three Crusaders patrolling around it.”</span></p><p class=\"c0\"><span class=\"c1\">“Crusaders? And three of them together?” Cedric asked, his eyebrows raised in surprise.</span></p><p class=\"c0\"><span class=\"c1\">“Yes, sir.”</span></p><p class=\"c0\"><span class=\"c1\">Cedric goes silent, deep in thought, analysing the situation. </span></p><p class=\"c0\"><span class=\"c1\">“I understand your concern…” He began, “...but even when all three are together, they’re still just tier-two hellspawns. I believe we can handle them without much trouble.”</span></p><p class=\"c0\"><span class=\"c1\">“No, sir.” I interrupted, shaking my head. “The Crusaders aren’t the real issue.”</span></p><p class=\"c0\"><span class=\"c1\">“Then what is?” Cedric pressed, his tone sharpening.</span></p><p class=\"c0\"><span class=\"c1\">\"From far away, I spotted a mysterious hellspawn. It was unlike any I’ve seen before, and it emitted an extremely deadly aura that seemed to suffocate the air around it. </span></p><p class=\"c0\"><span class=\"c1\">The moment it seemed to notice me— yards away— I teleported out of there immediately. I’ve only been a sentinel for a few years, but I can tell that it’s a highly dangerous hellspawn, no less than a tier-four.\"</span></p><p class=\"c0\"><span class=\"c1\">I carefully choose my words. Even though I believe it to be one of the mythical tier-five hellspawns, I know Cedric will find that hard to believe. Mentioning a tier-four was already pushing it.</span></p><p class=\"c0\"><span class=\"c1\">Cedric’s expression darkens, his face growing more serious at the mention of a high-tier hellspawn.</span></p><p class=\"c0\"><span class=\"c1\">“That’s why I’m requesting that the kingdom send a stronger, independent team to investigate. From what I've heard, a tier-four hellspawn would require at least ten gold-ranked sentinels, or a single platinum-ranked sentinel, to handle.\"</span></p><p class=\"c0\"><span class=\"c1\">I hope my words will not lead to a worst-case scenario where they send only a few gold-ranked sentinels. This monster will easily annihilate them. </span></p><p class=\"c0\"><span class=\"c1\">Unfortunately, I am not in a position to request even a single platinum-ranked sentinel, let alone the entire group.</span></p><p class=\"c0\"><span class=\"c1\">\"Are you absolutely certain?\" Cedric asked, his voice calm but with an edge of urgency.</span></p><p class=\"c0\"><span class=\"c1\">“Yes.” I replied firmly.</span></p><p class=\"c0\"><span class=\"c1\">Cedric nods. </span></p><p class=\"c0\"><span class=\"c1\">\"Alright. I’ll explain the situation to the other party members and file a request for further investigation based on this report. When you get a chance today, you should also visit the nearby bastion to provide further details to help with the investigation.\"</span></p><p class=\"c0\"><span class=\"c1\">\"Thank you, Sir Cedric.\" I said, feeling a slight wave of relief.</span></p><p class=\"c0\"><span class=\"c1\">Cedric heads over to the guards and Eris, explaining the situation to them. I watch Eris’s face shift from curiosity to confusion, then to surprise, and finally settle into disappointment.</span></p><p class=\"c0\"><span class=\"c1\">Well… at least I get to see her again. I can’t help but smile a little. I’m not sure if it's because of the relief of seeing her alive, or if it’s my admiration for her courage.</span></p><p class=\"c0\"><span class=\"c1\">As if sensing my thoughts, Eris turns sharply and catches me smiling. Her eyes narrow in annoyance, her expression clearly saying I’ve ruined her day.</span></p><p class=\"c0\"><span class=\"c1\">“What are you smiling at?” She demanded, her tone sharp.</span></p><p class=\"c0\"><span class=\"c1\">“Me?… Nothing.” I replied, trying to keep a straight face.</span></p><p class=\"c0\"><span class=\"c1\">“Pervert.” She shot back, then paused for a second in awkward silence.</span></p><p class=\"c0\"><span class=\"c1\">I chuckle to myself, but whatever it is, I’m just glad she’s safe and sound.</span></p><p class=\"c0\"><span class=\"c1\">I brace myself for what’s coming next. I know that for the rest of the day, and probably the rest of the week, I’ll be summoned to the bastion repeatedly to provide a full account of my report.</span></p><p class=\"c0\"><span class=\"c1\">Sigh… the uneasiness still lingers. That monster is still out there.</span></p><p class=\"c0\"><span class=\"c1\">I desperately hope I’m wrong about it being a tier-five hellspawn. Because if I'm right… Dawnguard is in grave danger.</span></p><div><p class=\"c3\"><span class=\"c1\"></span></p></div>"
}]