[{
	"name" : "Hellspawn",
	"html" : "<p><em>&ldquo;Let justice be done, though the Heavens Fall.&rdquo;<\/em><\/p><p>&nbsp;<\/p><p>&ldquo;Wake up&hellip;&rdquo;<\/p><p>A soft lady-like voice is calling me. It&rsquo;s the same voice that I&rsquo;m been hearing for a while.<\/p><p>It keeps telling me to wake up.<\/p><p>Wake up? Why do I need someone to tell me to wake up?<\/p><p>Have I been sleeping?<\/p><p>Wait. I&rsquo;m having a bit of trouble moving my body.<\/p><p>Slowly.<\/p><p>Ah, it seems that I can feel my body now.<\/p><p>My arms, fingers, then my legs, I can feel them.<\/p><p>It&rsquo;s pitch black in here, and the surface seems rough. I think I&rsquo;m inside a cave.<\/p><p>Oh, there&rsquo;s some light upfront. Let&rsquo;s take a look.<\/p><p>What appears in front of me is a small pond, but it emits a faintly luminous light.<\/p><p>The water seems clear and I can touch it.<\/p><p>I wash my hands, then my face with it.<\/p><p>Wait. Who is this guy?<\/p><p>That was the first question in my head as soon as I saw my reflection in the water.<\/p><p>That&rsquo;s me?<\/p><p>Black hair and a face resembling a young adult, was what I could see.<\/p><p>Who is this?<\/p><p>That&rsquo;s right. I&rsquo;m asking that question.<\/p><p>I have no idea who I am right now. I cannot even recognise my own face.<\/p><p>Memory loss?<\/p><p>No, it cannot be. I know who I am.<\/p><p>I know what I normally look like. I can still imagine it right now.<\/p><p>Ah&hellip; That&rsquo;s right. I died.<\/p><p>All my life, I strived to become the perfect me in other people&rsquo; eyes.<\/p><p>In the end, I achieved nothing. Nobody ever understood me.<\/p><p>I still could hear all of those praises of how talented or how much of a genius I was.<\/p><p>I still could remember the very same people giving me the disappointed looks when I decided to be who I really was for once.<\/p><p>I ran away&hellip; from my family, my future, my life.<\/p><p>On that cold rainy night, I sat with my back against the wall of an old shop, watching others smiling and happily strolled pass.<\/p><p>It was until I saw a pile of steel beams losing their balance above a couple of teenagers.<\/p><p>I yelled at them, but the sound of rain and their umbrellas prevented them from noticing me.<\/p><p>As if my duty called, I ran at them, hoping that I could make it in time.<\/p><p>Well, I did. They were safe.<\/p><p>I remembered them on their knees, panicking and trying to wake me up.<\/p><p>I remembered the street lights slowly dimmed away.<\/p><p>I remembered the agonising pain and helplessness that I felt at the last second.<\/p><p>How could I forget?<\/p><p>So I closed my eyes, then found myself here, in a stranger&rsquo;s body.<\/p><p>It seems like I was reincarnated.<\/p><p>I&rsquo;ve read these stories so many times but I just can&rsquo;t believe it.&nbsp;<\/p><p>I was reincarnated? For what exactly?<\/p><p>I wasted my entire life once. What can I even hope to achieve in this new life?<\/p><p>Is this the work of some Gods up there?<\/p><p>Are they mocking me, or are they feeling pity towards me that they decided to give me another chance?<\/p><p>While falling into deep thoughts, I continue walking and without knowing, I have already arrived at the exit.<\/p><p>What appears in front of me is a great scene of a long running forest and a beautiful blue sky with a crack.<\/p><p>A crack?<\/p><p>There is actually a huge crack in the sky, looking like it&rsquo;s split in half.<\/p><p>What happened? I wonder.<\/p><p>When I look back, it looks like I was really in a cave.<\/p><p>Hm? Has it changed?<\/p><p>I don&rsquo;t believe that the path looks like this before.<\/p><p>Ah&hellip; All of these are giving me a real headache.<\/p><p>Wait, am I naked?<\/p><p>That thought quickly crossed my mind because this seemed to happen very often.<\/p><p>Fortunately, I am wearing pants.<\/p><p>It&rsquo;s ragged and old, but it&rsquo;s enough to cover the vital spot.<\/p><p>I continue walking along any road that I can find for hours.<\/p><p>Jesus. Am I even going to see a single soul out here?<\/p><p>Wait. Is it just me or am I seeing things?<\/p><p>Oh, a town? There&rsquo;s a town up ahead of the road.<\/p><p>I entered.<\/p><p>I cannot express how crazy this is.<\/p><p>The street is not too crowded and there isn&rsquo;t any particular event or festival happening right now.<\/p><p>Rather, it&rsquo;s the people that I&rsquo;m talking about.<\/p><p>Some have long ears, some have horns, and some look like a beast in the upper body.<\/p><p>I&rsquo;ve seen these races so many times in fictional movies but hell, it feels different when I see it with your own eyes.<\/p><p>I&rsquo;m really in a fantasy world.<\/p><p>I look at the huge notice board on the side, and see multiple papers that seem like a bounty pinned on it.<\/p><p>Right in the middle there, a scary looking monster-like face with sharp teeth and horns can be seen.<\/p><p>It also has a red circle just below the image and a number that seems to be higher than the others.<\/p><p>I guess this is one of those dangerous monsters that I need to avoid.<\/p><p>I don&rsquo;t want to get myself killed so early on in this second life.<\/p><p>Somehow or another afterwards, I wandered into a street market.<\/p><p>There is just so much food here.<\/p><p>The smell of them is driving me insane.<\/p><p>I can tell my stomach fully shares the same thought with me right now.<\/p><p>But&hellip; I don&rsquo;t even have a single coin on my body.<\/p><p>What currency do they even use in this world?<\/p><p>&ldquo;How are you doing, sir? Would you like to try out some of our special fried chicken wings?&rdquo;<\/p><p>A man who looked like the owner of the store spoke to me.<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>I&rsquo;m quite surprised. I was originally afraid that I might not be able to communicate with the folks here but for some strange reasons, I can understand what he just said.<\/p><p>I know this is not any of the languages that I&rsquo;ve ever heard of before, but I just&hellip; understand.<\/p><p>However, I don&rsquo;t know what to reply. I don&rsquo;t have money&hellip; and fried chicken wings?<\/p><p>I was expecting something extraordinary in this world, like cockatrice wings or something.<\/p><p>&ldquo;Sir?&rdquo;<\/p><p>The man continued to look at me confusingly.<\/p><p>You still don&rsquo;t get it? Look, I&rsquo;m hungry... but I&rsquo;m broke.<\/p><p>Get me at least a piece for free if you&rsquo;re a decent man. Come on.<\/p><p>&ldquo;Do you want to eat that?&rdquo;<\/p><p>Suddenly, a soft feminine voice came out beside me.<\/p><p>When I turned around, it was a cute looking young lady with dark blue hair and a small ponytail on the side.<\/p><p>I feel ashamed to ever need the help of others when it comes to food, especially when it comes from a cute looking girl like her.<\/p><p>But I nodded anyway.<\/p><p>She bought me two pieces of those fried chicken wings.<\/p><p>I obviously mauled them straight away.<\/p><p>&ldquo;Are you homeless?&rdquo;<\/p><p>This hits my heart harder than anything else.<\/p><p>Do I look like a homeless person to you?<\/p><p>That&rsquo;s what I really want to say but she&rsquo;s right.<\/p><p>I&rsquo;m homeless. God damn it.<\/p><p>&ldquo;Yes.&rdquo; I uttered my reply in shame.<\/p><p>&ldquo;I&rsquo;m sorry. I cannot repay you for your kindness.&rdquo; I continued on.<\/p><p>&ldquo;It&rsquo;s alright. You don&rsquo;t need to repay me. I just want to help people who are in need of help.&rdquo;<\/p><p>Is she an angel? Who else would do something like this and say these words afterwards?<\/p><p>&ldquo;Do you need a place to stay? It might get cold at night.&rdquo; She asked.<\/p><p>I cannot believe it myself. A beautiful girl asked me to stay for a night.<\/p><p>I think I&rsquo;m slowly starting my protagonist arc like those trending reincarnation stories.<\/p><p>&ldquo;I&rsquo;d really love to, but&hellip; doesn&rsquo;t it trouble you too much?&rdquo;<\/p><p>That&rsquo;s right. I need to be humble.<\/p><p>I cannot take the offer too quickly or it might look like I&rsquo;m too clingy.<\/p><p>&ldquo;No. Definitely not. As I said before, I feel glad that I can offer help.&rdquo;<\/p><p>It&rsquo;s been confirmed that she&rsquo;s an angel.<\/p><p>I followed her down a few streets.<\/p><p>&ldquo;It&rsquo;s just around the corner.&rdquo;<\/p><p>She&rsquo;s guiding me to her house.<\/p><p>I never knew that it&rsquo;s such a pleasant feeling to follow a girl to her place.<\/p><p>Wait a minute.<\/p><p>We turned around the corner, yet this does not seem like a shelter to me at all.<\/p><p>It&rsquo;s a small and dark alley, with a dead end.<\/p><p>&ldquo;Excuse me, but I think there is some kind of mistake here?&rdquo;<\/p><p>I don&rsquo;t want to embarrass her by telling her directly that she got lost.<\/p><p>&ldquo;No, there isn&rsquo;t.&rdquo;<\/p><p>She confidently replies without turning back.<\/p><p>Now this seems wrong. I think I should get out of here.<\/p><p>I turned around, and there were already another two huge guys behind me, blocking the path.<\/p><p>&ldquo;Is this the fine good you&rsquo;re talking about?&rdquo; One of the men spoke.<\/p><p>Excuse me, but good?<\/p><p>Shit. This really does not sound good to me at all.<\/p><p>&ldquo;I think I&rsquo;m fine with sleeping on the street tonight. Thank you for your earlier kindness. I will definitely repay them in the future.&rdquo;<\/p><p>I quickly spoke and hoped that I could still turn this around.<\/p><p>!!!<\/p><p>What the fuck.<\/p><p>One of those guys just punched me right in the face.<\/p><p>Argh&hellip; That freaking hurts.<\/p><p>I need to get my ass out of here.<\/p><p>I turn back to the girl and try to run with my full speed, hoping that I can get past her.<\/p><p>It&rsquo;s better to face a cute girl than two juggernauts, isn&rsquo;t it?<\/p><p>But dear, I was wrong.<\/p><p>She whipped out the chain that I had no idea where she was hiding it from and wrapped it around me before I could even react.<\/p><p>Alright. I&rsquo;m sorry.<\/p><p>I might have some impudent thoughts but I was in the wrong.<\/p><p>Would saying these words save me from this trouble?<\/p><p>I wish it could.<\/p><p>I try to break out of the chain but the other two guys catch up and want to hand me my second fist meal of the day.<\/p><p>Out of intuition, I dodge it but I get myself tripped and fall down on my left arm.<\/p><p>Before I can recover my standing, one of the guys throws a strong kick at my abdomen.<\/p><p>I cough out what I hope isn&rsquo;t blood.<\/p><p>The other guy quickly pins me down and with his huge ass, I don&rsquo;t have a hope of getting out of this anymore.<\/p><p>The cute girl walks over, bends down and with her finger, she tastes my blood.<\/p><p>&ldquo;This blood. This taste. It&rsquo;s amazing.&rdquo;<\/p><p>Okay...<\/p><p>&ldquo;I haven&rsquo;t had this for a very long time.&rdquo; She seemed pleased with my blood.<\/p><p>I don&rsquo;t know if it&rsquo;s something I should be proud of right now.<\/p><p>&ldquo;Take him to the butcher. His organs should be able to get us some decent meals for the next few months.&rdquo;<\/p><p>Oh no... It&rsquo;s these organ trafficking crimes that I saw from the news back then.<\/p><p>Am I going to die again?<\/p><p>Only a few hours after my reincarnation?<\/p><p>Is that it? I only last for a few hours?!<\/p><p>!!!<\/p><p>Before I even realise, the huge guy on top of me already flies away.<\/p><p>Then in the next moment, the other guy is cut in half.<\/p><p>Terrified, the cute girl is shaking immensely.<\/p><p>&ldquo;No&hellip; Please&hellip; Have I offended you?&rdquo;<\/p><p>She looks like she&rsquo;s begging, but not for long before her head flies off.<\/p><p>They just&hellip; died. Right. In. Front. Of. Me.<\/p><p>&ldquo;Don&rsquo;t need to pity them. They are long wanted criminals. The streets are better without them.&rdquo;<\/p><p>A lady-like voice answered as if she could read my thoughts.<\/p><p>I try my best to sit up and take a better look at my saviour<\/p><p>It&rsquo;s another beauty with long bright blue hair, but compared to the one before, this one has a much better body proportion.<\/p><p>If the one before was cute, this one would be the beautiful one.<\/p><p>I quickly noticed the bloodied claymore on her hand, which summed up why she was wearing partially armour.<\/p><p>&ldquo;Are you okay?&rdquo; She asked.<\/p><p>Do I look like I&rsquo;m okay to you?<\/p><p>I wanted to say that, but when I looked properly, my wounds were not that serious.<\/p><p>The blood from my nose has already stopped.<\/p><p>&ldquo;Come. I&rsquo;ll help you.&rdquo; She spoke shortly.<\/p><p>I followed her to her place.<\/p><p>I know this was a dumb idea but I just wasn&rsquo;t the brightest guy in this area.<\/p><p>However, this time, it&rsquo;s the real one. She&rsquo;s currently living in the inn.<\/p><p>When we enter, the inn keeper and other nearby drinkers greet her.<\/p><p>It seems like she&rsquo;s already here for a while.<\/p><p>In her room, she takes out a box that has several first-aid items and hands it over to me.<\/p><p>&ldquo;Use them and cover up your wound. I&rsquo;ll wash myself off the blood first.&rdquo;<\/p><p>She spoke coldly, but I could feel a sense of warmth in there.<\/p><p>&ldquo;Wait. May I ask who you are?&rdquo;<\/p><p>I wanted to know just who exactly saved me.<\/p><p>&ldquo;Maria.&rdquo;<\/p><p>She answered bluntly and entered the bathroom.<\/p><p>Maria, is it? That&rsquo;s not a bad name.<\/p><p>I take up a bandaging roll and plan to wrap around the wound from my left arm when I fell earlier.<\/p><p>&ldquo;What&rsquo;s your name?&rdquo; A voice came out from within the bathroom.<\/p><p>&ldquo;Me?&rdquo;<\/p><p>&ldquo;Who else?&rdquo;<\/p><p>Yes, that was stupid. Why would I ask that?<\/p><p>But what&rsquo;s my name? Should I just use my real name from my previous life?<\/p><p>&ldquo;I&hellip; don&rsquo;t know.&rdquo;<\/p><p>&ldquo;You don&rsquo;t know?&rdquo;<\/p><p>&ldquo;Yes. I don&rsquo;t know.&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>It seems that she does not understand why I do not have a name.<\/p><p>Maybe here, even the homeless guy on the street would have a name.<\/p><p>Of course, I am not comparing myself to these guys but still, I might have looked even below them without knowing my own name.<\/p><p>&ldquo;I&rsquo;m not from this world.&rdquo; I explained.<\/p><p>I think it is alright to tell the truth. My truth, at least.<\/p><p>&ldquo;What do you mean?&rdquo; She replied.<\/p><p>&ldquo;I was reincarnated into this world.&rdquo;<\/p><p>&ldquo;Reincarnated?&rdquo;<\/p><p>&ldquo;Yes, when someone dies and is reborn in another body.&rdquo;<\/p><p>&ldquo;I know what reincarnation is.&rdquo;<\/p><p>&ldquo;Oh&hellip; Pardon me.&rdquo;<\/p><p>I feel pretty stupid now to explain the concept of reincarnation.<\/p><p>Everybody knows that.<\/p><p>&ldquo;Do you know who you were?&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>Should I tell her?<\/p><p>I remember that things never end up in a good way when a protagonist tells other people about the reincarnation.<\/p><p>&ldquo;I don&rsquo;t know.&rdquo; Let&rsquo;s just avoid the question for now.<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>As I suspected, she went quiet after.<\/p><p>She must be thinking what kind of odd ball she was talking to.<\/p><p>&ldquo;Do you know what mana is?&rdquo;<\/p><p>&ldquo;Mana?&rdquo;<\/p><p>I know what mana is but I just want to confirm what it really is in this world.<\/p><p>&ldquo;Mana fills this world. We are also born with initial mana within our bodies.&rdquo;<\/p><p>&ldquo;I see.&rdquo;<\/p><p>&ldquo;The reason why those criminals targeted you earlier was so that they could extract your organs, which should have contained fragments of your mana, and sell them to the rich.&rdquo;<\/p><p>&ldquo;What?&rdquo;<\/p><p>&ldquo;People seek this because they believe this is the easiest way to become stronger. The amount of mana determines how strong you are.&rdquo;<\/p><p>&ldquo;So they just conduct cannibalism here?&rdquo;<\/p><p>&ldquo;No. There are alchemists who extract the mana out of your organs and create some sort of drinkable potions. They can also use your mana to craft many other artifacts too.&rdquo;<\/p><p>&ldquo;Seriously?&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>&ldquo;Sorry, please continue on.&rdquo;<\/p><p>&ldquo;While some have the ability to tell, for the ordinary ones, there are devices out there that could estimate the amount of mana a person has.&rdquo;<\/p><p>&ldquo;I see.&rdquo;<\/p><p>&ldquo;You must have possessed a high volume of mana within your body. That was why those guys targeted you.&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>So, in other words, I am supposed to be strong?<\/p><p>&ldquo;Does that mean I can use a lot of powerful magic spells?&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>Was that something odd to ask?<\/p><p>If you were told that you had a large volume of mana, wouldn&rsquo;t that mean you could cast powerful spells endlessly?<\/p><p>&ldquo;It does not work that way in this world.&rdquo;<\/p><p>She said in this world. I think she actually takes up my words of being reincarnated.&nbsp;<\/p><p>I&rsquo;m glad.<\/p><p>&ldquo;Argh&hellip;&rdquo; She muttered.<\/p><p>&ldquo;What&rsquo;s wrong?&rdquo;<\/p><p>&ldquo;I think I was injured earlier.&rdquo;<\/p><p>&ldquo;Oh&hellip; Sorry.&rdquo;<\/p><p>I feel bad that she got hurt because of me.<\/p><p>&ldquo;Can you help me?&rdquo; She asked.<\/p><p>&ldquo;Help&hellip; you?&rdquo;<\/p><p>What, seriously? Are you asking me to help you, while you&rsquo;re in the bathroom?<\/p><p>In the first place, what can I even help you with?<\/p><p>&ldquo;Can you bring me the box?&rdquo;<\/p><p>Ah, the first-aid. That&rsquo;s right. She gave it to me.<\/p><p>&ldquo;Here.&rdquo;<\/p><p>I opened the door slightly, just enough to shove the box in.<\/p><p>I wanted to take a peek but I would feel extremely guilty to do that to my saviour.<\/p><p>&ldquo;I&hellip; can&rsquo;t reach it.&rdquo;<\/p><p>What? Was she really that hurt to not be able to walk just a few steps?<\/p><p>Blood. I can clearly see them on the floor.<\/p><p>This is bad.<\/p><p>I shouldn&rsquo;t think too much about this. Plus, she was the one who asked me anyway.<\/p><p>&ldquo;Coming in.&rdquo;<\/p><p>I opened the door and entered.<\/p><p>Wow. She&rsquo;s actually naked.<\/p><p>From her back, I could see a gorgeous body shape, so alluring that I might jump over at any second.<\/p><p>But a large cut mark was also there. This explains the blood on the floor.<\/p><p>It&rsquo;s odd though. I cannot recall that she was even injured by those guys.<\/p><p>Well, it must be one of those old wounds seeing how she must have been battling criminals multiple times.<\/p><p>I take out the disinfection bottle and the bandaging roll.<\/p><p>&ldquo;Do you&hellip; Can you do it by yourself?&rdquo; I asked.<\/p><p>It&rsquo;s better if I can make sure first.<\/p><p>&ldquo;No&hellip; I can&rsquo;t.&rdquo; She replied.<\/p><p>Yay.<\/p><p>No, I should not be happy, or even excited over this.<\/p><p>I&rsquo;m so despicable to even think of it this way.<\/p><p>I&rsquo;m applying the medicine on her wound and carefully wrapping the bandage over the wound.<\/p><p>Once every while, I can hear her moan from the pain.<\/p><p>Don&rsquo;t get aroused by it. Don&rsquo;t get aroused by it!<\/p><p>I repeatedly tell myself.<\/p><p>You have no idea how difficult it is to hold myself back from this softness during the contact.<\/p><p>&ldquo;Thank you.&rdquo;<\/p><p>&ldquo;No worries. I should be the one to thank you in the first place.&rdquo;<\/p><p>I&rsquo;ve finished with the bandaging process.<\/p><p>I think it&rsquo;s not nice for me to continue staying here so I turn around and plan to leave.<\/p><p>&ldquo;Wait&hellip;&rdquo;<\/p><p>She holds me back.<\/p><p>Her hand is keeping me from leaving the bathroom.<\/p><p>For this to happen, I believe she is facing me right now.<\/p><p>Should I turn around?<\/p><p>&ldquo;Don&rsquo;t leave.&rdquo; She begged.<\/p><p>&ldquo;Sorry, but&hellip;&rdquo;<\/p><p>&ldquo;Don&rsquo;t leave.&rdquo;<\/p><p>She repeated, so I stopped.<\/p><p>&ldquo;It&rsquo;s been a while since someone speaks to me.&rdquo;<\/p><p>Is she confessing now?<\/p><p>Regardless, I thought she was popular.<\/p><p>Are all the men in this world blind or something to not talk to such a beauty like her?<\/p><p>&ldquo;I don&rsquo;t know why, but people have always been avoiding me.&rdquo;<\/p><p>Avoiding her, who the hell would?<\/p><p>&ldquo;Over time, I could only feel sad and lonely.<\/p><p>I tried to be friendly and open to the people around me but&hellip; I just could not.<\/p><p>I&rsquo;m bad at communicating. Each time, I could only speak a few words.<\/p><p>At the beginning, it was alright, but later on, people would start to get annoyed by it.<\/p><p>They would say things like I don&rsquo;t care about them or how cold I am.<\/p><p>But I&rsquo;m not.&rdquo;<\/p><p>&ldquo;I&rsquo;m sorry to hear that.&rdquo;<\/p><p>I would have never thought that a beautiful girl like her would be this depressed.<\/p><p>Just as I thought that, she embraced me from behind.<\/p><p>Her arms wrapped around my body and I could feel the softness and plump from her flesh on my back.<\/p><p>&ldquo;So please&hellip; don&rsquo;t leave me.&rdquo;<\/p><p>&ldquo;No. I won&rsquo;t.&rdquo;<\/p><p>What kind of man would I be if I was to leave you in this state?<\/p><p>&ldquo;Thank you. I&rsquo;m so touched.&rdquo;<\/p><p>I&rsquo;m glad she feels this way about me.<\/p><p>&ldquo;I just want to stay by your side forever.&rdquo;<\/p><p>Wait, isn&rsquo;t this going too fast?<\/p><p>We&rsquo;ve only just met.<\/p><p>&ldquo;I think I cannot hold back anymore&hellip;&rdquo;<\/p><p>Woah what do you mean by you cannot hold back anymore?<\/p><p>Seriously, I am going to turn...<\/p><p>!!!<\/p><p>&ldquo;Harhh!&rdquo;<\/p><p>What is going on? Where am I?<\/p><p>I look around and find myself inside a cave.<\/p><p>What happened? My head hurts but I slowly recall.<\/p><p>I was supposed to embrace Maria, but before I could turn around, something knocked me out.<\/p><p>Were we attacked? If that is so, I need to find her now.<\/p><p>&ldquo;GRAAAHHHHH!!!&rdquo;<\/p><p>&ldquo;Holyshit! What was that?!&rdquo;<\/p><p>What appears in front of me is a huge monster with sharp spikes all over the body.<\/p><p>It stares at me with an open mouth, full of large and sharp teeth, but it cannot reach me due to the chains on its limbs.<\/p><p>This&hellip; is the same one from the notice board?<\/p><p>No way. I am going to die for sure this time.<\/p><p>&ldquo;I&rsquo;m trying to hold back for so long&hellip; but I cannot anymore.&rdquo;<\/p><p>This sound&hellip; It&rsquo;s Maria.<\/p><p>&ldquo;The moment I saw you, I could tell the amount of mana inside you was absurd. When the other criminals went for you as well, it confirmed my findings. I knew that I would do anything to get you here.&rdquo; She spoke in a wicked tone.<\/p><p>&ldquo;Wait a second. I don&rsquo;t get this. What is going on here?&rdquo;<\/p><p>If I was in my previous life, I would never ask this. I would be pissing my pants right now.<\/p><p>Maybe it was because this is the second life and it&rsquo;s not my real body, I feel calm enough to still ask questions.<\/p><p>&ldquo;It&rsquo;s simple. It eats you, becomes stronger then kills everybody.&rdquo;<\/p><p>&ldquo;What? Why would you want to do that? And why me?&rdquo;<\/p><p>I know that I&rsquo;m in deep trouble now but I still don&rsquo;t understand her motive and the whole thing behind everything that happened today.<\/p><p>Click*<\/p><p>The rest of the chains holding onto this monstrous beast fell out from the wall behind it, giving it more freedom on its movement.<\/p><p>&ldquo;Oh shit&hellip;&rdquo;<\/p><p>It then leaps at me. I evade to the side and roll under its right arm to get behind it.<\/p><p>I struggle to get my balance since both of my arms are tied up.<\/p><p>Before I can even get up, it swings its gigantic arm at me, sending me straight into the wall at the back.<\/p><p>&ldquo;Not again&hellip;&rdquo; I coughed out drops of blood.<\/p><p>That hit must have fractured some of my bones or organs.<\/p><p>&ldquo;Why are you running, dear?&rdquo; Maria smirked from the corner, faraway from the beast.<\/p><p>&ldquo;What do you mean by why am I running? You&rsquo;re trying to kill me!&rdquo; I angrily shouted.<\/p><p>&ldquo;But you were so excited a moment ago. I was going to grant you a painless and happy death. Isn&rsquo;t it what every man desires?&rdquo;<\/p><p>&ldquo;As if...&rdquo;<\/p><p>I struggle but still manage to get on my feet. Luckily the hit from earlier managed to cut off the rope around my wrists so now I can move around a bit more easier.<\/p><p>&ldquo;How cute of you&hellip;&rdquo; Her voice sickens me.<\/p><p>The monster turns around and readies to enjoy its meal.<\/p><p>My vision is fading from the blood loss. This is not looking good at all.<\/p><p>On my first day and I&rsquo;m hanging on the death rope twice already?<\/p><p>I refuse to accept this!<\/p><p>I try to get away but the monster is right in front of me.<\/p><p>From the side, Maria is laughing&hellip; wickedly.<\/p><p>&ldquo;Go on and enjoy your next--- reincarnation.&rdquo;<\/p><p>The monster swings its arm up and smashes me.<\/p><p>!!!<\/p><p>&ldquo;What is this?!&rdquo;&nbsp;<\/p><p>I&rsquo;m still alive.<\/p><p>I look up and see myself holding a black sword, blocking the monster&rsquo;s arm.<\/p><p>I can sense some energy within myself so I strongly push the monster&rsquo;s arm away.<\/p><p>For some odd reasons, I can feel more strength flowing within my body.<\/p><p>What is this sword? Is this my power?<\/p><p>&ldquo;You! You have a Blessing?!&rdquo; Maria shouted.<\/p><p>Blessing? What the heck are you talking about?<\/p><p>Is this what they call the weapon here?<\/p><p>Suddenly, the monster leaps at me again to rip me apart.<\/p><p>I step aside and swing my sword almost naturally, cutting its waist.<\/p><p>&ldquo;Arghhh!!!&rdquo; It cried.<\/p><p>What is going on? Why do I know what to do?<\/p><p>Am I doing this on my own or is this sword guiding me?<\/p><p>The normal me from previous life would have pissed his pants but I don&rsquo;t know why I don&rsquo;t feel afraid to stand up against this monstrous beast.<\/p><p>Is it&hellip; because of this body that I&rsquo;m currently in?<\/p><p>The monster does not let me continue my thought process and slashes angrily at me.<\/p><p>However, it results in the monster losing one of its arms.<\/p><p>Seeing the arm fly off in a single cut, I believe that this sword is very sharp.<\/p><p>I have to be careful when handling it.<\/p><p>I feel that I&rsquo;m slowly turning this around.<\/p><p>The monster becomes even more enraged and its body expands.<\/p><p>The arm that I just cut off grows back and the spikes on its back also become larger.<\/p><p>Man&hellip; Did I speak too soon?<\/p><p>The monster charges right at me, as if it will crush everything on its path.<\/p><p>I grab firmly on my sword, and just when the monster is able to hit me, I evade the attack and counter it with a side sweep.<\/p><p>Before I could finish my slash, the monster slams its arm on me and sends me rolling back to where I woke up.<\/p><p>My sword is now stuck on its waist.<\/p><p>&ldquo;What am I going to do now&hellip;&rdquo; I asked myself in desperation.<\/p><p>However, the monster is hesitating a bit.<\/p><p>&ldquo;What&rsquo;s going on?&rdquo; Even Maria is unsure of the monster&rsquo;s behaviour.<\/p><p>I see it.<\/p><p>The black sword that stabs onto its waist is spreading out some kinds of corrosion and causing the area around it to crumble.<\/p><p>The monster grabs the sword but the pain sears through its hand.<\/p><p>However, it&rsquo;s still able to pull out the sword since it wasn&rsquo;t a deep cut and throws it away.<\/p><p>&ldquo;What is that sword? How are you able to do this?&rdquo; Maria asked.<\/p><p>As if I know. It still doesn&rsquo;t matter anyway.<\/p><p>I can no longer move my body.<\/p><p>I can tell some of my ribs are broken and my organs are damaged.<\/p><p>Blood is oozing out nonstop from both my mouth and my abdomen.<\/p><p>Hah&hellip; How foolish of myself to even think that I would ever be any protagonist.<\/p><p>I close my eyes and accept my defeat.<\/p><p>&ldquo;Ice Lance.&rdquo;<\/p><p>!!!<\/p><p>I open my eyes again to see dozens of lances made out of ice flying towards the monster, forcing it back to the wall.<\/p><p>The monster roars and wants to retaliate but its feet are frozen already.<\/p><p>&ldquo;Icicle Crash.&rdquo;<\/p><p>Another wave of sharp ice appears out of nowhere and rains down on the monster.<\/p><p>&ldquo;GRAAAHHHHH!!!&rdquo;<\/p><p>One last roar comes out before the monster falls.<\/p><p>&ldquo;Are you okay?&rdquo; A soft and charming voice comes out behind me.<\/p><p>The image is vivid but it appears like another young lady has come to my aid.<\/p><p>Ah&hellip; I&rsquo;m tired. It feels like the same thing is repeating itself.<\/p><p>I close my eyes and succumb to the darkness.<\/p>"
}]