[{	
	"html" : "<p>Next morning, just a normal day in a small town called Dayswen.<\/p><p>&ldquo;Please don&rsquo;t ever do this again.&rdquo;<\/p><p>&ldquo;What do you mean? I saved him.&rdquo;<\/p><p>&ldquo;You put yourself in danger for a random stranger, milady. That is not acceptable.&rdquo;<\/p><p>&ldquo;But&hellip; the other method would be too late.&rdquo;<\/p><p>&ldquo;Our objective was to slay the Hellspawn haunting this area, not risking your life over a &lsquo;nobody&rsquo;. We were supposed to notify the Guild and let them do the job.&rdquo;<\/p><p>&ldquo;If we went back to let the Guild know, this man here would be dead!&rdquo;<\/p><p>&ldquo;Who cares if he dies. Do you even realise how much more your life weighs compared to him?&rdquo;<\/p><p>There are two sounds that seem to be arguing with each other.<\/p><p>One is a deep man sound while the other is a familiar lady's voice that I heard before I fainted.<\/p><p>&ldquo;You don&rsquo;t know that! Didn&rsquo;t you see his Blessing?&rdquo; She argued.<\/p><p>&ldquo;What? A sword? There are tons of others out there who have this type.&rdquo;<\/p><p>&ldquo;It&rsquo;s not just a sword! It&rsquo;s the sword from&hellip;&rdquo; She suddenly stopped.<\/p><p>&ldquo;Hey, he wakes up.&rdquo; The man interrupted.<\/p><p>Both of them turn their attention to me as she quickly walks over.<\/p><p>&ldquo;You&rsquo;re awake?&rdquo; She spoke softly.<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>She has clear blue eyes and beautiful smooth silver hair tied up in a knot shape behind.<\/p><p>She smiles at me. A smile that feels like it can even melt the ever-lasting ice.<\/p><p>No, stop. I will not be tricked anymore. Not for the third time!<\/p><p>&ldquo;Sorry that we took so long to come. Please forgive us.&rdquo;<\/p><p>&ldquo;No&hellip; It was me who needed to thank you&hellip;&rdquo; I tried my best to reply despite the pain.<\/p><p>&ldquo;Thanks&hellip; for saving me.&rdquo; I continued.<\/p><p>&ldquo;You better be grateful.&rdquo; The man snorted at me.<\/p><p>Looking at it, he&rsquo;s a middle-aged man with an area of grey hair mixed with faded black. I guess he&rsquo;s in his mid forty.<\/p><p>His attitude reminds me of the saying that the older a ginger gets, the spicier it becomes.<\/p><p>&ldquo;Don&rsquo;t worry about him. I&rsquo;m just glad that you&rsquo;re alright.&rdquo;<\/p><p>The girl pulls up a chair and sits beside me.<\/p><p>&ldquo;My name is Ciarra, and the man behind me is Amandus. Nice to meet you.&rdquo; She spoke.<\/p><p>&ldquo;Nice to meet you too.&rdquo; I replied.<\/p><p>Since she formally introduces herself, I feel that I was supposed to do the same but I just don&rsquo;t feel like opening up to anybody anymore.<\/p><p>&ldquo;Brat. She already introduced herself first. It&rsquo;s your turn now. Who are you?&rdquo; The man asked.<\/p><p>&ldquo;...&rdquo; I ignored him.<\/p><p>&ldquo;Stop it, Amandus.&rdquo;<\/p><p>So the girl&rsquo;s name is Ciarra and the man&rsquo;s name is Amandus.<\/p><p>&ldquo;I&rsquo;m sorry to ask you this since you only just got up.&rdquo; She tried to be as polite as possible.<\/p><p>&ldquo;Go ahead.&rdquo; I replied.<\/p><p>&ldquo;How did you possess that Blessing?&rdquo;<\/p><p>&ldquo;Do you mean the sword?&rdquo;<\/p><p>&ldquo;Yes. The black sword that you used to fence back the Hellspawn.&rdquo;<\/p><p>&ldquo;I don&rsquo;t know. It was just there.&rdquo;<\/p><p>&ldquo;Are you kidding me? What do you mean it was just there?&rdquo; Amandus slowly loses his patience.<\/p><p>&ldquo;I understand that you may want to keep it a secret, but this is an urgent matter. Your cooperation can save this kingdom.&rdquo; Ciarra stops him.<\/p><p>&ldquo;No&hellip; Seriously, I do not know. I thought I was going to die and suddenly, the sword appeared.&rdquo; I replied.<\/p><p>&ldquo;I see&hellip; So you have only just awoken your Blessing.&rdquo;<\/p><p>&ldquo;I&rsquo;m sorry but can you elaborate more about this? What exactly is a Blessing?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>Both of them look at me in confusion, or rather, in a bit of shock.<\/p><p>&ldquo;You don&rsquo;t know what a Blessing is?&rdquo; She asked again to clarify.<\/p><p>&ldquo;Yes. I&rsquo;m new around here.&rdquo; I replied.<\/p><p>&ldquo;As if. Everybody in the world knows that a Blessing is. Stop it, milady. This guy is just playing tricks on us.&rdquo; Amandus argued.<\/p><p>&ldquo;Amandus.&rdquo; She stared right at him as if she wanted to remind him of his position.<\/p><p>He pouted and looked away. What a pain&hellip;<\/p><p>&ldquo;A Blessing is a gift bestowed to us by the Above. It grants us the ability to fight back against the monstrous creatures called Hellspawn. You encountered one yesterday.&rdquo;<\/p><p>&ldquo;Is it similar to magic?&rdquo;<\/p><p>&ldquo;Not exactly. Magic, from many fantasy books, is meant to be many forms of spells and abilities, whether Blessing is a very focused ability that is bound to the individual.&rdquo;<\/p><p>I can&rsquo;t believe that they consider magic as fantasy yet Blessing a natural thing, but thinking about it in their perspectives, it kinda makes sense.<\/p><p>&ldquo;To make an example, if a person&rsquo;s Blessing is Fire Manipulation, that person cannot control any other element, such as water or wind.&rdquo;<\/p><p>&ldquo;I see. Does Blessing require mana to be used?&rdquo;<\/p><p>&ldquo;Oh, it&rsquo;s good that you are aware of mana. To answer your question, no, it does not, but the Blessing&rsquo;s effect is greatly affected by the mana pool within the individual.<\/p><p>Those who have low or almost no mana can still use their Blessing in the most basic form, such as a tiny flame on the finger.&nbsp;<\/p><p>The reason is because mana already exists around us so it can be absorbed into the initiation of Blessing.&rdquo;<\/p><p>&ldquo;I see. Thanks for the explanation. It&rsquo;s very clear.&rdquo; I appreciated her mini lecture.<\/p><p>&ldquo;No worries.&rdquo; She replied.<\/p><p>After a brief pause, she continues.<\/p><p>&ldquo;Our kingdom is in danger.&rdquo;<\/p><p>&ldquo;I beg your pardon?&rdquo; I replied.<\/p><p>&ldquo;The kingdom has been overrun by Hellspawns for a while, but now, the situation has escalated even further. The Hellspawns had infiltrated the royals and took control over Dawnguard, our capital city.<\/p><p>I know you might not believe me at first, but it is true. To prevent them from spreading their influence further, I need help from strong individuals.&rdquo;<\/p><p>So, they call this kingdom by the name of Velder and Dawnguard as the capital city.<\/p><p>However, what is she trying to do by asking the guy who got tricked twice on the same day to help?<\/p><p>If she was the first one to approach me yesterday, I would have believed her.<\/p><p>&ldquo;We&rsquo;ve been following you since you first stepped into the town.&rdquo;<\/p><p>&ldquo;What?&rdquo; I responded.<\/p><p>&ldquo;We saw you were cornered by some bad guys, and were saved by a mysterious woman. Shortly after going inside the inn, we saw her carrying a large bag back out so we decided to follow her. That was how we ended up finding you and that Hellspawn in the cave.&rdquo;<\/p><p>&ldquo;You saw me going through all of that and you didn&rsquo;t do anything to prevent it from happening?&rdquo;<\/p><p>I know I sounded ridiculous but I went through a roller coaster of pain and betrayals that could have been prevented.<\/p><p>&ldquo;Sorry.&rdquo;<\/p><p>&ldquo;Sorry? I could have died there.&rdquo;<\/p><p>In my mind, I know that it&rsquo;s not something I should say to my saviour but I just could not hold down my frustration.<\/p><p>&ldquo;You!&rdquo; Amandus tried to silent me but Ciarra held him back.<\/p><p>&ldquo;We thought you could have handled it.&rdquo;<\/p><p>&ldquo;Handle it? How?&rdquo;<\/p><p>&ldquo;I&rsquo;m not sure if you&rsquo;re even aware of it, but you possess an incredibly huge mana pool.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;I cannot estimate exactly how large it is. We can only measure the amount of mana that is not too different from our own.<\/p><p>I was not able to measure your mana pool so I could only assume that you were stronger than me. I&rsquo;m sorry.&rdquo; She apologised deeply.<\/p><p>&ldquo;It&rsquo;s fine. Don&rsquo;t worry about it. I survived anyway thanks to your help in the end.&rdquo; I brushed it off.<\/p><p>&ldquo;Ungrateful bastard.&rdquo; Amandus murmured.<\/p><p>He was right. I am an ungrateful bastard, but I don&rsquo;t care.&nbsp;<\/p><p>Since my previous life, I was always used by others around me. Even when I came here, I was betrayed twice on the first day.<\/p><p>I bet that the reason why these two saved me was so that they could recruit me into their kingdom-saving game.<\/p><p>&ldquo;Anyway, I need to go. Have a good day.&rdquo;<\/p><p>I stand up and plan to leave.<\/p><p>&ldquo;What?&rdquo; She spoke up in surprise.<\/p><p>&ldquo;Wait.&rdquo; She called out.<\/p><p>&ldquo;What? I already thanked you for saving my life, but I don&rsquo;t have anything else to offer or repay you with.&rdquo; I replied.<\/p><p>&ldquo;No, it&rsquo;s not about that. My request. You haven&rsquo;t given me the answer.&rdquo; She asked while still looking confused.<\/p><p>See. At the end of the day, they only wanted something from me again.<\/p><p>&ldquo;I decline.&rdquo; I coldly replied.<\/p><p>I&rsquo;m not going to let others take advantage of me anymore.<\/p><p>Moreover, I don&rsquo;t even know what&rsquo;s going on in this world, nevertheless for the kingdom&rsquo;s sake.<\/p><p>All I need right now is a place where I can find my peace of mind.<\/p><p>&ldquo;Why? You have potential. You just haven&rsquo;t fully utilised your Blessing yet.&rdquo;<\/p><p>I don&rsquo;t know why she&rsquo;s asking this as if it&rsquo;s not obvious.<\/p><p>Does she actually believe that everybody loves their kingdom to the point of risking their lives?<\/p><p>I don&rsquo;t know about others but I am not the hero that you&rsquo;re looking for.<\/p><p>&ldquo;It&rsquo;s troublesome.&rdquo; I replied and left.<\/p><p>Seeing me leaving, she doesn&rsquo;t speak another word.<\/p><p>And now, I&rsquo;m out.<\/p><p>Weird things keep happening around me.<\/p><p>I&rsquo;m still trying to process what&rsquo;s been happening after all.<\/p><p>Based on what she said earlier, this kingdom must be in a terrible state already with monsters called Hellspawns running freely everywhere.<\/p><p>Now it&rsquo;s even worse because the capital city, where I assume is the safehold of many kingdoms, is overtaken by Hellspawns.<\/p><p>Moreover, how could a Hellspawn even infiltrate the city? Does it kill some humans and take over the bodies?<\/p><p>But what about Maria&rsquo;s case? She was a human, but she tried to feed a Hellspawn.<\/p><p>She mentioned that she wanted it to kill everyone so I guess she must have some kind of grudge against the people in this town or the entire human race in general.<\/p><p>Talking about Maria, did she get away?<\/p><p>Neither Ciarra or Amandus mentioned about her so maybe they weren&rsquo;t able to catch her after defeating the Hellspawn.<\/p><p>If she&rsquo;s still around, it&rsquo;s best if I can quickly find a safe place to stay around.<\/p><p>Well, Ciarra&rsquo;s offer doesn&rsquo;t sound too bad now if this is the case as she has the power to protect me. I assume Amandus may also have something similar.<\/p><p>Ah&hellip; I look at myself and realise that I now have a plain white shirt. I see that they not only saved me, but also gave me something.<\/p><p>Now I feel like a spoiled brat, but a man gotta keep his conviction. If I walk back, I would look like a total loser.<\/p><p>!!!<\/p><p>Loud noise can be heard from afar.<\/p><p>I wonder what&rsquo;s going on. Let&rsquo;s take a look.<\/p><p>What&rsquo;s in front of me is the town&rsquo;s folks standing by the side, opening a wide path in the middle.<\/p><p>It&rsquo;s a marching of the knights.<\/p><p>These knights in heavy armour are around thirty five to forty in number.<\/p><p>Leading them is a man with an armour set that seems to be of higher class than the ordinary knights.<\/p><p>I don&rsquo;t know the actual ranking but I can still tell from the pattern of the armour and the light reflected from it.<\/p><p>His armour fully covers his entire body and face so no one can tell what he looks like.<\/p><p>Meanwhile, there&rsquo;s a lady behind him with short and curly red hair.<\/p><p>It seems that she&rsquo;s quite attractive as I notice several men unable to take their eyes off her.<\/p><p>She wields a cold smile and doesn&rsquo;t even bother looking back at those lustful men.<\/p><p>!!!<\/p><p>Suddenly, she glances at me.<\/p><p>I quickly look away. That was dangerous.<\/p><p>I swear I did not look at her with the same eyes as those guys. It was just out of curiosity.<\/p><p>When I realise, the rest of the knights have already marched on.<\/p><p>&ldquo;Phew.&rdquo; I blew off with a sign of relief.<\/p><p>Anyway, I need a place to stay for the night. Let&rsquo;s head over to an inn.<\/p><p>I wonder how much a night costs in this town.<\/p><p>Wait. I don&rsquo;t have money.<\/p><p>No. No. No.<\/p><p>Why am I so stupid? How am I even going to survive without a single coin on me?<\/p><p>Okay. Calm down. Let&rsquo;s think of a solution.<\/p><p>Ah! Ciarra and Amandus.<\/p><p>I guess my conviction only lasted for a few minutes.<\/p><p>I quickly head back and to my surprise, I meet those knights again.<\/p><p>But this time, they are&hellip; surrounding the inn that I just left?<\/p><p>So, what she said earlier was all true, wasn&rsquo;t it?<\/p><p>The higher-ups must have caught up to her now.<\/p><p>I can imagine she gets labeled as a rebel, then gets dragged outside to the public and executed.<\/p><p>She might even have been killed inside the inn along with Amandus.<\/p><p>I&rsquo;m sorry, girl. I cannot help you.&nbsp;<\/p><p>I don&rsquo;t know why but I feel bad about it. I know if I was to agree to help her, by now I would have met the same fate.<\/p><p>However, knowing what she said was true builds up a sense of guilt in my heart.<\/p><p>It can&rsquo;t be helped. I&rsquo;m not a hero after all.<\/p><p>!!!<\/p><p>Just as I turn around, someone grabs me to a corner of the building.<\/p><p>&ldquo;Who&hellip;&rdquo;<\/p><p>&ldquo;Shhh&hellip;&rdquo; The person signaled me to be quiet.<\/p><p>With your hand covering my mouth, I don&rsquo;t have a choice anyway.<\/p><p>&ldquo;It&rsquo;s me.&rdquo; He spoke.<\/p><p>Now I know who the kidnapper is--- Amandus.<\/p><p>&ldquo;They got Ciarra. Please come with me. I will explain.&rdquo;<\/p><p>Even though I knew it would be dangerous, I still followed him.<\/p><p>&ldquo;I beg you. Please help me to save her.&rdquo; He continued after we walked for a while.<\/p><p>&ldquo;How did you even get out?&rdquo;<\/p><p>&ldquo;She let herself be captured so I could sneak out.&rdquo;<\/p><p>&ldquo;Where are they going to take her?&rdquo;<\/p><p>&ldquo;It&rsquo;s that tall building over there.&rdquo;<\/p><p>I look to where Amandus is pointing at and see the town hall sticking out from the rest of the blocks.<\/p><p>&ldquo;I know you have refused to join us, but please. Just once. Just this time only. Please help me.&rdquo; Amandus begged me.<\/p><p>It caught me by surprise actually. I did not expect him to lower his pride in front of me.<\/p><p>&ldquo;Please tell me what happened.&rdquo; I asked.<\/p><p>As if my words are taken for an approval, Amandus quickly explains the details.<\/p><p>&ldquo;These are the imperial knights from the Central. They were sent after us.<\/p><p>We&rsquo;ve gotten away from them several times before they noticed us but they still managed to find us here.<\/p><p>Their mission is to find Ciarra and bring her back to Dawnguard.&rdquo;<\/p><p>&ldquo;Why do they need to bring her back to Dawnguard?&rdquo;<\/p><p>&ldquo;Because she&rsquo;s the kingdom&rsquo;s only princess and third child of the late king. The royalty wants to keep her in check.&rdquo;<\/p><p>&ldquo;She&rsquo;s a princess?!&rdquo;<\/p><p>I&rsquo;m quite shocked to hear that.<\/p><p>I cannot imagine myself meeting a princess in such a rural area.<\/p><p>I know there are stories where the royalty members travel to these towns to build up their reputation but seeing a princess running away from the capital is a first for me.<\/p><p>Especially when the ones who are trying to capture her are her own family members.<\/p><p>&ldquo;Please keep her identity a secret. I know it&rsquo;s been exposed to the knights, but letting others know about this later on will only bring troubles to us.&rdquo; Amandus warned me.<\/p><p>&ldquo;Later on? You sound like you&rsquo;re very confident in saving her.&rdquo;<\/p><p>&ldquo;I wasn&rsquo;t, but now when I&rsquo;m with you, I am.&rdquo;<\/p><p>&ldquo;How strong do I look in your eyes to give such a high evaluation of me?&rdquo;<\/p><p>&ldquo;Strong&hellip; enough to hold your own against a Hellspawn.&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>I wouldn&rsquo;t call that &lsquo;holding my own&rsquo;, more like getting my ass kicked around.<\/p><p>&ldquo;We don&rsquo;t have much time to waste. Let&rsquo;s go over the details.&rdquo;<\/p><p>Amandus then proceeds to explain the plan he has in his mind.<\/p><p>Firstly, the town hall has a basement which is rarely used, but its main purpose is to hold the bad guys since there is a lack of a prison here.<\/p><p>Secondly, he knows a secret passage that leads to that area from outside.<\/p><p>I&rsquo;m surprised he even knows this.<\/p><p>But thinking about how careful they need to be, it shouldn&rsquo;t be a surprise anymore.<\/p><p>The last step is to free Ciarra and escape from the same passage.<\/p><p>The last step sounded way too simple for such a dangerous task.<\/p><p>&ldquo;What about the knights? Won&rsquo;t they be guarding?&rdquo; I asked.<\/p><p>&ldquo;They will, but with this, we can ensure our escape.&rdquo;<\/p><p>He shows a rounded object.<\/p><p>&ldquo;This is a smoke bomb. When used, it will create smoke that covers the enemies&rsquo; vision. The prison area is narrow, they won&rsquo;t be able to easily attack, otherwise, they will hurt each other.&rdquo;<\/p><p>&ldquo;I see.&rdquo;<\/p><p>That&rsquo;s a&hellip; solid plan, if nothing goes wrong.<\/p><p>He seems experienced with it. Maybe I can trust him.<\/p><p>&ldquo;When do we start?&rdquo;<\/p><p>&ldquo;Tonight.&rdquo;<\/p><p>Night arrives, and it&rsquo;s time for action.<\/p><p>We are currently inside the secret passage.<\/p><p>It turns out the entrance for this passage is in the outskirts of the town. No wonder why this town is so messed up.<\/p><p>&ldquo;What&rsquo;s our princess like?&rdquo; I asked.<\/p><p>I want to know. I&rsquo;m curious, and it&rsquo;s been quiet the entire time. Quietness can build up stress.<\/p><p>&ldquo;You&rsquo;ve already met her.&rdquo; Amandus replied.<\/p><p>&ldquo;I know, but I don&rsquo;t know much about her. What&rsquo;s her background, personality and usual activity?&rdquo;<\/p><p>&ldquo;Save it and ask her instead after getting her out.&rdquo;<\/p><p>&ldquo;&hellip;&rdquo;<\/p><p>He must be fun at the party.<\/p><p>We arrive at the exit of the passage, which shall link to the air tunnel above the prison room.<\/p><p>Seriously, are they keeping a Hellspawn inside or something that they need such a huge passage for just an air tunnel?<\/p><p>Actually I should keep my thoughts away or I might really jinx this.<\/p><p>&ldquo;Wait here.&rdquo; Amandus whispered.<\/p><p>We calmly observe the situation of the room, scanning the surroundings.<\/p><p>We notice Ciarra is chained up behind the iron bars.<\/p><p>Opposite to her is the red-haired woman sitting down on a chair. It&rsquo;s one of the knight people that I saw earlier.<\/p><p>&ldquo;When are you going to return to us, milady?&rdquo; The woman spoke.<\/p><p>&ldquo;Never!&rdquo; Ciarra strongly answered.<\/p><p>She&rsquo;s a tough girl for someone this age.<\/p><p>How many people in this world can speak up to their opponent in a captured state?<\/p><p>&ldquo;I know it might not feel right at first, but once you&rsquo;ve joined us, you will see the world in an entire different way. I guarantee you it will be much more beautiful than the current filthy one.&rdquo;<\/p><p>&ldquo;This world is beautiful as it is.&rdquo;<\/p><p>&ldquo;Such stubbornness.&rdquo; The woman shook her head.<\/p><p>&ldquo;Anyway, enjoy your time here. Once Bryan returns, he will deal with you.&rdquo;<\/p><p>The red-haired woman walks off.<\/p><p>We wait a little longer, making sure that she really has left.<\/p><p>&ldquo;Let&rsquo;s go.&rdquo;<\/p><p>Amandus lifts off the door and we jump down.<\/p><p>&ldquo;Amandus?&rdquo; Ciarra spoke in surprise.<\/p><p>&ldquo;Milady, we&rsquo;ve come to save you.&rdquo; Amandus responded.<\/p><p>&ldquo;Him too?&rdquo; She asked.<\/p><p>I nodded.<\/p><p>&ldquo;I see. Thanks.&rdquo;<\/p><p>&ldquo;Leave it for later.&rdquo; I replied.<\/p><p>I cut the iron bars with my black sword and then the iron chains on Ciarra.<\/p><p>&ldquo;Watch out!&rdquo;<\/p><p>!!!<\/p><p>I got smashed by something huge and was sent flying off to the wall. The pile of bricks crumbled over me.<\/p><p>&ldquo;Look what we have here.&rdquo; The red-haired woman returned and spoke in a charming tone.<\/p><p>&ldquo;How did you know we are here? I thought you had left.&rdquo; Amandus asked.<\/p><p>&ldquo;Do you think I cannot sense the unusual mana source sneaking around? I left on purpose to lure you guys out.&rdquo;<\/p><p>&ldquo;Princess, I will delay her time while you escape through the air tunnel.&rdquo; Amandus turned around and told Ciarra.<\/p><p>&ldquo;What about you?&rdquo; She asked.<\/p><p>&ldquo;I&rsquo;ll catch up after.&rdquo;<\/p><p>&ldquo;No, you can&rsquo;t. She&rsquo;s too strong for you.&rdquo;<\/p><p>&ldquo;I&rsquo;ll be fine.&rdquo;<\/p><p>Amandus does not want to waste any more time and turns around to face the red-haired woman.<\/p><p>&ldquo;Surrender or die under the kingdom&rsquo;s blade!&rdquo; Amandus proudly shouted.<\/p><p>&ldquo;I&rsquo;m surprised you still declare the name of the kingdom&rsquo;s blade even though it died a long time ago.&rdquo; She mocked him.<\/p><p>&ldquo;Honour never dies!&rdquo;<\/p><p>Amandus charges forward and swings his sword at her. However, she stops his sword with her bare hand.<\/p><p>Actually, it&rsquo;s a giant dark brown-red and wood-like hand.<\/p><p>Amandus pulls out his sword, leaving a cut on her palm.<\/p><p>&ldquo;How dare you?!&rdquo;<\/p><p>she angrily swings its other arm, which is now a giant trunk.<\/p><p>It sends Amandus flying back to the iron bars.<\/p><p>It seems like she has a Blessing to transform her body part to a tree.<\/p><p>&ldquo;Princess, why are you still here? I told you to go!&rdquo;<\/p><p>Amandus realised that Ciarra was still behind him and shouted.<\/p><p>&ldquo;I&hellip; I can&rsquo;t. I can&rsquo;t leave you here.&rdquo; She cried.<\/p><p>&ldquo;Stop with the chit chat.&rdquo;<\/p><p>The woman slams down its trunk-like arm, forcing Amandus to push Ciarra away.<\/p><p>He took that hit pretty hard and now his lower body is in bad shape.<\/p><p>He grabs the smoke bomb and throws it to the ground. It instantly releases a thick smoke that covers everything.<\/p><p>&ldquo;Now go.&rdquo;&nbsp;<\/p><p>Amandus whispered to Ciarra behind him.<\/p><p>&ldquo;Petty trick.&rdquo;<\/p><p>The woman swings her arm powerfully to create wind that pushes away the smoke, clearing the room almost immediately.<\/p><p>To think that the smoke bomb would become so useless in front of her.<\/p><p>&ldquo;You, milady, can be kept alive, but him&hellip;&rdquo; The woman shook its head.<\/p><p>&ldquo;Not too fast.&rdquo;<\/p><p>I said that while getting out from the pile of bricks.<\/p><p>&ldquo;Oh&hellip; You&rsquo;re still alive?&rdquo; The woman responded.<\/p><p>&ldquo;Hero never dies.&rdquo; I replied.<\/p><p>I know it&rsquo;s such a cringey line to say, but to me, it still sounds so cool.<\/p><p>She swings its trunk-like arm at me, and I must say, the range it covers is really long.<\/p><p>I duck and slide forward while summoning my sword, then swing upward, cutting that trunk off.<\/p><p>&ldquo;Arghhh!&rdquo; It grunted.<\/p><p>I continue to press forward while it uses the other arm to stop me, but I cut it up too.<\/p><p>However, before I manage to get closer, huge sharp thorns appear from the ground and nearly stabs all over me.<\/p><p>Even though I avoided the attack, those thorns still grazed my legs and limited my movements.<\/p><p>&ldquo;Impressive ability? Now I know how you managed to survive the earlier attack.&rdquo; She mockingly said.<\/p><p>&ldquo;...&rdquo;<\/p><p>I don&rsquo;t want to waste my breath in answering. I need to focus.<\/p><p>I don&rsquo;t know why Ciarra isn&rsquo;t using any ice attacks on her but I assume those chains on her are preventing her from doing so.<\/p><p>The woman doesn&rsquo;t want to give me too much room to think and decides to attack me.<\/p><p>I somehow dodge both of its arms and thorns.<\/p><p>It feels like my body is slowly getting used to combat, almost as if it moves on its own.<\/p><p>She tries to retreat while building up a wooden shield.<\/p><p>I cut it open and do a roundhouse kick to her face.<\/p><p>&ldquo;How dare you!&rdquo; She angrily shouted.<\/p><p>She tries to retaliate with both of her trunk-like arms flying towards me.<\/p><p>I roll away from the attack and find myself in front of Amandus and Ciarra.<\/p><p>The surrounding suddenly starts shaking. Her attack just then must have destroyed the footholds.<\/p><p>&ldquo;DIE!!!&rdquo; She wanted to wrap things up.<\/p><p>However, I notice a few pieces of loose rocks falling around her spot.<\/p><p>I swing my sword as hard as I can and throw it towards the ceiling above her.<\/p><p>That pushes the shattered ceiling one last time and causes it to rain down large pieces of rocks over the woman.<\/p><p>Before she could respond, she was already buried by the rocks.<\/p><p>&ldquo;Impressive.&rdquo; Ciarra spoke up.<\/p><p>&ldquo;Let&rsquo;s quickly get out of here.&rdquo; Amandus said.<\/p><p>&ldquo;Old man, you&rsquo;re still alive?&rdquo; I said in a mocking tone.<\/p><p>&ldquo;...&rdquo;<\/p><p>The three of us get out together, with me carrying Amandus on my back since he cannot move freely.<\/p><p>We follow the same way we came in and arrive at the outskirts of the town.<\/p><p>We run further into the forest to gain a distance first.<\/p><p>Then we find a comfortable place to rest so that we can treat Amandus&rsquo;s wounds.<\/p><p>I wonder if I have accidentally killed the woman earlier. I just wanted to hold her down so I hope nothing bad happened.<\/p><p>!!!<\/p><p>Suddenly, something lands ahead of us, crashing into the ground. He wears a heavy silver armour all over his body.<\/p><p>If I recall, I think his name is Bryan.<\/p><p>&ldquo;Were you the one who did that?&rdquo; Bryan asked.<\/p><p>If he&rsquo;s talking about me burying his &lsquo;lover&rsquo; then he&rsquo;s right.<\/p><p>&ldquo;No?&rdquo; I replied.<\/p><p>I can see a few veins popped up on his forehead upon hearing that.<\/p><p>That woman must be his partner and I&rsquo;m sure he wants to avenge her.<\/p><p>But it&rsquo;s not like&hellip; she died, right?<\/p><p>He unsheathes his sword and his armour transforms, becoming thinner and more suited for fast combat.<\/p><p>That looks sick!<\/p><p>Anyway, he&rsquo;s mad now.<\/p><p>I also summon my black sword and prepare myself for the clash.<\/p><p>Lucky me that my theory of summoning the sword again works, otherwise I wouldn&rsquo;t have dared to throw it away earlier.<\/p><p>We charge at each other and exchange attacks.<\/p><p>One after another, our swords cross each other and the sound of metal clashing echoes through the forest.<\/p><p>He&rsquo;s fast. Faster than all the opponents I faced before. However, I&rsquo;m keeping up with his agility.<\/p><p>We enter a deadlock as our swords&rsquo; hand guards grip on each other.<\/p><p>!!!<\/p><p>Suddenly, his gauntlet transforms and stabs me on the shoulder.<\/p><p>I immediately try to kick him, but his chest piece grows out spikes and now my foot is full of holes.<\/p><p>&ldquo;Argh&hellip;&rdquo; I grunted.<\/p><p>It hurts.<\/p><p>Even though I can quickly recover, but everytime it happens, I still feel the pain.<\/p><p>I look at him again, but his armour has returned to its original shape.<\/p><p>He can manipulate his armour.<\/p><p>&ldquo;What did you do?&rdquo; I asked.<\/p><p>&ldquo;...&rdquo;<\/p><p>He didn&rsquo;t answer.<\/p><p>I want to delay for a few seconds so I can think of a way out.<\/p><p>I cannot beat him. I concluded.<\/p><p>I was only at an equal pace earlier, if any slower, I might get killed.<\/p><p>Yes, I can get killed, again. No surprises here.<\/p><p>Without waiting, he attacks me again.<\/p><p>I blocked the first few strikes, but now I&rsquo;m starting to struggle.<\/p><p>He deals another two quick cuts on my other shoulder and cheek.<\/p><p>This guy is dangerous. He&rsquo;s seriously aiming only at my neck.<\/p><p>What can I do?<\/p><p>I need to focus. I cannot beat him, but what about the other two?<\/p><p>Amandus is dead-ass useless, but Ciarra is still in well-shape.<\/p><p>If I can get rid of the chains on her, maybe she can release her Blessing. But&hellip; am I even sure that it was the cause?<\/p><p>!!!<\/p><p>His constant attacks keep me away from focusing. I don&rsquo;t even have a moment to gain my footing properly.<\/p><p>He thrusts his sword at me, but I manage to block its hand guard, preventing it from piercing through my neck.<\/p><p>!!!<\/p><p>His sword extends!<\/p><p>I quickly move my head aside, and it leaves a shallow cut on my neck.<\/p><p>That was so close. If I was more careless, my head would be rolling on the ground right now.<\/p><p>Looking back, he&rsquo;s now wielding a spear. So, his armour isn&rsquo;t the only thing he can transform.<\/p><p>He swings his spear around skillfully, as if he&rsquo;s adapting into a spearman stance.<\/p><p>I don&rsquo;t think I have any other choice.<\/p><p>He dashes toward me with a flurry of thrusts. I can sense this spear passing by my neck several times.<\/p><p>I bend down to dodge one more thrust and now I have my chance. I grab a handful of sand and throw it at his eyes.<\/p><p>&ldquo;You shameful bastard!&rdquo; he groaned.<\/p><p>He falls back to gain a better footing on me.<\/p><p>I can feel his vision getting worse so I immediately rush towards Ciarra.<\/p><p>&ldquo;Watch out!&rdquo; She shouted.<\/p><p>I leaped forward and barely avoided a spear thrown from him.<\/p><p>&ldquo;Hands!&rdquo; I yelled at her.<\/p><p>As if she immediately understands what I want, she lifts both her arms up to give me a clean opening on the wrist chains.<\/p><p>I cut down the chains.<\/p><p>&ldquo;Ice Wall!&rdquo;<\/p><p>When I turn around, I see a giant ice wall blocking the silver spear from reaching us.<\/p><p>&ldquo;Hah&hellip;&rdquo; I gave out a sign of relief.<\/p><p>&ldquo;You don&rsquo;t have to do this, milady.&rdquo; Bryan said.<\/p><p>&ldquo;Did you just seriously call her that? You imprisoned her just a while ago.&rdquo; I mocked him.<\/p><p>&ldquo;...&rdquo;<\/p><p>It looks like I hit the spot.<\/p><p>&ldquo;Return to where you came from, Bryan.&rdquo; Ciarra announced.<\/p><p>&ldquo;Don&rsquo;t force me to do this.&rdquo; He replied.<\/p><p>&ldquo;Ice Lance.&rdquo;<\/p><p>She casts several ice lances towards him.<\/p><p>&ldquo;Tsk&hellip;&rdquo; He grit his teeth.<\/p><p>He transforms his silver spear into a shield, breaking off any ice lance that flies towards him.<\/p><p>Ice starts to form on his feet, but before it can trap him, the spiky silver expands from his boots to break off the ice.<\/p><p>His shield now transforms back into a sword as he dashes toward us.<\/p><p>Ciarra fires off a few more ice lances but he dodges half of them and breaks the other half.<\/p><p>When he&rsquo;s about to reach her, I come out from the side and stab him on the waist, causing him to lose his balance and fall back to the other side.<\/p><p>&ldquo;Now, Ciarra!&rdquo; I shouted.<\/p><p>&ldquo;Icicle Crash.&rdquo;<\/p><p>He immediately transforms his sword to a shield again to block the attacks from above.<\/p><p>He looks at me and realises that I&rsquo;m already in a swinging position, readying to throw my sword at him.<\/p><p>He looks down on his waist as if he does not believe that the sword which was still stuck in him a second ago, has now returned to me.<\/p><p>I throw my sword straight at him.<\/p><p>He tries to lower the shield to block it, but Ciarra&rsquo;s ice attacks pressure him even further.<\/p><p>!!!<\/p><p>My sword pierces his chest, causing him to collapse on his knees.<\/p><p>Ciarra also stops her attacks.<\/p><p>I did it. I won. I celebrated inside my head. Actually, more like we did it. Both she and I.<\/p><p>But&hellip; I killed someone. Perhaps two if the lady before couldn&rsquo;t escape.<\/p><p>Did I have to? But if I didn&rsquo;t, they would have killed me. However, my morals from the previous world still torments me in the thoughts of guilt.<\/p><p>&ldquo;Are you okay?&rdquo; It was Ciarra that pulled me back to reality.<\/p><p>&ldquo;I killed a person.&rdquo; I replied.<\/p><p>I assume that it may not be a big deal in this world so she may even find it odd for me to say such things.<\/p><p>&ldquo;You didn&rsquo;t. He&rsquo;s still alive.&rdquo;<\/p><p>&ldquo;What? No, my sword pierced his heart.&rdquo;<\/p><p>&ldquo;His real body isn&rsquo;t here. Look.&rdquo;<\/p><p>I turn my attention towards whom I assume to be the remaining of Bryan but it&rsquo;s now just a pool of silvery liquid.<\/p><p>&ldquo;His Blessing allows him to create multiple versions of himself with a liquid similar to mercury. He would never risk his life coming out to a rural area.&rdquo;<\/p><p>&ldquo;But he reacted to my attacks and even lost his vision when I threw some sand at him?&rdquo;<\/p><p>&ldquo;When he wants to fully control his clone, he will synchronise his senses with it.&rdquo;<\/p><p>&ldquo;Ah&hellip; I see.&rdquo; I let out a sigh of relief.&nbsp;<\/p><p>&ldquo;Are you guys okay?&rdquo; I asked.<\/p><p>&ldquo;We&rsquo;re fine. Amandus managed to pass the critical stage.&rdquo; Ciarra answered.<\/p><p>&ldquo;I&rsquo;m glad.&rdquo;<\/p><p>&ldquo;So&hellip; You&rsquo;re coming with us?&rdquo;<\/p><p>&ldquo;Hah&hellip; Straight back to the business.&rdquo; I laughed.<\/p><p>She smiles at me.<\/p><p>I guess my luck with the ladies recently is just &lsquo;out of this world&rsquo;, isn&rsquo;t it?<\/p>"
}]