[{		
	"name" : "Dawnbringers",	
	"html" : "<p>I don&rsquo;t like troubles.<\/p><p>I have only just arrived in this world and I've been stuck with battles all day long.<\/p><p>If I join the princess&rsquo;s cause, I would get myself into more trouble. However, it is not to say that I won&rsquo;t get into one if I am by myself.<\/p><p>With them, I have at least a few more comrades who can watch my back.<\/p><p>Let&rsquo;s seriously weigh the pros and cons here.<\/p><p>If I leave, I will have less trouble and more freedom. The downside is that if I get into serious trouble, I will have no one to rely on.<\/p><p>On the other hand, joining the princess may earn me the title of hero if everything goes well. I may also get lots of money and fame.<\/p><p>The downside is that I will have to deal with more threats from Hellspawns and her own people.<\/p><p>To be fair, saying that I will get less trouble if I leave isn&rsquo;t really the case here.&nbsp;<\/p><p>Before I was aware of the princess&rsquo;s presence, I was already targeted due to the density of mana in my blood.<\/p><p>Lastly, the fact that she&rsquo;s such a cutie is a bonus. Though with old man Amandus, the bonus is neutralised.<\/p><p>She&rsquo;s still looking at me, awaiting my reply.<\/p><p>&ldquo;Princess Ciarra&hellip;&rdquo;<\/p><p>&ldquo;Just Ciarra is fine.&rdquo;<\/p><p>&ldquo;Alright. Ciarra, I&rsquo;ll join you.&rdquo;<\/p><p>&ldquo;Really?&rdquo; her eyes light up like a pair of sapphires.<\/p><p>&ldquo;Under two conditions.&rdquo; I stopped her.<\/p><p>&ldquo;If I can, I&rsquo;ll do my best to meet them.&rdquo; She replied in confidence.<\/p><p>Could she?&nbsp;<\/p><p>I mean if I ask her to be mine, would she still keep the same confident face right now?<\/p><p>&ldquo;We managed to avoid it, but we may really kill someone, perhaps more, along the journey. Can you make sure that I will not be charged for this crime once everything is over?&rdquo;<\/p><p>&ldquo;That, I can guarantee you that I will protect you with all my power. Killing is not an uncommon act in Velder, and we are only committing it for a greater good.&rdquo;<\/p><p>&ldquo;Good. The second condition is to get me a small mansion with lots of house maids as a reward for helping you out.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;Make sure the maids are cute cat girls.&rdquo;<\/p><p>This is the ultimate goal of men&mdash; to be surrounded by cute girls in maid uniforms and cat ears is one of the best things in the world.<\/p><p>I feel that once I get it, I&rsquo;ve achieved my lifelong goal.<\/p><p>I wonder if it&rsquo;s too much for her since she hasn&rsquo;t said anything to this condition.<\/p><p>&ldquo;Is it too much for you?&rdquo; I asked.<\/p><p>&ldquo;No, definitely not.&rdquo; She shook her head.<\/p><p>&ldquo;What&rsquo;s the problem then?&rdquo;<\/p><p>&ldquo;There is no problem at all. I can promise you that when everything is over.&rdquo;<\/p><p>&ldquo;But the way you reacted earlier was&hellip;&rdquo;<\/p><p>&ldquo;It&rsquo;s just that I&rsquo;m surprised you ask for such an odd reward. I expected you to ask for more than just this.&rdquo;<\/p><p>&ldquo;More than just this? This is already the biggest gift one can offer.&rdquo; I declared boldly.<\/p><p>She laughs. It was a soft one, but she definitely did.<\/p><p>&ldquo;What&rsquo;s so funny about it?&rdquo; I asked.<\/p><p>&ldquo;No, it&rsquo;s nothing.&rdquo;<\/p><p>She continues to smile.<\/p><p>&ldquo;Will you be willing to tell me your name now?&rdquo; She asked.<\/p><p>&ldquo;I&hellip;&rdquo; I hesitated.<\/p><p>I actually don&rsquo;t know the real identity of the body that I&rsquo;m currently in.<\/p><p>The only thing I can give to her is the name from my previous life, but&hellip; is it a good idea?<\/p><p>&ldquo;Vin&hellip;&rdquo;<\/p><p>She&rsquo;s still waiting for my reply.<\/p><p>&ldquo;Vincas.&rdquo; I replied.<\/p><p>To be fair, my real name isn&rsquo;t Vincas. It&rsquo;s actually Vincent.<\/p><p>My parents named me this so I would be successful in life as my name stood for winning and victory. However, it became such an ironic name for me after I failed all of their expectations.<\/p><p>&ldquo;I know I&rsquo;ve told you my name before but please allow me to formally introduce myself.<\/p><p>I am Ciarra vi Dawnguard, princess of the great Velder, kingdom of the Azure Deer. It&rsquo;s nice to make your acquaintance.&rdquo;<\/p><p>&ldquo;Me too.&rdquo;<\/p><p>&ldquo;Now you&rsquo;re one of us&hellip;&rdquo; Amandus sighed.<\/p><p>&ldquo;It&rsquo;ll be inconvenient to travel around without an identity. Let&rsquo;s register you as an adventurer.&rdquo;<\/p><p>&ldquo;Adventurer?&rdquo;<\/p><p>Is it what I think it is?<\/p><p>&ldquo;Yes. Being an adventurer allows people to travel between places and take on quests to help each other. For now though, let&rsquo;s get a proper rest first.&rdquo;<\/p><p>We decided to camp out for a night then head to another town to avoid the knights.<\/p><p><br/><br/><\/p><p>[ Ciarra&rsquo;s perspective ]<\/p><p>I was born as the only princess and the youngest royal child in the great kingdom - Velder.<\/p><p>My childhood was relatively peaceful as Dawnguard, the capital city, was secured with the protection of the main army and many high ranking adventurers.<\/p><p>Due to my status, I was barely able to tour around the city even though I grew up there.<\/p><p>Once in a while, I would have to appear publicly for an event or to make a speech. Other than that, I would spend all of my time reading books at the Royal Library of Velder.<\/p><p>I was able to learn many interesting things regarding the world&rsquo;s geography and cultures.<\/p><p>I also learned about many different kinds of Blessings and Hellspawns.<\/p><p>I told myself that one day in the future, I would be able to drive away all the Hellspawns in my homeland. After that, I would lend my help to the other kingdoms and rid this world of evil.<\/p><p>I&rsquo;ve dreamed of myself becoming a splendid queen.<\/p><p>When I was twelve, my father departed to the North due to a huge Hellspawns cluster there.<\/p><p>It was the largest cluster ever recorded in the history of Velder and its origin still remained unclear.<\/p><p>The knights of Velder were outnumbered and most of them had fallen heroically.<\/p><p>There were many adventurers who tried to help but it all ended up in vain. Eventually, they abandoned the quest, prioritising their own lives over the kingdom.<\/p><p>If the Hellspawns were to let loose, they would march on and destroy the entire kingdom, starting with Dawnguard.<\/p><p>Aware of this, my father, king of Velder, used the full power of his Blessing to cast a powerful blizzard, freezing all the Demons there. However, it cost him his life.<\/p><p>A month later, the news of the king&rsquo;s passing arrived at the capital, and everyone mourned for over a year.<\/p><p>That battle was referred to as the Everfrost War in the Velder&rsquo;s historical record.<\/p><p>My two older brothers were competing for the throne not too long after.<\/p><p>Even though I might have a slight ambition, I knew that I was incapable of ruling the kingdom so I could only sit back.<\/p><p>After nearly three years, my second brother won and became the new king of Velder.<\/p><p>However, he went to the extreme of placing our eldest brother in prison for being on the opposing party.<\/p><p>I knew that there were worse outcomes from other royal siblings&rsquo; battles over the throne in the past but we were not the same as them.<\/p><p>We had always been protecting each other despite the differences in status.<\/p><p>Even when our mothers weren&rsquo;t the same, we treated each other with respect and equality.<\/p><p>I decided to take action and tried to use my authority to free my eldest brother from the prison. However, everything fell apart on that one fateful day, when I learned about the true identity of my second brother.<\/p><p>I saw my second brother, with his right arm through the body of my lifeless eldest brother, grabbed the red thumping heart.<\/p><p>My&hellip; second brother killed my eldest brother?!<\/p><p>The weirdest thing was that my second brother, despite having the same face, had an additional red flower blooming on his right eye.<\/p><p>At that moment, I knew that my second brother was no longer the brother that I&rsquo;ve known.<\/p><p>I returned to my room after that day and cried for the whole night.<\/p><p>The next morning, my second brother greeted me as if nothing had happened.<\/p><p>I spent the next few days researching about the Hellspawns and found out that there was a unique Hellspawn named Grievesnare who would take over the body of its prey instead of killing them.<\/p><p>However, it was only recorded that Grievesnare only took over the bodies of animals and there had never been a case of a human or an appearance of that red flower before.<\/p><p>I felt that the capital was no longer safe so I planned my escape to the South. However, it looked like my plan had caught the eyes of my brother so he sent a few imperial knights after me.<\/p><p>They only needed to catch me and bring me back. However, they underestimated me.<\/p><p>Before I left, I was able to convince one of the survivors from the Everfrost War who fought alongside my father, Sir Amandus.<\/p><p>Even though he had retired, my conviction had convinced him to join my cause and he promised to keep me safe until I arrived in the South.<\/p><p>We later on managed to get to Dayswen, the southernmost town in the Central, after several successful escapes from our chasers.<\/p><p>Upon arriving at Dayswen, our attention immediately caught on to a shirtless man wandering around the street market.<\/p><p>We saw him being lured into a small alley by a group of criminals. I was going to help, but Amandus stopped me.<\/p><p>He told me that it was dangerous and I should worry about my own safety first instead of a stranger. Fortunately, the man was later on rescued by a beautiful lady.<\/p><p>Both Amandus and I then heard several rumours about a bloodthirsty Hellspawn named Thorncrackle near the southern borderline.<\/p><p>Even though it wasn&rsquo;t a huge threat, there just were enough adventurers who would bother exterminating it so it was left unchecked for a while.<\/p><p>The only ones who were always in constant worry were the townsfolk here.<\/p><p>Suddenly, the beautiful woman from earlier passed by us while carrying a suspicious large bag as if there was a body inside.<\/p><p>I believed that it could have been the homeless man from earlier so I immediately followed her despite Amandus&rsquo;s attempt to stop me.<\/p><p>When I arrived, I saw the man battling Thorncrackle with a mysterious black sword.&nbsp;<\/p><p>This sword&hellip; I&rsquo;ve seen it before in one of the oldest history books I could find in the library.<\/p><p>It was the sword of the most dangerous villain who once challenged the Above a thousand years ago in order to rule over the entire Valhalla.<\/p><p>The crack left in the sky was believed to be the aftermath of their legendary battle.<\/p><p>However, it was just a folktale that was probably made up to scare the children.<\/p><p>I stepped in and saved him from the Hellspawn.<\/p><p>Regardless of him being a villain or not, I believe that his sword holds a special power since the Hellspawn seemed to be struggling against it.<\/p><p>I decided to recruit him on my mission to restore the peace to my kingdom.<\/p><p>The rest of the event led up until now.<\/p><p>I&rsquo;m confused. Seriously confused. Why? Because of his conditions.<\/p><p>The first one is understandable because he might be afraid that he would be used as a sacrificing pawn, or he may have some moral codes that prevent him from killing a person.<\/p><p>However, the second condition is what&rsquo;s been bothering me the most.<\/p><p>A usual person will ask for lots of gold and fame for helping the princess to overthrow the current king.<\/p><p>However, he asks for only a small mansion and&hellip; lots of cute cat maids.<\/p><p>Does he even realise that if he simply asks for the gold and lands, he could have achieved the same thing and still had a fortune to spend?<\/p><p>Moreover, his face when he said it was as if he was trying to preach to me about his sacred religion. Regardless, it&rsquo;s good that he&rsquo;s simple minded.<\/p><p>I really don&rsquo;t want to be associated with those who hide their true intentions all the time.<\/p><p>&ldquo;So where are we heading next for my adventurer registration?&rdquo; He asked.<\/p><p>That&rsquo;s right. I&rsquo;ve only explained to him about my background, but I&rsquo;ve never told him about my next move.<\/p><p>&ldquo;Our destination is Graham, a major city of the South, but along the way, there is another city named Elkmont that has a Guild to help with your adventurer registration.&rdquo; I replied.<\/p><p>&ldquo;I see. Why did you have to include the word &lsquo;South&rsquo;?&rdquo; He asked.<\/p><p>&ldquo;Because it&rsquo;s the state the city is located in?&rdquo;<\/p><p>Why did he ask such a nonsense question? Everybody knows that.<\/p><p>&ldquo;How many states are there in Velder?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>He doesn&rsquo;t know.<\/p><p>I&rsquo;m certain that even those who live in the most rural regions in the kingdom would at least know the states since they were named after their cardinal direction.<\/p><p>But if he didn&rsquo;t even know the concept of Blessing, he must be someone who never pays attention to the world around him.<\/p><p>Or perhaps&hellip; It's the current education state of this kingdom that fails him.<\/p><p>I definitely need to note this down.<\/p><p>&ldquo;There are five states in Velder, based on the cardinal direction, named North, East, South, West and Central. We are currently in the southernmost part of Central.&rdquo;<\/p><p>&ldquo;I see. Thanks.&rdquo;<\/p><p>I wonder if he really gets it.<\/p><p>&ldquo;What else is in Graham?&rdquo; He asked.<\/p><p>It seems that he actually pays attention to what I told him.<\/p><p>Should I tell him though? I turn to look at Amandus.&nbsp;<\/p><p>Amandus nods at me as if he lets me decide.<\/p><p>Since he&rsquo;s a part of us now, and was definitely risking his life to save us, I think I can trust him for this much.<\/p><p>&ldquo;The head of Graham was an acquaintance of my father, the late king. He and Amandus were my father&rsquo;s comrades. Seeing how Amandus is still loyal to the kingdom&rsquo;s call, I believe Sir Graham will be too.<\/p><p>I also don&rsquo;t think the Hellspawn's influence in Dawnguard has reached other states yet since there are still many issues unresolved in the capital.&rdquo;<\/p><p>&ldquo;I see. It&rsquo;s a smart move to get more help first.&rdquo; He praised me.<\/p><p>&ldquo;I&rsquo;m surprised that you would compliment me.&rdquo; I replied.<\/p><p>&ldquo;How so? Is it strange to do that around here?&rdquo;<\/p><p>&ldquo;No, it definitely isn't. I just thought that you were more of a self-centred type.&rdquo;<\/p><p>&ldquo;What? How did you come up with this impression of me?&rdquo;<\/p><p>&ldquo;Sorry. It&rsquo;s just that when we first met, you were so quick to decline my request after only hearing it out for a bit.&rdquo;<\/p><p>&ldquo;It was different that time.&rdquo;<\/p><p>I honestly don&rsquo;t know what has changed.<\/p><p>The way he rejected me in the first place, and how he brought up conditions later on, tells me that he is someone who will only help others if he can get benefit out of it.<\/p><p>I don&rsquo;t particularly hate these types of people as they are being real to themselves.<\/p><p>It&rsquo;s a simple business deal. I help you, you help me back. As a royal, I am aware of how to handle these kinds of things.<\/p><p>However, I cannot ignore the fact that he saved me when I was chained in the prison. He could&rsquo;ve left me. However, he still came.<\/p><p>I guess the main reason was because I was the one who saved him first, so he probably wanted to return the favour.<\/p><p>Afterwards, he was able to defeat both leaders of the knights, where he could&rsquo;ve been killed.<\/p><p>If we ignore the way he talks, he isn&rsquo;t someone with a bad heart after all.<\/p><p>Thinking about this makes me feel that even without any benefit, if he sees others in danger, he probably will still help.<\/p><p>It&rsquo;s not strong, but I can feel the just part inside of him. He may just be the companion whom I&rsquo;ve been looking for.<\/p><p>&ldquo;Hey, what&rsquo;s this?&rdquo; He interrupted me.<\/p><p>&ldquo;What&rsquo;s what?&rdquo; I replied in a confused tone.<\/p><p>&ldquo;This. This piece of rock with weight light coming out of it.&rdquo; He pointed at a rock on the side.<\/p><p>&ldquo;Oh, it&rsquo;s a light stone.&rdquo;<\/p><p>&ldquo;A light stone?&rdquo;<\/p><p>&ldquo;Yes. It&rsquo;s a man-made stone that uses the mana from the surrounding to bring light to the road. It&rsquo;s used to mark distance between towns and provide directions.&rdquo;<\/p><p>&ldquo;That&rsquo;s pretty convenient. Who built that?&rdquo;<\/p><p>&ldquo;Emillia Fione, the Brilliant Light.&rdquo; I answered anyway.<\/p><p>&ldquo;Who&rsquo;s that?&rdquo; He asked again.<\/p><p>&ldquo;What do you mean who&rsquo;s that?&rdquo;<\/p><p>&ldquo;Emillia, something light. Who&rsquo;s that?&rdquo;<\/p><p>&ldquo;It&rsquo;s Emillia Fione, the Brilliant Light. She&rsquo;s ranked seventh in the Monolith!&rdquo;<\/p><p>&ldquo;What&rsquo;s a Monolith?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;Sorry, I really don&rsquo;t know.&rdquo;<\/p><p>&ldquo;It&rsquo;s alright.&rdquo; I took a deep breath.<\/p><p>I understand. He&rsquo;s a blockhead - country guy. He doesn&rsquo;t know. I cannot blame him.<\/p><p>&ldquo;Monolith refers to the huge stone tablet that displays the names of the ten strongest beings in Valhalla. There is one in each kingdom.&rdquo;<\/p><p>&ldquo;That&rsquo;s interesting. How does that stone tablet know who the strongest ones are?&rdquo;<\/p><p>&ldquo;All of the Monoliths are connected with the Adventurer Emblems. They are able to analyse the power level of the emblem holder through the amount of mana and the achievements they have, then update the information regularly.&rdquo;<\/p><p>&ldquo;That sounds cool.&rdquo;<\/p><p>&ldquo;Just for your interest, it was also Emilia who built this system.&rdquo;<\/p><p>&ldquo;I see. She must be a very respected person for her achievements.&rdquo;<\/p><p>&ldquo;You&rsquo;re right. Everybody in this kingdom owes her a lot for her inventions.&rdquo;<\/p><p>We continue on like this for a while and not for long, find ourselves already arriving at Elkmont.<\/p><p><br/><br/><\/p><p>[ Vincas&rsquo;s perspective ]<\/p><p>Guild, a place where adventurers gather around to share information and help out the townsfolk.<\/p><p>Due to the fact that Elkmont isn&rsquo;t a major city, the Guild isn&rsquo;t too packed today.<\/p><p>There are only a few quests in the paper form hung on the notice board just next to the reception desk.<\/p><p>&ldquo;Hello, adventurers. How can I help you today?&rdquo;<\/p><p>At the counter, a huge chest receptionist with a pair of dog ears greeted me. As expected of every adventurer guild receptionist that I&rsquo;ve heard of.<\/p><p>Unfortunately, I&rsquo;m more of a cat-person.<\/p><p>&ldquo;Can I register to be an adventurer?&rdquo; I asked.<\/p><p>&ldquo;Sure. Will you please fill out the information on this form while I&rsquo;m arranging an examiner for you?&rdquo; She replied.<\/p><p>&ldquo;Wait, examiner?&rdquo;<\/p><p>&ldquo;It&rsquo;s just a minor physical test to see if you have the strength to become an adventurer.&rdquo; Ciarra whispered into my ear.<\/p><p>&ldquo;Why didn&rsquo;t you tell me earlier?&rdquo;<\/p><p>&ldquo;Don&rsquo;t worry too much about it. As long as you can use Blessing, it&rsquo;s almost a guaranteed pass.&rdquo;<\/p><p>&ldquo;Hah&hellip;&rdquo;<\/p><p>I've been rick-rolled.<\/p><p>&ldquo;Are you the one taking the exam today?&rdquo;<\/p><p>A man with a similar pair of cat ears walks out. He wears a suit that resembles a manager.<\/p><p>&ldquo;Yes.&rdquo; I replied.<\/p><p>&ldquo;This way.&rdquo;<\/p><p>He guides me into the backyard of the Guild with plenty of space for sparring purposes.<\/p><p>&ldquo;My name is Connor, I&rsquo;m the manager of the Elkmont branch Guild and I&rsquo;ll also be your adventurer registration examiner for today.<\/p><p>The condition to pass this exam is simple. You can either try to touch this bell that will be hung on my waist once or avoid getting knocked out by me for a minute.<\/p><p>All weapons are forbidden, but Blessing is allowed. Killing me is also not allowed and will not only fail you the exam, but also place you in the criminal list, although I doubt you&rsquo;ll be able to do that.<\/p><p>The exam will be started when you&rsquo;re ready to make a move. Are you ready?&rdquo;<\/p><p>&ldquo;Yes.&rdquo;<\/p><p>I take a deep breath and start counting along in my mind. 3&hellip; 2&hellip; 1&hellip;&nbsp;<\/p><p>I quickly dash toward him to grab the bell.<\/p><p>!!!<\/p><p>He disappeared?!<\/p><p>Suddenly, he appears behind me and kicks me in the butt.<\/p><p>Although it&rsquo;s just a light tap, it&rsquo;s embarrassing. I can feel the giggling coming out from Ciarra and Amandus.<\/p><p>Don&rsquo;t pretend you didn&rsquo;t just giggle at me, Ciarra!<\/p><p>I turn around to grab him but once again, he disappears.<\/p><p>This time, he appears behind me again just to knock the back of my head.<\/p><p>Arghh&hellip; This is getting annoying. What is this? Need for speed?<\/p><p>I decided to gain a distance and have a clear look at him first. We&rsquo;re now back to where we were when the exam started.<\/p><p>Alright&hellip; He&rsquo;s too fast. I can&rsquo;t catch him.<\/p><p>One minute is now my goal. It&rsquo;s only been ten seconds so another fifty seconds and I&rsquo;ll be fine.<\/p><p>As soon as I drop my guard down, he appears in front of me and kicks me in the abdomen.<\/p><p>I get sent flying back a few metres.<\/p><p>Looks like he&rsquo;s not going to play around anymore.<\/p><p>Screw this, I will just follow Ciarra&rsquo;s advice and show him my Blessing.<\/p><p>I try to summon the black sword, but&hellip; it&rsquo;s not coming out?<\/p><p>What&rsquo;s going on?!<\/p><p>He already approaches me again, grabs on my shirt and tosses me around like a toy.<\/p><p>Damn it&hellip; How much longer do I need to endure this crap? Thirty? Twenty seconds?<\/p><p>And why the hell is this stupid sword not here when I need it?<\/p><p>He&rsquo;s coming at me again.<\/p><p>I try to dodge the first strike on my left, but he quickly stops half way and switches to the other hand and punches me on the face.<\/p><p>I kick him in retaliation but he easily dodges it then sends me flying again with his own kick.<\/p><p>Why am I struggling so much against him when I was able to handle a Hellspawn and two other Blessing users?<\/p><p>&ldquo;You&rsquo;re thinking too much.&rdquo; He spoke.<\/p><p>&ldquo;What?&rdquo; I asked.<\/p><p>He punches me on the face again instead of giving out an answer.<\/p><p>&ldquo;You never focus on the opponent in front of you and instead, distract yourself from other thoughts.&rdquo; He continued while hitting me like a punching bag.<\/p><p>I duck and throw my whole body at him.<\/p><p>He easily avoids that and I fall forward like a fool.<\/p><p>&ldquo;Are you really sure you want to become an adventurer?&rdquo; He sighed.<\/p><p>I hate moments like this. I seriously hate them.<\/p><p>Are you really looking down on me without even knowing what I&rsquo;m capable of?<\/p><p>When I think about this, I stand up and glare at him directly.<\/p><p>Screw the sword. I charge at him again.<\/p><p>As if he is bored of seeing the same move all over, he doesn&rsquo;t even bother to evade.<\/p><p>I suddenly slide down and aim for his right leg with a sweeping kick.<\/p><p>&ldquo;Oh&hellip;&rdquo;<\/p><p>He jumps up to dodge it&hellip; exactly like what I expected.<\/p><p>I use my left leg to launch myself upward and inside of a sweeping kick, I&rsquo;m doing an upward kick towards his chin.<\/p><p>He quickly moves his head backward to avoid the attack.<\/p><p>To be able to do that in mid-air, no wonder why he&rsquo;s so flexible the whole time.<\/p><p>I lose my balance and fall down.<\/p><p>&ldquo;Well, that was unexpected but it was a good try. Anyway, there&rsquo;s only ten seconds left now so I&rsquo;m wrapping this up.&rdquo;<\/p><p>He runs at me to deal the finishing blow.<\/p><p>&ldquo;Tadaa!&rdquo;<\/p><p>!!!<\/p><p>He stops his hand before it reaches my face.<\/p><p>Why? It&rsquo;s because I&rsquo;m showing him the bell.<\/p><p>&ldquo;How did you&hellip;?&rdquo; He asked.<\/p><p>&ldquo;Just then when you dodged my attack by moving your head back, you wouldn&rsquo;t be able to notice my hand grabbing the bell on your waist.&rdquo;<\/p><p>He stays silent for a while.<\/p><p>&ldquo;Hahaha, interesting. You passed.&rdquo; He laughed.<\/p><p>&ldquo;Hah&hellip;&rdquo; I let out a sigh of relief.<\/p><p>&ldquo;Congratulations!&rdquo; Ciarra quickly came over.<\/p><p>&ldquo;And you said it was easy?&rdquo; I complained to her.<\/p><p>&ldquo;If you show your Blessing, then he would have let you pass straight away. Anyway, why didn&rsquo;t you do that?&rdquo;<\/p><p>&ldquo;I couldn&rsquo;t.&rdquo;<\/p><p>&ldquo;You couldn&rsquo;t?&rdquo;<\/p><p>&ldquo;Yea, I don&rsquo;t know why. I just couldn&rsquo;t summon it again.&rdquo;<\/p><p>&ldquo;That&rsquo;s odd.&rdquo;<\/p><p>&ldquo;This way, please.&rdquo; The manager asked.<\/p><p>&ldquo;Let&rsquo;s wrap up the registration first and we can talk about that later.&rdquo; Ciarra said.<\/p><p>We head back in and the receptionist is seen to be preparing the paperwork.<\/p><p>Not too long after, she hands me a rounded medallion.<\/p><p>&ldquo;Congratulations on passing the test. This is your Adventurer Emblem with our kingdom symbol and your name. You can use this as your identification at any Guild, even in other kingdoms.<\/p><p>Here, you can see a circle around the emblem. It tells your current rank. Everyone starts with one circle and eventually moves up by completing quests posted on the board similar to the one over there. You can find a board like this at any Guild.&rdquo;<\/p><p>She pointed towards the notice board I saw earlier.<\/p><p>&ldquo;Each quest has a rank requirement so you can only take on quests your rank or below. Please be mindful of that as higher rank quests are dangerous for those who are not ready.<\/p><p>The highest rank is five circles, though there are only a few adventurers who have reached this level. Is there any other question you would like to ask?&rdquo;<\/p><p>Yes. Your name--- just kidding.<\/p><p>&ldquo;How can I tell my progress until the next rank?&rdquo; I asked.<\/p><p>&ldquo;You will accumulate points towards your next rank. We cannot tell you exactly how many points you are at or how much are required, but we will let you know if you have reached the threshold for ranking up.<\/p><p>However, to advance to the highest rank, you will need to pass a special trial that is hosted differently depending on the kingdom you have registered at.&rdquo;<\/p><p>&ldquo;Clear and simple. Thanks.&rdquo;<\/p><p>&ldquo;My pleasure. Once again, welcome to the Guild and I wish you luck in your adventure.&rdquo; She ended the conversation with a big smile.<\/p><p><br/><br/><\/p><p>[ Ciarra&rsquo;s perspective ]<\/p><p>Every adventurer wishes to have the same fame like those whose names are on the Monolith.<\/p><p>I know that it can be a reason for many of them to start adventuring but all of their dreams always end up being shattered into pieces after.<\/p><p>Not anyone can simply reach five circles. In fact, only one out of millions can get to that level.<\/p><p>The other hundreds of thousands live their entire life without even being able to slightly touch that tier.<\/p><p>Most of them can&rsquo;t even reach four circles and many die under the hands of Hellspawns.<\/p><p>Those whose names on the Monolith are already in another realm.<\/p><p>I personally do not see the importance of the ranking system at all.<\/p><p>Everybody should be focusing on teaming up to protect the world from Hellspawns.<\/p><p>I don&rsquo;t know since when this has become a trend that makes adventurers try to take on difficult quests in order to rank up faster.<\/p><p>As a result, they neglect easier Hellspawn extermination quests.<\/p><p>Many innocents lose their lives even from the lowest level of Hellspawns simply because no adventurers would ever come to aid them and the capital just does not have enough resources to send the imperial knights to every corner.<\/p><p>I do not know if the other kingdoms are the same, but in Velder, it&rsquo;s been like this for a while.<\/p><p>I was able to see more cases during my travels.<\/p><p>&ldquo;Hey Ciarra, I&rsquo;m just wondering about a few things.&rdquo; Vincas suddenly turned around and asked.<\/p><p>&ldquo;What is it?&rdquo; I replied.<\/p><p>&ldquo;Do adventurers only take quests from the Guild? Do large and powerful houses recruit adventurers to work for them?&rdquo;<\/p><p>&ldquo;Hm&hellip; many nobles do that, but mostly for them to give up the adventure life and become their bodyguards instead.&rdquo;<\/p><p>&ldquo;Can the adventurers take the job as a part-time thing where they still do their adventure side but if the nobles need, the nobles can pay them for each job?&rdquo;<\/p><p>&ldquo;I think some of the nobles have done that before, especially when the adventurers are very high ranking.&rdquo;<\/p><p>&ldquo;I see.&rdquo;<\/p><p>That is very unexpected of him to ask something like this.&nbsp;<\/p><p>Normally, he only asks basic questions when I mention something he doesn&rsquo;t know, but this is the first time he&rsquo;s actively asking me.<\/p><p>&ldquo;Also, do adventurers team up here, like creating a party to take on quests?&rdquo;<\/p><p>&ldquo;It&rsquo;s not too common but also not unheard of. They do sometimes when the quests are too difficult or if they want to spread their influence as a group instead of an individual.&rdquo;<\/p><p>&ldquo;I see.&rdquo;<\/p><p>What is he thinking? Why is he suddenly asking me all of the questions?<\/p><p>&ldquo;Why did you ask that?&rdquo;<\/p><p>&ldquo;Hm&hellip; both you and Amandus are also adventurers, right?&rdquo;<\/p><p>&ldquo;Yes, we both have registered beforehand so we can travel around easier.&rdquo;<\/p><p>&ldquo;I see. Do you want to form a team with me?&rdquo;<\/p><p>&ldquo;A team? I don&rsquo;t think finding a missing child will need a...&rdquo;<\/p><p>&ldquo;No, it&rsquo;s not for this quest. Actually, kind of, but it&rsquo;s more about all the future quests.&rdquo;<\/p><p>I&rsquo;m genuinely confused at what he is trying to do.<\/p><p>&ldquo;But&hellip; why?&rdquo;<\/p><p>&ldquo;If we successfully build up our team&rsquo;s name, we will attract attention from many people, right?&rdquo;<\/p><p>&ldquo;Yes&hellip;?&rdquo;<\/p><p>&ldquo;Among them, some of the noble families in the capital may send an offer to us to go there and work for them, right?&nbsp;<\/p><p>We don&rsquo;t really need to be their bodyguards and will only help them through each request. This way, we can gather information easier and if we do a good job, we can even have them backing us up in future conflicts.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;What&rsquo;s wrong? Why are you so quiet? Hey old man, what do you think?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>I look at Amandus and he looks at me with the same stunned eyes.<\/p><p>&ldquo;How did you come up with this?&rdquo;<\/p><p>&ldquo;What do you mean?&rdquo;<\/p><p>&ldquo;Sorry, it&rsquo;s just in my impression that you&rsquo;re someone who&hellip;&rdquo; I suddenly stopped.<\/p><p>&ldquo;Who&hellip; what?&rdquo;<\/p><p>He&rsquo;s waiting for me to complete my sentence.<\/p><p>But&hellip; How can I possibly say that I&rsquo;ve always thought of him as someone who has no educational background or even capable of some logical thoughts processing?<\/p><p>&ldquo;Did you actually think how a country-pumpkin like me could think of this idea?&rdquo;<\/p><p>&ldquo;Yea&hellip; wait, what? No, I didn&rsquo;t mean that!&rdquo;<\/p><p>What? How could he read my mind?<\/p><p>&ldquo;...&rdquo;<\/p><p>Oh no&hellip; Was my expression that obvious? I feel so bad right now.<\/p><p>&ldquo;No, Vincas&hellip; I&hellip;&rdquo;<\/p><p>&ldquo;Hahaha&rdquo; he laughed.<\/p><p>&ldquo;What?... Why are you laughing?&rdquo;<\/p><p>&ldquo;Because it&rsquo;s funny. I don&rsquo;t recall being treated as an idiot for a while now. It&rsquo;s like a brand new and fresh experience for me haha.&rdquo;<\/p><p>&ldquo;Sorry. I must have been mean.&rdquo;<\/p><p>&ldquo;Mean? How so? You were right. I kept asking all those stupid questions that probably every kid in here would know. I&rsquo;m rather surprised that you still ended up explaining things to me every single time. I should be the one to say sorry.&rdquo;<\/p><p>&ldquo;Finally you realise how much you&rsquo;ve been bothering milady, huh?&rdquo; Amandus suddenly spoke up.<\/p><p>&ldquo;Old man, if you never talk, I wouldn&rsquo;t remember you even existed.&rdquo; He replied.<\/p><p>&ldquo;You brat!!&rdquo; Amandus angrily shouted.<\/p><p>They both immediately get into close combat.<\/p><p>&ldquo;Hm&hellip; hahaha.&rdquo; I laughed.<\/p><p>Suddenly, both of them stop and turn their focus on me.<\/p><p>&ldquo;Sorry, my laughter must have been embarrassing.&rdquo; I replied.<\/p><p>&ldquo;No, it&rsquo;s cute. I like it.&rdquo; Vincas replied.<\/p><p>&ldquo;Ah&hellip;&rdquo; I blushed.<\/p><p>What is he saying?<\/p><p>I don&rsquo;t know why, but those words of his give me a tingling feeling in my head. It&rsquo;s a strange feeling with a touch of warmth that wraps around my face.<\/p><p>!!!<\/p><p>&ldquo;Ouch! What was that for?!&rdquo; Vincas shouted.<\/p><p>Apparently, Amandus knocked on his head.<\/p><p>&ldquo;How dare you try to court the kingdom&rsquo;s princess?!&rdquo; Amandus snorted at him again.<\/p><p>They both engage in another close combat.<\/p><p>Once again, I cannot hold my laughter and let it out like a child.<\/p><p>&ldquo;Wait, guys. Let&rsquo;s go back to the topic. What name should we call our team?&rdquo; Vincas said.<\/p><p>&ldquo;Who said we are forming a team with you?&rdquo; Amandus replied.<\/p><p>&ldquo;Pfft, I wasn&rsquo;t asking you, old man.&rdquo;<\/p><p>&ldquo;You&hellip;&rdquo;<\/p><p>&ldquo;What name is in your mind, Vincas?&rdquo; I replied.<\/p><p>&ldquo;Milady?&rdquo; Amandus looked at me in surprise.<\/p><p>&ldquo;It&rsquo;s okay. His idea was actually well-thought and you know it too. We can simply use the team&rsquo;s name in the future instead of our own names so it will be even more convenient for our journey. It doesn&rsquo;t hurt to try it out, doesn&rsquo;t it?&rdquo; I smiled.<\/p><p>&ldquo;I see. I respect your decision, milady.&rdquo; Amandus agreed.<\/p><p>&ldquo;How biassed can you be, old man? When she said that, you respected her decision but when I said it, you were ridiculing me?&rdquo; Vincas snorted.<\/p><p>&ldquo;Because you&rsquo;re a country-pumpkin.&rdquo; Amandus simply replied.<\/p><p>&ldquo;...&rdquo;<\/p><p>To be fair, I&rsquo;m surprised too to see Amandus acting like this.<\/p><p>He wasn&rsquo;t always used to arguing or expressing himself but recently, with Vincas here, he has been showing a wide range of emotions.<\/p><p>It&rsquo;s mostly the negative ones, unfortunately.<\/p><p>&ldquo;What name do you like, Ciarra?&rdquo; Vincas asked.<\/p><p>&ldquo;I haven&rsquo;t thought of any yet.&rdquo; I replied.<\/p><p>&ldquo;How about Lightbringers, milady?&rdquo; Amandus suggested.<\/p><p>&ldquo;It&rsquo;s not bad.&rdquo; I replied.<\/p><p>&ldquo;Which part of us is a bringer of light, old man?&rdquo; Vincas asked.<\/p><p>&ldquo;It&rsquo;s just a metaphor, okay? Idiot like you would never get it.&rdquo;<\/p><p>&ldquo;If that is so, why don&rsquo;t we use the name Dawnbringers?&rdquo;<\/p><p>&ldquo;How is it different from my suggestion?&rdquo;<\/p><p>&ldquo;The royal family&rsquo;s last name is Dawnguard, right? So is the capital. Dawn marks the first light before the sunrise. It means we are the ones who bring a new day to the people, right?&nbsp;<\/p><p>Isn&rsquo;t this exactly what we&rsquo;re trying to achieve? Bringing a better future for the kingdom?&rdquo;<\/p><p>&ldquo;You&rsquo;re just trying to plagiarise my idea.&rdquo;<\/p><p>&ldquo;Whatever.&rdquo;<\/p><p>&ldquo;We&rsquo;ll go with Dawnbringers.&rdquo; I replied.<\/p><p>&ldquo;What&hellip;&rdquo; Amandus looked at me.<\/p><p>&ldquo;As Vincas has explained, I also agree that this name is more suitable.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;Sorry, Amandus.&rdquo;<\/p><p>&ldquo;It&rsquo;s alright, milady.&rdquo;<\/p><p>I feel bad for not siding with Amandus but as a royalty, I cannot be favouring over anyone.<\/p><p>&ldquo;Well, to the Dawnbringers.&rdquo;<\/p><p>Vincas lifts his fist up towards us.<\/p><p>Both Amandus and I fist pump in response.<\/p><p>&ldquo;To the Dawnbringers.&rdquo;<\/p>"
}]