[{	
	"name" : "Orphanage",
	"html" : "<p>[ Vincas&rsquo;s perspective ]<\/p><p>Today, we have planned to get some new clothes for me since my villager shirt has gotten dirty from all the battles.<\/p><p>We&rsquo;ve arrived at the tailor store but I wonder how I am going to explain to them that I don&rsquo;t even have a single coin on me.<\/p><p>I bet that they have realised it though.<\/p><p>&ldquo;Which one do you like?&rdquo; Ciarra asked.<\/p><p>&ldquo;Hm&hellip;&rdquo; I hesitated.<\/p><p>&ldquo;It&rsquo;s okay. I&rsquo;m paying.&rdquo; She smiled.<\/p><p>Goddess!<\/p><p>Seriously, I&rsquo;m such a shameless bastard for even shouting that out loud in my mind.<\/p><p>&ldquo;Are you sure?&rdquo; I asked.<\/p><p>&ldquo;Then you pay?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;Just kidding. I&rsquo;m buying this for you as a gift for helping us back there.&rdquo;<\/p><p>&ldquo;Hah&hellip;&rdquo;<\/p><p>I browse around for a bit until I stop upon a simple black shirt with three diagonal silver stripes.<\/p><p>&ldquo;You have good eyes, young man.&rdquo; Someone spoke up.<\/p><p>She&rsquo;s a middle-aged woman with casual clothing but still stands out enough to show that she&rsquo;s the owner.<\/p><p>&ldquo;It comes in a pair with this black pant here. This set gives off a mysterious feeling without being too dark or overstyled.&rdquo;<\/p><p>&ldquo;Basically not too edgy, I suppose.&rdquo;<\/p><p>&ldquo;Edgy?&rdquo;<\/p><p>&ldquo;No, sorry. How much for this set?&rdquo;<\/p><p>&ldquo;Two silver coins.&rdquo;<\/p><p>Honestly, I don&rsquo;t know how much two silver coins are worth.<\/p><p>Seeing that Ciarra casually takes out two pieces of silver from her pouch that seems to have at least a hundred more means that it&rsquo;s not that big of a deal for them.<\/p><p>She ends up paying another silver coin for a pair of leader shoes since mine was filled with holes.<\/p><p>I should consider changing my job to become a scammer.<\/p><p>Interestingly though, the wounds on my body have all healed up.<\/p><p>My recovery rate is definitely not normal as I remember my body was in a bad shape from the first Hellspawn encounter but the very next day, I woke up just fine.<\/p><p>Ciarra and Amandus also have not questioned about this either so perhaps it&rsquo;s a natural thing to them. I suppose it&rsquo;s also related to the amount of mana inside my body that allows for such fast recovery.<\/p><p>&ldquo;Looking good.&rdquo; Ciarra gave a thumb up at me after I walked out with the new clothes.<\/p><p>&ldquo;Thanks.&rdquo;<\/p><p>&ldquo;Look like an ugly crow.&rdquo; Amandus mocked me.<\/p><p>&ldquo;Still better than an old owl.&rdquo; I replied.<\/p><p>&ldquo;...&rdquo;<\/p><p>You will never be able to beat me with words, Amandus.<\/p><p>&ldquo;Hey Ciarra, do you know what this is?&rdquo; I showed the back of my right hand to her.<\/p><p>While I was changing my clothes, I noticed an odd circular black mark like ink there and I was trying to rub it off initially because I thought it was some dirt but it just wouldn&rsquo;t come off.<\/p><p>&ldquo;Oh, this is the mark of Blessing.&rdquo; she replied.<\/p><p>&ldquo;Ah&hellip; So this was how I summoned my sword?&rdquo;<\/p><p>&ldquo;I suppose so. Every person&rsquo;s mark looks different and is also in a different location. Only the users know how to activate their Blessings.&rdquo;<\/p><p>&ldquo;I see. I guess it wasn&rsquo;t just some convenient summoning techniques.&rdquo;<\/p><p>&ldquo;The way how you activate your Blessing should be similar to how you were able to awaken it in the first place. You told us that you first summoned the sword when you fought with Thorncrackle, so maybe there was a reason that triggered it.&rdquo;<\/p><p>&ldquo;Hm&hellip;&rdquo; I put myself into some deep thoughts.<\/p><p>Survival instinct?<\/p><p>That might explain why I was not able to summon the sword during the adventurer test but could do it before. However, did I really think of only surviving back then?<\/p><p>During the rescue mission, I wasn&rsquo;t thinking of surviving. I was only thinking of getting her out of there.<\/p><p>Since I&rsquo;ve arrived in this world, I often have this sense of guilt whenever I turn myself away from helping others. Perhaps this is the reason?<\/p><p>Maybe the trigger for this is&hellip; justice?<\/p><p>!!!<\/p><p>&ldquo;Oh&hellip;&rdquo; Ciarra reacted.<\/p><p>I was right. Just as I thought of serving justice, the black sword once again appeared within my right hand.<\/p><p>&ldquo;Did you figure it out? What was the trigger?&rdquo; Ciarra curiously asked.<\/p><p>&ldquo;It was the sense of justice. If I want to do what I believe is just, the sword comes out to help me.&rdquo; I replied.<\/p><p>&ldquo;...&rdquo;<\/p><p>Suddenly, Ciarra becomes stunned for a bit.<\/p><p>&ldquo;What&rsquo;s wrong?&rdquo;<\/p><p>&ldquo;Nothing. I was just surprised that you could figure it out so quickly.&rdquo;<\/p><p>A moment later, we arrive at the Guild again. We then head over to where the notice board is after greeting the receptionist.<\/p><p>&ldquo;Let&rsquo;s take on this one.&rdquo; Ciarra handed the paper to me after a bit of scanning.<\/p><p>I read the content of the quest&mdash; Find a missing child.<\/p><p>What?&nbsp;<\/p><p>What do you mean by finding a missing child? Is this kid a Hellspawn or something?<\/p><p>&ldquo;Hey Ciarra, what&rsquo;s with this?&rdquo; I turned around and asked.<\/p><p>&ldquo;What? It&rsquo;s a quest.&rdquo; She replied.<\/p><p>&ldquo;Yes I know, but why find a missing child?&rdquo;<\/p><p>&ldquo;Because the Guild needs someone capable of finding this kid who has gone missing?&rdquo;<\/p><p>&ldquo;Alright&hellip;&rdquo;<\/p><p>I take a deep breath and try to rephrase my question.<\/p><p>&ldquo;What does this have to do with exterminating Hellspawns?&rdquo;<\/p><p>&ldquo;Oh&hellip; Don&rsquo;t tell me you think that the Guild only gives out quests to hunt Hellspawns?&rdquo;<\/p><p>I nod to that question.<\/p><p>&ldquo;The Guild will give out quests that help anyone in the town. It was operating this way before the Hellspawns even appeared.&rdquo;<\/p><p>&ldquo;Does it mean that you can rank up without even killing Hellspawns?&rdquo;<\/p><p>&ldquo;Not really. You get very little points in these quests. People who take on this quest only care about the reward, which is usually money, or just out of good will.&rdquo;<\/p><p>&ldquo;Right.&rdquo;<\/p><p>&ldquo;Let&rsquo;s register our team first, then we&rsquo;ll take on the quest.&rdquo;<\/p><p>We head to the reception desk and quickly try to complete the paperwork to register the three of us as a team named Dawnbringers.<\/p><p>&ldquo;Are we really doing this?&rdquo; Amandus sighed.<\/p><p>It looks like he still hasn&rsquo;t accepted his defeat.<\/p><p>&ldquo;Milady, the whole idea and even the name were just some quick suggestions from him. Are you sure we should take them seriously?&rdquo;<\/p><p>What do you mean by not taking it seriously? I was pretty serious about it, okay? I put some thoughts into that!<\/p><p>&ldquo;It&rsquo;s a good name. I like it.&rdquo; Ciarra said.<\/p><p>&ldquo;But milady&hellip;&rdquo;<\/p><p>&ldquo;It&rsquo;s fine, Amandus. You&rsquo;re thinking too much.&rdquo;<\/p><p>That&rsquo;s right. I&rsquo;m your saviour. Give me some respect, old man.<\/p><p>The receptionist, in her usual bursty uniform, asks for our Adventurer Emblems so she can complete the paperwork.<\/p><p>We all hand over our emblems. I slightly peek at Ciarra's and Amandus&rsquo;s emblems and see that they are also one circle like me.<\/p><p>After a while, the receptionist returns the emblems to us, which now have the team name &ldquo;Dawnbringers&rdquo; engraved on them.<\/p><p>I wonder how she was able to do that.<\/p><p>As agreed before, we decided to take on the quest to find the missing child.<\/p><p>The first step is to find the one who posted the quest and get more information. Written on the paper is a person named Dave, the head of an orphanage.<\/p><p>Isn&rsquo;t it odd that there&rsquo;s an orphanage running in such a small town? How does it possibly get funded when it&rsquo;s located at the borderline?<\/p><p><br/><br/><\/p><p>[ Elkmont&rsquo;s orphanage ]<\/p><p>It&rsquo;s a small orphanage, built with mediocre materials. I guess it can&rsquo;t be helped since this is just a small town.<\/p><p>A man in his thirties, dressed neatly, walks out to welcome us. He must be Dave.<\/p><p>&ldquo;Welcome. What can I do for you?&rdquo; He asked.<\/p><p>Behind him are four little kids around the age of six to eight. Two boys and two girls.<\/p><p>One boy and one girl look almost identical. I think they are twins.<\/p><p>They all hide behind his back like what every shy kid does. I can see that the twins are even trembling.<\/p><p>Do I look that scary to you? It must be the old man behind me that scares you, right?<\/p><p>&ldquo;We are the adventurers known as the Dawnbringers. We&rsquo;re here to take on the quest you posted yesterday.&rdquo; Ciarra spoke as our representative.<\/p><p>&ldquo;Oh, thank you. Please come in.&rdquo; He politely replied.<\/p><p>Dave guides us inside and gets the chairs for us. He then pours each of us a cup of water.<\/p><p>&ldquo;My name is Dave. As you can see, I&rsquo;m the owner of this orphanage as well as the current caretaker of these kids. They were all abandoned by their parents at my doorstep.&rdquo;<\/p><p>After the introduction, he calls the kids to gather around. They are still shy and hide behind him.<\/p><p>&ldquo;From my left to right, this is Styn and Sylph. They are twins. Next to them is Bucio and Fevea. Say hello, boys and girls.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>&ldquo;Sorry, they&rsquo;re a little bit shy.&rdquo;<\/p><p>&ldquo;It&rsquo;s okay.&rdquo; Ciarra smiled at them.<\/p><p>&ldquo;There&rsquo;s usually one more. His name is Mitch and he&rsquo;s the one who has gone missing.&rdquo;<\/p><p>&ldquo;May you please tell us more about it?&rdquo;<\/p><p>&ldquo;Around two days ago, we were having our usual breakfast. After the meal, Mitch said he needed to go help the owner at a tailor store.<\/p><p>She had always treated him nicely and in return, he would offer help such as carrying and passing small things around. However, he didn&rsquo;t return this time.<\/p><p>Finding it strange that Mitch hadn&rsquo;t returned past noon, I went to visit that tailor store and found out that he never went there in the first place.<\/p><p>I then searched around the town and even outside but he was nowhere to be found. The next day, I decided to request help from the Guild.&rdquo; Dave concluded.<\/p><p>&ldquo;I see. Did you know which direction Mitch headed when he left here?&rdquo;<\/p><p>&ldquo;I believe it was towards the tailor store. That was why I did not suspect it at all.&rdquo;<\/p><p>&ldquo;Then what clothes did he put on when he left and what does he look like?&rdquo;<\/p><p>&ldquo;He was wearing a simple grey shirt with a dark brown jacket and short pants. He has short brown red hair, and is around this tall.&rdquo; Dave showed us his estimation.<\/p><p>&ldquo;I see. Thanks for your help, sir. We will be on our way immediately.&rdquo; Ciarra bowed at him.<\/p><p>She&rsquo;s really capable, isn&rsquo;t she?<\/p><p>The more I see how she handles things, the more she shows how she is clearly capable of chasing after her goal.<\/p><p>&ldquo;Say bye, boys and girls.&rdquo;&nbsp;<\/p><p>Dave tries to ask the kids to send their farewell to us but we only get a few hand waves. It looks like they are not used to strangers visiting after all.<\/p><p>According to Dave&rsquo;s information, we decided to head back to the tailor store that we visited this morning.<\/p><p>After a bit of questioning, it seems that she really does not know anything, though she clearly shows her concern for Mitch.<\/p><p>She offers help so we ask if she can ask others and look around the town. To make sure, we also tell her the clothes Mitch was wearing.&nbsp;<\/p><p>We then go around the town and still cannot find anything.<\/p><p>&ldquo;Milady, it&rsquo;s getting dark soon. I think we should return to the inn and continue tomorrow.&rdquo; Amandus suggested.<\/p><p>&ldquo;But&hellip;&rdquo;<\/p><p>Ciarra seems like she does not want to quit because of her concern for the kid.<\/p><p>&ldquo;I can keep going. You two go back and take a rest.&rdquo; I suggested.<\/p><p>I have good stamina. I&rsquo;ve been walking the entire time and don't feel any fatigue at all. It was the same when I first woke up.<\/p><p>However, I understand that they must be tired, especially Ciarra because at the end of the day, she&rsquo;s still a princess so this isn&rsquo;t really her kind of thing.<\/p><p>&ldquo;If Vincas wants to keep going, then I cannot simply give up.&rdquo; Ciarra replied.<\/p><p>&ldquo;But milady&hellip;&rdquo;<\/p><p>&ldquo;It&rsquo;s fine. I can handle this much.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>Ciarra&rsquo;s determination leaves Amandus speechless.<\/p><p>She&rsquo;s so much stronger than your average princess, isn&rsquo;t she?<\/p><p>We decide to head out of town since there&rsquo;s a chance he might have gone outside to play.<\/p><p>Oh&hellip; I think I&rsquo;ve found something.<\/p><p>&ldquo;Hey guys, come over here.&rdquo; I called.<\/p><p>&ldquo;What is it?&rdquo; Amandus and Ciarra came over and asked.<\/p><p>&ldquo;Look, there&rsquo;s a mark here.&rdquo; I pointed.<\/p><p>It&rsquo;s a shallow mark left behind from somebody falling onto the ground. There&rsquo;s two faint hand marks here and another two round marks under. There&rsquo;s also a boulder over there.<\/p><p>&ldquo;The handprints are small, like a child's. I think he tripped on this boulder and fell down here.&rdquo; I explained.<\/p><p>&ldquo;Yes, it definitely seems so.&rdquo; Ciarra replied.<\/p><p>We finally retrieve some clues for his whereabouts. We then trace the footsteps and search around the area.<\/p><p>Eventually, we arrived at the entrance of a cave.<\/p><p>We find further traces of somebody sleeping just a few steps inside the entrance. It looks like Mitch has slept here over the night.<\/p><p>A young boy all the way outside here alone, he must be a brave one.<\/p><p>!!!<\/p><p>Suddenly, we hear a sound of screaming further in the cave.<\/p><p>&ldquo;Was that Mitch?&rdquo; Ciarra asked.<\/p><p>We quickly rush inside and see a boy who matches Mitch&rsquo;s description surrounded by three weird looking lizards.<\/p><p>I quickly rush over and jump over one of them to land myself between the lizards and Mitch.<\/p><p>&ldquo;You okay?&rdquo; I checked on Mitch.<\/p><p>&ldquo;I&rsquo;m fine. Who are you?&rdquo; He replied.<\/p><p>&ldquo;I&rsquo;ll tell you later. Let&rsquo;s get out of here first.&rdquo;<\/p><p>&ldquo;Okay.&rdquo;<\/p><p>He&rsquo;s a lot calmer than what I&rsquo;ve expected. No wonder why he could spend a night in the wild.<\/p><p>I check on my opponents&mdash; three dark purple lizards about the size of an alligator, except with a few additional spikes here and there on the bodies.<\/p><p>What the hell are these things?<\/p><p>&ldquo;Watch out, Vincas. These are the Blue Scale Salamanders. They can spit deadly venom!&rdquo; Ciarra shouted.<\/p><p>Just as she said, something seems to move up from these salamanders&rsquo; necks. They then spit out a weird purple liquid like substance towards me.<\/p><p>I grab Mitch and leap back.&nbsp;<\/p><p>The place where we stood a second ago is releasing steam like the ground is burning.<\/p><p>That&rsquo;s dangerous. I&rsquo;ll be done in one hit.<\/p><p>&ldquo;Ice Lance!&rdquo;<\/p><p>!!!<\/p><p>The salamanders suddenly get confused from the ice attacks and let out a few panicking cries.<\/p><p>&ldquo;They need to build up venom for each attack. I&rsquo;m holding them back! Quickly! Aim for the heads!&rdquo; Ciarra shouted.<\/p><p>Hearing that, I dash in front of them and slice the head of one of them. The second one readies the venom attack but I quickly decapitate it too.<\/p><p>I turn towards the third one and realise that it&rsquo;s no longer there.<\/p><p>&ldquo;Milady, watch out!&rdquo;<\/p><p>Amandus jumps in front of the third one and cuts its head off before he unleashes the venom spit.<\/p><p>It seems that the third one realised there were more enemies behind so it tried to shift its focus to Ciarra instead.<\/p><p>Luckily, Amandus was there.<\/p><p>&ldquo;Are you alright, milady?&rdquo;<\/p><p>&ldquo;I&rsquo;m fine. Thanks, Amandus.&rdquo;<\/p><p>&ldquo;It&rsquo;s my duty after all, unlike someone else.&rdquo; Amandus openly mocked me.<\/p><p>&ldquo;...&rdquo;<\/p><p>He&rsquo;s right though. I was being careless. I rushed in without any plan and left the princess&rsquo;s side.<\/p><p>I was supposed to prioritise her safety above others since I&rsquo;m her bodyguard. However, how can I possibly watch a poor child about to be devoured by these beasts in front of me?<\/p><p>Then again, I still need to take responsibility for my mistake.<\/p><p>&ldquo;My bad, Ciarra.&rdquo; I apologised.<\/p><p>&ldquo;It&rsquo;s fine, Vincas. You&rsquo;re rushing in to save Mitch after all.&rdquo; She replied with a smile.<\/p><p>We get ourselves out of the cave first just in case of another attack.<\/p><p>&ldquo;Is your name Mitch?&rdquo; Ciarra asked the boy.<\/p><p>&ldquo;...&rdquo;<\/p><p>However, he&rsquo;s hesitating to answer.<\/p><p>&ldquo;Were you sent by my father?&rdquo; Mitch spoke up.<\/p><p>&ldquo;Yes, we were requested by your father to find you.&rdquo; Ciarra answered.<\/p><p>&ldquo;I&rsquo;m not going back!&rdquo;<\/p><p>&ldquo;Boy, your father has been looking for you these past few days. He&rsquo;s worried. Don&rsquo;t be all naughty now.&rdquo; Amandus said.<\/p><p>&ldquo;I don&rsquo;t care! I&rsquo;m not going back!&rdquo;<\/p><p>&ldquo;Come on, it&rsquo;s already dark.&rdquo; Amandus moved forward, but I stopped him.<\/p><p>&ldquo;It&rsquo;s late, Vincas. The princess still needs to rest.&rdquo; Amandus said.<\/p><p>&ldquo;No, let&rsquo;s listen to him first.&rdquo; I explained.<\/p><p>&ldquo;But&hellip;&rdquo;<\/p><p>&ldquo;It&rsquo;s fine, Amandus. I want to know the reason too.&rdquo; Ciarra agreed.<\/p><p>&ldquo;Thanks, Ciarra. Now, Mitch, why don&rsquo;t you want to return?&rdquo; I asked.<\/p><p>&ldquo;...&rdquo;&nbsp;<\/p><p>Mitch still refuses to tell us.<\/p><p>&ldquo;It&rsquo;s alright, Mitch. We&rsquo;re here to help you.&rdquo; Ciarra smiled at Mitch.<\/p><p>&ldquo;I&rsquo;m scared to go back.&rdquo; He replied.<\/p><p>The princess&rsquo;s smile is really effective, isn&rsquo;t it? Mitch, you pervert.<\/p><p>&ldquo;We&rsquo;ll protect you. Tell us what happened.&rdquo; Ciarra continued.<\/p><p>&ldquo;My father is actually&hellip;&rdquo;<\/p><p>Huh? What is it? Why did he stop?<\/p><p>&ldquo;Hey Mitch, I&rsquo;m so glad you&rsquo;re alright!&rdquo;&nbsp;<\/p><p>Dave came out from behind us.<\/p><p>&ldquo;Thanks, guys! Thank you so much for finding Mitch! I was so worried.&rdquo; He said while grabbing Ciarra&rsquo;s hands.<\/p><p>I turn around and check on Mitch. His whole body is shaking like a scared cat.<\/p><p>It looks like he&rsquo;s afraid of Dave. But why?<\/p><p>&ldquo;Come on, Mitch. Let&rsquo;s go home. You guys too. Please come over so I can hand you the reward. It&rsquo;s not much, but I hope it will be of help.&rdquo; Dave said.<\/p><p>&ldquo;Okay.&rdquo; Ciarra replied.<\/p><p>&ldquo;Hold up. Something&rsquo;s not right here.&rdquo; I stopped them.<\/p><p>&ldquo;What&rsquo;s wrong?&rdquo; Ciarra asked.<\/p><p>The others have the same question shown on their faces.<\/p><p>&ldquo;I think Mitch was trying to tell us something. Let&rsquo;s hear it out first.&rdquo; I suggested.<\/p><p>When we turn our attention to Mitch, he has already frozen up with his face looking down.<\/p><p>&ldquo;Mitch, you wanted to say something earlier. What is it?&rdquo; I asked.<\/p><p>However, there&rsquo;s only silence from him.<\/p><p>&ldquo;Mitch, are you okay?&rdquo;<\/p><p>He still doesn&rsquo;t reply.<\/p><p>Why? Why is he acting this way?<\/p><p>&ldquo;I think Mitch is still terrified from his experience over the night. Let&rsquo;s return first and ask him later when he feels better.&rdquo; Dave suggested.<\/p><p>&ldquo;That&rsquo;s right. I think we shouldn&rsquo;t force him too much.&rdquo; Ciarra also agreed.<\/p><p>But I do not agree.&nbsp;<\/p><p>He was talking normally before.<\/p><p>Sure, he might be afraid, but definitely not to the point of trembling and freezing up, especially when Dave arrived.<\/p><p>&ldquo;Let&rsquo;s keep him with us for a night first.&rdquo; I proposed.<\/p><p>&ldquo;What?&rdquo; <\/p><p>Amandus was the first one to respond.<\/p><p>&ldquo;We can&rsquo;t just keep a kid with us. Moreover, his father is here and he has a home to return to.&rdquo; Amandus argued.<\/p><p>&ldquo;I agree with him. We need to return the kid to his father.&rdquo; Ciarra added on.<\/p><p>&ldquo;But it&rsquo;s just not right. Something's not right here.&rdquo; I said.<\/p><p>&ldquo;What is it that is not right?&rdquo; Dave asked.<\/p><p>&ldquo;I think that the kid is afraid of you.&rdquo; I spoke in a straightforward tone.<\/p><p>Everyone seems a little bit surprised by my words as if I just said some odd stuff.<\/p><p>&ldquo;Alright. Maybe you feel that I was the reason that Mitch left in the first place. I agree that it was my carelessness that led to this point, and I&rsquo;m willing to take responsibility for it. Please give me a chance to become a responsible father to make up for it.&rdquo; Dave pleaded.<\/p><p>&ldquo;What&rsquo;s wrong with you? He made a mistake but now the kid is fine. Everybody makes a mistake.&rdquo; Amandus seemed irritated.<\/p><p>&ldquo;It&rsquo;s not about that.&rdquo; I responded.<\/p><p>&ldquo;Then what is it?&rdquo;<\/p><p>&ldquo;I don&rsquo;t know. I can only feel that something is not okay with Mitch.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>It seems that no one here takes on my explanation.<\/p><p>&ldquo;I&rsquo;m okay. I will go with my father.&rdquo; Mitch broke the silence.<\/p><p>&ldquo;What? No, Mitch.&rdquo; I stopped him.<\/p><p>&ldquo;It&rsquo;s fine. Thanks, mister, for worrying about me.&rdquo; Mitch said.<\/p><p>He then grabs onto Dave&rsquo;s hand.<\/p><p>&ldquo;...&rdquo;<\/p><p>I guess that&rsquo;s how it is. Maybe I&rsquo;m the weird one here.<\/p><p>The event ends with us receiving a reward of two silver coins from Dave.<\/p><p>I intend to refuse but Ciarra tells me that it&rsquo;s better to accept so that they won&rsquo;t feel that they owe us something. Apparently it will make them feel better.<\/p><p>We return to our inn and plan to stay for a night before moving on to Graham.&nbsp;<\/p><p>At least, that was what Ciarra and Amandus thought we would be doing.<\/p><p>I sneak out of the inn when both of them fall asleep from exhaustion.&nbsp;<\/p><p>The reason?&nbsp;<\/p><p>Because I believe that there is something fishy going on between Dave and Mitch.<\/p><p>Mitch&rsquo;s behaviour showed that he was afraid of Dave, but still followed him. It means that Dave has something that threatens Mitch.<\/p><p>I must unravel the truth for the kid&rsquo;s sake.<\/p><p>I arrive at the orphanage and since the door is locked, I sneak to the back to find another way to get in.<\/p><p>It&rsquo;s awfully quiet around here.<\/p><p>I know it&rsquo;s already night but I don&rsquo;t think it&rsquo;s the kids&rsquo; bedtime yet, especially when they just reunited with Mitch.<\/p><p>Luckily for me, one of the windows is not locked. Perhaps one of the kids forgot about it.<\/p><p>I lightly open the window and hop in.<\/p><p>I was right. There&rsquo;s no one inside. Something&rsquo;s definitely not normal here.<\/p><p>I try searching around the orphanage and find an odd stair that leads further down. It seems to be originally hidden by a bookshelf just right above it.<\/p><p>There&rsquo;s a secret basement, huh?<\/p><p>&ldquo;Hey.&rdquo;<\/p><p>!!!<\/p><p>I quickly turn around, and to my surprise, both Ciarra and Amandus are behind me.<\/p><p>&ldquo;What are you guys doing here?&rdquo; I responded quietly.<\/p><p>&ldquo;We should be the ones to ask that. What are you doing here?&rdquo; Ciarra asked.<\/p><p>&ldquo;I&rsquo;m investigating Dave.&rdquo;<\/p><p>&ldquo;Why are you so cautious about him?&rdquo;<\/p><p>&ldquo;I don&rsquo;t know. Both he and Mitch gave me a feeling that something was not right.&rdquo;<\/p><p>&ldquo;What are we going to do then?&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>Seriously, you both follow me all the way here and still ask what we are going to do?<\/p><p>&ldquo;I found a secret basement. Let&rsquo;s head down.&rdquo;<\/p><p>&ldquo;No. It&rsquo;s too dangerous.&rdquo; Amandus refused.<\/p><p>&ldquo;I&rsquo;m fine, Amandus. Let&rsquo;s go.&rdquo; Ciarra said.<\/p><p>&ldquo;But milady&hellip;&rdquo;<\/p><p>&ldquo;Don&rsquo;t worry. Vincas is here to protect us if something goes wrong.&rdquo;<\/p><p>&ldquo;...&rdquo;<\/p><p>How are you so confident in my ability after just a few days?<\/p><p>Anyway, we all follow the stairs down the secret basement quietly.<\/p><p>&ldquo;No! Please stop!&rdquo;<\/p><p>Suddenly, we hear the sound of a kid screaming.<\/p><p>After getting in a safe position, we see that all the kids are getting beaten up with a whip by Dave.<\/p><p>Damn it! I knew this was going to happen.<\/p><p>Just as I try to jump in, Ciarra stops me. She gives me a signal to wait first and observe more.<\/p><p>Even though I don&rsquo;t agree, she was right because I have not located Mitch yet.<\/p><p>Ciarra pulls my hand sleeve to get my attention, and then points in a direction. There, I saw Mitch lying down on the floor in blood.<\/p><p>&ldquo;You all disappointed me.&rdquo; Dave spoke in a scary tone to the kids.<\/p><p>He then turns around to Mitch.<\/p><p>&ldquo;Especially you, Mitch. We don&rsquo;t need you here anymore.&rdquo;<\/p><p>He drags Mitch over to the back of the basement. However, Mitch retaliates by biting on his hand.<\/p><p>&ldquo;Argh! You ungrateful bastard!&rdquo; he slapped Mitch violently.<\/p><p>As if it&rsquo;s still not done, he then walks over to a large box and removes a piece of cloth on top.<\/p><p>&ldquo;GRRRRRHHHH!!!&rdquo;<\/p><p>A terrifying screeching sound comes out from a creature with a huge pair of bat wings.<\/p><p>Hellspawn?!<\/p><p>Mitch becomes so terrified that he even pisses his pants.<\/p><p>&ldquo;Mitch!&rdquo; Ciarra jumped in the frame even faster than I did.<\/p><p>&ldquo;Milady!&rdquo; Amandus quickly followed.<\/p><p>&ldquo;What are you guys doing here?!&rdquo; Dave reacted to our intrusion.<\/p><p>&ldquo;What did you think you were doing to the kids?!&rdquo; Ciarra asked angrily.<\/p><p>&ldquo;None of your business.&rdquo;<\/p><p>Dave unleashes the Hellspawn from the box and it immediately leaps toward Ciarra.<\/p><p>&ldquo;Watch out!&rdquo; I quickly pulled her back.<\/p><p>&ldquo;You and Amandus look after the kids. I&rsquo;ll deal with this.&rdquo; I said.<\/p><p>I then summon the black sword on my right hand and enter a battle stance.<\/p><p>It looks like you really need some justice there, Dave. Even my sword agrees.<\/p><p>Dave isn&rsquo;t saying anything. Neither am I.<\/p><p>I need to be careful here, as my objective is to save the kids, not about killing this Hellspawn.<\/p><p>Looking at this guy, the wings are definitely its weapon because it just tried to kill the princess with that.<\/p><p>When I observe carefully, it looks like a giant humanoid bat with a monstrous face and sharp claws over its wings.<\/p><p>As if it knows that I&rsquo;m still in the analysing process, it suddenly attacks me.<\/p><p>!!!<\/p><p>I quickly swing my sword upward but it&rsquo;s already gone.<\/p><p>Where is it?!<\/p><p>&ldquo;Above!&rdquo; Ciarra shouted.<\/p><p>I quickly dash to the side just in case. Just as I do that, it lands down with a huge thrust using the claw on one of its bat wings.<\/p><p>I made the right decision. If I was to look up first like many others, I would have died there.<\/p><p>Thank you, Ciarra. You saved me.<\/p><p>While its claw is still stuck on the ground, I dash toward it with a stab.<\/p><p>It quickly gets out and does a round house cut.<\/p><p>I duck, but it immediately follows with a kick in my face.<\/p><p>I get sent back but quickly regain my composure.<\/p><p>I feel a bit of blood oozing inside my mouth. I spit it out.<\/p><p>Cool, isn&rsquo;t it?<\/p><p>Ciarra, Amandus and the kids have all gone upstairs, leaving me, this beast and&hellip;<\/p><p>Where&rsquo;s Dave?!<\/p><p>&ldquo;Ice Lance.&rdquo;<\/p><p>I heard Ciarra&rsquo;s casting her Blessing right above.<\/p><p>!!!<\/p><p>The Hellspawn broke off the basement ceiling.<\/p><p>I also follow them and get upstairs just to see several broken ice lances on the floor. It appears that they were broken off by something coming out of Dave&rsquo;s arm.<\/p><p>His left arm has become a sharp single giant claw extending from his torso.<\/p><p>&ldquo;Yikes.&rdquo; I felt disgusted.<\/p><p>The Hellspawn suddenly turns its attention towards Ciarra as if it is trying to avenge Dave.<\/p><p>I quickly tries to cut its head clean but it manages to swing its wing claw towards me and fences off the attack.<\/p><p>&ldquo;GRRRR&hellip;&rdquo; It snared at me.<\/p><p>!!!<\/p><p>A sharp noise echoes across the orphanage.<\/p><p>It was Dave and an odd whistle on his other hand.<\/p><p>The Hellspawn suddenly turns around, grabs Dave and leaps up in the air.<\/p><p>&ldquo;It&rsquo;s trying to break out of here!&rdquo; Amandus shouted.<\/p><p>I throw my sword at it but the Hellspawn spins its body around and deflects my attack.<\/p><p>!!!<\/p><p>It&rsquo;s two sharp wing claws pierce through the ceiling and both of them break off into the sky.<\/p><p>&ldquo;Icicle Crash!&rdquo;<\/p><p>Ciarra summons a wave of ice spears falling from the sky and lands a direct hit on the Hellspawn.<\/p><p>&ldquo;GRAAAAHHH!!!&rdquo; It screamed as both of them steered off the air and fell down.<\/p><p>&ldquo;Quickly!&rdquo; I gave a signal for everyone to get out before the building collapsed.<\/p><p>&ldquo;Ahhhh!!!&rdquo;<\/p><p>We all hear multiple screamings from the villagers who get woken up by this commotion.<\/p><p>The Hellspawn, as if it&rsquo;s pissed off by these loud screams, angrily attacks the villagers.<\/p><p>&ldquo;Stop!&rdquo; I charged at it.<\/p><p>!!!<\/p><p>Dave stops my attack with his weird claw.<\/p><p>&ldquo;Why the hell are you on the Hellspawn&rsquo;s side?!&rdquo; I shouted at him.<\/p><p>&ldquo;Hah&hellip; hahahaha.&rdquo; He broke off the standstill and started laughing.<\/p><p>&ldquo;You&hellip;&rdquo;<\/p><p>&ldquo;So what if I&rsquo;m on the Hellspawn&rsquo;s side? Does that make you a hero then?&rdquo;<\/p><p>I try to reach the Hellspawn to stop its massacre but Dave stops me again.<\/p><p>&ldquo;Get out of the way!&rdquo;<\/p><p>&ldquo;Hahaha&hellip;&rdquo;<\/p><p>&ldquo;Ciarra!&rdquo; I called.<\/p><p>&ldquo;&lsquo;I&rsquo;m trying.&rdquo; She replied.<\/p><p>She casted several ice lances but they are all in vain due to the Hellspawn&rsquo;s speed and also because she&rsquo;s afraid to hit the villagers.<\/p><p>&ldquo;That&rsquo;s right. Let out those cries of desperation as you all watch this town turning into a blood pool.&rdquo; Dave declared.<\/p><p>&ldquo;Not too fast.&rdquo;<\/p><p>!!!<\/p><p>A huge blow from the side sends Dave flying all the way back to the already crumbled orphanage.<\/p><p>Standing amidst the fading dust is a well dressed man with a pair of dog ears.<\/p><p>&ldquo;The Guild manager&hellip;&rdquo; I spoke up in shock.<\/p><p>&ldquo;It&rsquo;s Connor. I thought I told you that last time.&rdquo; he replied.<\/p><p>&ldquo;Hayyaaahhh!&rdquo;<\/p><p>A loud female scream echoes through the air. It&rsquo;s the bursty receptionist!<\/p><p>Wait, she can fight?<\/p><p>I cannot believe what I&rsquo;m even seeing with my eyes. It&rsquo;s a scene of a beast girl jumping through the air and kicking the Hellspawn&rsquo;s ass.<\/p><p>&ldquo;She can handle the Hellspawn. Let&rsquo;s capture the guy.&rdquo; Connor calmly addressed.<\/p><p>&ldquo;Right.&rdquo;<\/p><p>!!!<\/p><p>Suddenly, something leaps out of the crumbles and almost instantly, five giant claws appear right in front of Connor and I.<\/p><p>We quickly step back and avoid the attack.<\/p><p>Dave then reveals himself with five giant claws coming out of his left side torso.<\/p><p>&ldquo;I&rsquo;ll kill you all!&rdquo;<\/p><p>Connor lets out a sigh and steps forward to face him off.<\/p><p>Well, I guess I&rsquo;ll let the manager handle the job here.<\/p><p>&ldquo;Are you guys alright?&rdquo; I went to check out the rest of the gang.<\/p><p>&ldquo;The kids are terrified.&rdquo; Ciarra reported.<\/p><p>&ldquo;It&rsquo;s not safe here. We need to get them somewhere away from this battleground.&rdquo;<\/p><p>&ldquo;Over there.&rdquo; Amandus pointed at the tailor store.<\/p><p>&ldquo;Go. I&rsquo;ll help the Guild.&rdquo; I told them.<\/p><p>&ldquo;Let me help.&rdquo; Ciarra said.<\/p><p>&ldquo;No. You stay with the kids. They need you.&rdquo;<\/p><p>&ldquo;He&rsquo;s right. I cannot look after all five of them.&rdquo; Amandus also agreed.<\/p><p>&ldquo;Alright.&rdquo; She nodded and they all ran over there.<\/p><p>Now, what should I do?<\/p><p>Two options, helping the manager to fight Dave, or helping the receptionist to fight the Hellspawn.<\/p><p>&ldquo;...&rdquo;<\/p><p>!!!<\/p><p>&ldquo;GRAAHHHH!!!&rdquo; the Hellspawn cried angrily.<\/p><p>&ldquo;What are you doing here?&rdquo; The receptionist asked.<\/p><p>&ldquo;I&rsquo;m helping you.&rdquo; I replied.<\/p><p>&ldquo;I&rsquo;m fine on my own. Help the manager.&rdquo; She refused.<\/p><p>I look over the other battle&rsquo;s direction and see Connor pounding Dave left and right.<\/p><p>&ldquo;No&hellip; I don&rsquo;t think he needs my help either.&rdquo; I coldly replied.<\/p><p>&ldquo;Watch out!&rdquo;&nbsp;<\/p><p>She pushes me away from the Hellspawn&rsquo;s sneak attack.<\/p><p>&ldquo;Fine. Let&rsquo;s quickly finish this guy off together.&rdquo; She finally answered my call.<\/p><p>Bang&hellip; Bang&hellip; Bang&hellip;<\/p><p>One after another, she leaps through the air and throws powerful punches at the Hellspawn&rsquo;s face with precision.<\/p><p>How the hell is she doing that?<\/p><p>No point in guessing. I find every opportunity possible and land in some critical hit on the Hellspawn each time it tries to recover from the receptionist&rsquo;s attacks.<\/p><p>Not for long, one of its wings becomes so badly damaged that it can no longer fly.<\/p><p>&ldquo;Grrrrr&hellip;&rdquo; It cried weakly at us.<\/p><p>Looks like it&rsquo;s about time to finish it off.<\/p><p>&ldquo;...&rdquo;<\/p><p>Wait&mdash; Why is it looking elsewhere?<\/p><p>!!!<\/p><p>Suddenly, it leaps at me and I immediately defend myself with an upperward cut.<\/p><p>It uses the attack&rsquo;s force and bounces towards Dave and Connor instead.<\/p><p>&ldquo;Manager!&rdquo; The receptionist shouted.<\/p>"
}]